{
    "batting_averages": [
        {
            "": "Tests",
            "100": "1",
            "50": "2",
            "6s": "0",
            "Ave": "26.00",
            "Ct": "13",
            "HS": "114",
            "Inns": "36",
            "Mat": "24",
            "NO": "5",
            "Runs": "806",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "96",
            "50": "159",
            "6s": "",
            "Ave": "40.98",
            "Ct": "346",
            "HS": "285*",
            "Inns": "1025",
            "Mat": "647",
            "NO": "116",
            "Runs": "37252",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "1",
            "5w": "1",
            "Ave": "48.73",
            "BBI": "5/49",
            "BBM": "6/107",
            "Balls": "2926",
            "Econ": "2.99",
            "Inns": "31",
            "Mat": "24",
            "Runs": "1462",
            "SR": "97.5",
            "Wkts": "30"
        },
        {
            "": "First-class",
            "10": "23",
            "4w": "",
            "5w": "107",
            "Ave": "24.42",
            "BBI": "9/61",
            "BBM": "",
            "Balls": "93615",
            "Econ": "2.87",
            "Inns": "",
            "Mat": "647",
            "Runs": "44926",
            "SR": "50.9",
            "Wkts": "1839"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154856.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/052004/052257.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/052004/052257.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nFebruary 11, 1891, York Villas, Waterloo Road, Uxbridge, Middlesex "
        ],
        "Bowling style": [
            "Legbreak googly"
        ],
        "Died": [
            "September 14, 1965, West Drayton, Middlesex (aged 74 years 215 days) "
        ],
        "Full name": [
            "John William Hearne"
        ],
        "Major teams": [
            "England,",
            "Middlesex"
        ]
    },
    "profile_info": [
        null,
        "\"Young Jack\" Hearne (so-called to distinguish him from his Middlesex\nteam-mate and distant cousin JW Hearne) was a fine all-rounder who, part\nfrom the interruption to his career caused by World War One, would certainly\nhave reached a hundred hundreds. He was also an excellent leg break and\ngoogly bowler who took over 1,800 first-class wickets at an average of under\n25. He batted very correctly, invariably straight, and was a master at\nplacing the ball into gaps. A strong driver and hard hitter in his youth\ndespite a comparatively frail physique, he moderated his approach as he grew\nolder, but scored runs consistently, often in partnership with his friend Patsy Hendren. Altham said of Hearne \"he very clearly displayed the hallmark of class - the ability to play every stroke with perfect balance and in slow time\". He cut well, could force the ball through the covers off the back-foot, and was\nsuperb on the on-side. At times he relied more on his defensive prowess, and\nwas quite happy to wait for his runs when the conditions demanded it. He\nbowled his well-controlled leg-breaks and googlies from no more than a\ncouple of paces with a quick action that allowed him to bowl at close to\nmedium pace. He was less effective after the War, when on occasion control\nwould desert him, but when in form he was a very fine bowler indeed. An\nexcellent fielder who never flinched from the hard-hit ball - in 1928 he\ncaught and bowled Constantine, injuring his hand so severely in the process\nhe missed the rest of the season.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}