{
    "batting_averages": [
        {
            "": "Tests",
            "100": "1",
            "4s": "40",
            "50": "0",
            "6s": "1",
            "Ave": "20.38",
            "BF": "529",
            "Ct": "8",
            "HS": "107",
            "Inns": "13",
            "Mat": "7",
            "NO": "0",
            "Runs": "265",
            "SR": "50.09",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "22",
            "4s": "",
            "50": "50",
            "6s": "",
            "Ave": "38.48",
            "BF": "",
            "Ct": "196",
            "HS": "251",
            "Inns": "259",
            "Mat": "155",
            "NO": "11",
            "Runs": "9545",
            "SR": "",
            "St": "0"
        },
        {
            "": "List A",
            "100": "5",
            "4s": "377",
            "50": "16",
            "6s": "64",
            "Ave": "35.64",
            "BF": "3828",
            "Ct": "52",
            "HS": "144",
            "Inns": "108",
            "Mat": "115",
            "NO": "8",
            "Runs": "3564",
            "SR": "93.10",
            "St": "0"
        },
        {
            "": "T20s",
            "100": "1",
            "4s": "241",
            "50": "11",
            "6s": "72",
            "Ave": "24.37",
            "BF": "1565",
            "Ct": "53",
            "HS": "161",
            "Inns": "93",
            "Mat": "102",
            "NO": "3",
            "Runs": "2194",
            "SR": "140.19",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "6",
            "Econ": "0.00",
            "Inns": "1",
            "Mat": "7",
            "Runs": "0",
            "SR": "-",
            "Wkts": "0"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "45.70",
            "BBI": "2/9",
            "BBM": "2/9",
            "Balls": "2279",
            "Econ": "3.60",
            "Inns": "83",
            "Mat": "155",
            "Runs": "1371",
            "SR": "75.9",
            "Wkts": "30"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "86.50",
            "BBI": "1/6",
            "BBM": "1/6",
            "Balls": "342",
            "Econ": "6.07",
            "Inns": "23",
            "Mat": "115",
            "Runs": "346",
            "SR": "85.5",
            "Wkts": "4"
        },
        {
            "": "T20s",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "29.80",
            "BBI": "2/5",
            "BBM": "2/5",
            "Balls": "126",
            "Econ": "7.09",
            "Inns": "14",
            "Mat": "102",
            "Runs": "149",
            "SR": "25.2",
            "Wkts": "5"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/1155468.html",
        "http://www.espncricinfo.com/ci/content/story/1153490.html",
        "http://www.espncricinfo.com/ci/content/story/1148629.html",
        "http://www.espncricinfo.com/ci/content/story/1148179.html",
        "http://www.espncricinfo.com/ci/content/story/1147927.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=251721"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/277000/277067.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/277000/277067.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/277000/277067.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nSeptember 25, 1987, Whitby, Yorkshire "
        ],
        "Bowling style": [
            "Right-arm offbreak"
        ],
        "Current age": [
            "30 years 327 days"
        ],
        "Education": [
            "Caedmon School; Whitby Community College"
        ],
        "Full name": [
            "Adam Lyth"
        ],
        "Height": [
            "\n5 ft 9 in "
        ],
        "Major teams": [
            "England,",
            "England Lions,",
            "England Under-19s,",
            "Yorkshire,",
            "Yorkshire 2nd XI"
        ],
        "Nickname": [
            "Peanut"
        ],
        "Playing role": [
            "Batsman"
        ]
    },
    "profile_info": [
        "\nOf the Yorkshire trio of Gary Ballance, Adam Lyth and Joe Root, it is Lyth who possesses the most natural ability. There may have been a little hyperbole in the claim by his county captain, Andrew Gale, on behalf of his shaven-headed leftie at a time when the international stock of Ballance and Root was growing every week. But it caused many to observe Adam Lyth more carefully than ever before and 2014 was the year that his career approached fulfilment. \n",
        "Lyth's stock rose markedly as he spearheaded Yorkshire's successful Championship challenge in 2014, his panache now accompanied by a greater discipline.  He had begun life as an opening batsman in the modern mould - happy to attack the new ball with an array of shots - but it was his willingness to graft through more difficult periods that took him to a new level as he scored 1,489 championship runs, including six centuries, at 67.68.  His opening partnership with Alex Lees even brought heady comparisons with Herbert Sutcliffe and Len Hutton before WW2 and, if such talk was dangerous, especially as neither had played for England, it captured their growing stature.",
        "It was when Lyth and Lees put on 375 for the second wicket against Northants at Wantage Road that Gale became so animated. It was the fourth highest partnership in Yorkshire's first-class history, behind the revered 555 of Holmes and Sutcliffe against Essex at Leyton in 1932, 554 put on by Brown and Tunnicliffe against Derbyshire at Chesterfield in 1898, and 378 also by Brown and Tunnicliffe against Sussex at Bramall Lane the previous year. ",
        "His maturing batsmanship won a succession of Player of the Year awards and he ended the summer as a realistic contender for an England opening batting spot. That opportunity came in 2015, and he quickly took a hundred off the New Zealand tourists on his home turf at Headingley, but five Tests against Australia brought only 105 runs at 13.12 as he became the latest opening contender to fail to fill the vacancy left by the retirement of Andrew Strauss.\n \nNevertheless, his Yorkshire run glut had revived memories of his exciting breakthrough season in 2010 as he jumped out of the starting blocks, scoring so heavily there were thoughts he could reach 1000 Championship runs before the end of May. He narrowly missed out but soon made his first Roses hundred, off 122 balls, as his standing continued to rise.",
        "There was even talk of him receiving a shock call up for England's 2010-11 Ashes series but it was wide of the mark and while Lyth's career became characterised both by exhilarating strokeplay and careless dismissals it was the more dependable approach of his county colleague Joe Root whose international star rose.",
        "Lyth has long been marked down as a player of genuine potential. He had trials with Manchester City as a schoolboy before he made his first-team debut for Yorkshire aged 19 in a Pro40 match against Hampshire 2006 and a first-class debut the next season - the first player from Whitby, on Yorkshire;s east coast, to be so honoured. What should have been a solid follow-up season in 2009 was thrown into uncertainty as he was shifted up and down the order and in and out the side due to Michael Vaughan's campaign to win an England call-up before the Ashes. He only played four Championship games and averaged a lowly 31.42.",
        "The winter's break and a new regime at Yorkshire, under Gale, clearly invigorated Lyth but the challenge of maintaining the standards he set in 2010 proved a difficult one. After his 1,509 first-class runs in 2010 he lost his place the following season.",
        "He continued to find runs hard to come by in 2012, at least initially, advancing the belief that for all his exhilarating strokeplay, he suffered too many soft dismissals. But then, almost out of the blue, at Leicester in July, he not only completed his first first-class century for more than two years but turned it into his first double hundred, ending on 248 not out. It was the highest score by any Yorkshire batsman to carry his bat through an innings in the county's history.  He was the only Yorkshire player to be picked for all 16 Championship matches in 2013, but for another season he continued to thrill and frustrate in equal measure before blossoming during Yorkshire's triumphant Championship campaign a year later.",
        "His love for golf made one story of his growing concentration particularly appropriate. He started his wonderful 2014 season by working on his concentration with Yorkshire's sports psychologist Simon Hartley on the putting green at Wyke Golf Club in Leeds. Hartley set the challenge of knocking in as many successive two-foot putts as possible. The norm for a professional golfer is between 50 and 100. Lyth knocked in 213 - yet another double century. His England rejection proved only a temporary knock-back and, as well as the fourth double ton of his career in 2016, against Surrey at The Oval, it was his return to Yorkshire's T20 side that sparked an unlikely rush to Finals Day.",
        "That T20 form was even more spectacular in 2017, full of off-side carves, and highlighted by his 161 off 73 balls against Northants at Headingley, which was the highest individual score at the time in English T20 and the third highest T20 score in the world. Yorkshire's total of 260-4 was just three short of equalling the world record score.",
        null,
        "\n"
    ],
    "recent_matches": [
        {
            "Bat & Bowl": "44, 1/23",
            "Ground": "Leeds",
            "Match Date": "17 Aug 2018",
            "Opposition": "v Notts",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "0/9, 66",
            "Ground": "Northampton",
            "Match Date": "16 Aug 2018",
            "Opposition": "v Northants",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "0/14, 14",
            "Ground": "Nottingham",
            "Match Date": "10 Aug 2018",
            "Opposition": "v Notts",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "0",
            "Ground": "Leeds",
            "Match Date": "9 Aug 2018",
            "Opposition": "v Lancashire",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "0",
            "Ground": "Leeds",
            "Match Date": "3 Aug 2018",
            "Opposition": "v Northants",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "4",
            "Ground": "Leeds",
            "Match Date": "31 Jul 2018",
            "Opposition": "v Leics",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "21",
            "Ground": "Leeds",
            "Match Date": "30 Jul 2018",
            "Opposition": "v Derbyshire",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "8",
            "Ground": "Chesterfield",
            "Match Date": "28 Jul 2018",
            "Opposition": "v Derbyshire",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "40",
            "Ground": "Leeds",
            "Match Date": "27 Jul 2018",
            "Opposition": "v Bears",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "70, 4",
            "Ground": "Manchester",
            "Match Date": "22 Jul 2018",
            "Opposition": "v Lancashire",
            "Scorecard": "FC",
            "Team": "Yorkshire"
        }
    ]
}