{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "36",
            "50": "2",
            "6s": "0",
            "Ave": "18.00",
            "BF": "894",
            "Ct": "3",
            "HS": "61",
            "Inns": "20",
            "Mat": "12",
            "NO": "2",
            "Runs": "324",
            "SR": "36.24",
            "St": "0"
        },
        {
            "": "ODIs",
            "100": "0",
            "4s": "53",
            "50": "1",
            "6s": "6",
            "Ave": "20.45",
            "BF": "478",
            "Ct": "23",
            "HS": "69",
            "Inns": "32",
            "Mat": "73",
            "NO": "8",
            "Runs": "491",
            "SR": "102.71",
            "St": "0"
        },
        {
            "": "T20Is",
            "100": "0",
            "4s": "3",
            "50": "0",
            "6s": "0",
            "Ave": "8.40",
            "BF": "52",
            "Ct": "9",
            "HS": "9*",
            "Inns": "13",
            "Mat": "32",
            "NO": "8",
            "Runs": "42",
            "SR": "80.76",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "10",
            "4s": "",
            "50": "37",
            "6s": "",
            "Ave": "33.03",
            "BF": "",
            "Ct": "78",
            "HS": "180",
            "Inns": "238",
            "Mat": "168",
            "NO": "38",
            "Runs": "6606",
            "SR": "",
            "St": "0"
        },
        {
            "": "List A",
            "100": "0",
            "4s": "142",
            "50": "2",
            "6s": "16",
            "Ave": "19.85",
            "BF": "1754",
            "Ct": "61",
            "HS": "71",
            "Inns": "112",
            "Mat": "187",
            "NO": "32",
            "Runs": "1588",
            "SR": "90.53",
            "St": "0"
        },
        {
            "": "T20s",
            "100": "0",
            "4s": "48",
            "50": "0",
            "6s": "11",
            "Ave": "13.01",
            "BF": "645",
            "Ct": "46",
            "HS": "36*",
            "Inns": "84",
            "Mat": "159",
            "NO": "32",
            "Runs": "677",
            "SR": "104.96",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "5",
            "5w": "1",
            "Ave": "40.63",
            "BBI": "5/64",
            "BBM": "7/178",
            "Balls": "2616",
            "Econ": "3.82",
            "Inns": "20",
            "Mat": "12",
            "Runs": "1666",
            "SR": "63.8",
            "Wkts": "41"
        },
        {
            "": "ODIs",
            "10": "0",
            "4w": "6",
            "5w": "1",
            "Ave": "30.80",
            "BBI": "5/27",
            "BBM": "5/27",
            "Balls": "3778",
            "Econ": "5.52",
            "Inns": "70",
            "Mat": "73",
            "Runs": "3481",
            "SR": "33.4",
            "Wkts": "113"
        },
        {
            "": "T20Is",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "28.82",
            "BBI": "3/25",
            "BBM": "3/25",
            "Balls": "630",
            "Econ": "7.68",
            "Inns": "30",
            "Mat": "32",
            "Runs": "807",
            "SR": "22.5",
            "Wkts": "28"
        },
        {
            "": "First-class",
            "10": "1",
            "4w": "28",
            "5w": "19",
            "Ave": "34.93",
            "BBI": "7/107",
            "BBM": "11/114",
            "Balls": "28701",
            "Econ": "3.60",
            "Inns": "273",
            "Mat": "168",
            "Runs": "17225",
            "SR": "58.2",
            "Wkts": "493"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "9",
            "5w": "2",
            "Ave": "30.48",
            "BBI": "5/27",
            "BBM": "5/27",
            "Balls": "8691",
            "Econ": "5.38",
            "Inns": "178",
            "Mat": "187",
            "Runs": "7805",
            "SR": "33.9",
            "Wkts": "256"
        },
        {
            "": "T20s",
            "10": "0",
            "4w": "5",
            "5w": "0",
            "Ave": "22.64",
            "BBI": "4/19",
            "BBM": "4/19",
            "Balls": "3243",
            "Econ": "7.45",
            "Inns": "153",
            "Mat": "159",
            "Runs": "4030",
            "SR": "18.2",
            "Wkts": "178"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/1155383.html",
        "http://www.espncricinfo.com/ci/content/story/1154638.html",
        "http://www.espncricinfo.com/ci/content/story/1153890.html",
        "http://www.espncricinfo.com/ci/content/story/1153877.html",
        "http://www.espncricinfo.com/ci/content/story/1153684.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=244497"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/278900/278974.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/278900/278974.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/278900/278974.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nFebruary 17, 1988, Bradford, Yorkshire "
        ],
        "Bowling style": [
            "Legbreak"
        ],
        "Current age": [
            "30 years 182 days"
        ],
        "Full name": [
            "Adil Usman Rashid"
        ],
        "Height": [
            "\n5 ft 8 in "
        ],
        "Major teams": [
            "England,",
            "Adelaide Strikers,",
            "England Lions,",
            "England Under-19s,",
            "ICC World XI,",
            "Marylebone Cricket Club,",
            "South Australia,",
            "Yorkshire,",
            "Yorkshire 2nd XI"
        ],
        "Nickname": [
            "Dilly"
        ],
        "Playing role": [
            "Bowler"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nYoung spinners in England will always make headlines if they take wickets. When it is a young legspinner the hype is magnified. When it is a young spinner of Pakistani extraction, brought up in Yorkshire, the sense of excitement becomes palpable. Adil Rashid, the player who above all symbolized Yorkshire's growing success in fostering strong relationships in its minority ethnic communities, burst onto the scene with six wickets against Warwickshire on his first-class debut in 2006 at Scarborough. There was a sense in Yorkshire's much-loved seaside town that afternoon as Rashid cut through Warwickshire that a historic breakthrough had been made and more than one Yorkshire supporter observed Rashid's performance with hearts uplifted. \n",
        "A decade later, as he left a tour of India in which England had been trounced 4-0, it was still occasionally possible to see the vulnerable, taciturn 18-year-old of whom Yorkshire were so protective. Rashid had 10 Test caps, all of them in the UAE or South Asia where England needed a second spinner, but even on such surfaces he needed careful handling in case his leg spin succumbed under the pressure. He seemed happiest in limited-overs cricket where the game unfolded in a more predictable fashion and he knew that batsmen would be committed to attack. It was hard to imagine him as a single spinner in England unless he became more serviceable, but such had been remarked of countless legspinners before him.",
        "A five-wicket haul on debut against Pakistan in Abu Dhabi after a return of 0 for plenty in the first innings augured well (setting up a short run chase which England narrowly failed to achieve) and he also brushed up well a year later in Dhaka at the start of England's 2016-17 tour of Bangladesh and India. His India series gradually took a turn for the worse, however, the promise of Rajkot and Visakhapatnam giving way to a more pessimistic air - and some hefty figures in the runs column - in Mumbai and Chennai. He had the ability to hoover up a tail at both England and county level; sometimes the problem was getting to it.",
        "In the limited-overs formats, Rashid was a vital component of England's attack and a first-class average with the bat in the mid-30s told of a player who would not have been consigned to the tail in many England XIs in the past.",
        "Rashid's also caught the eye early in his career for England Under-19s nd an eight-wicket haul during the second Test against India. But he suffered a stress fracture in his back in the close season which forced him to remodel his action. His profile rose further in 2007 when he struck his maiden Championship century against Worcestershire in August and at the end of the season the Cricket Writers' Club made him their Young Cricketer of the Year. In 2008 he enjoyed his most prolific season with 62 wickets in the County Championship and was a late addition to the squad for the Test series in India. That trip was purely for experience, however, as was the tour to West Indies which followed, but even so his career shone with potential.",
        "Rashid responded the following season with 545 runs at 68.12, including two hundreds, and picked up 31 wickets at 36.06 in the 2009 first-class season. His statistics in one-day and Twenty20 cricket were more modest, but the selectors held faith in his potential, and he made his England debut during the World Twenty in June of that year. He also played in the post-Ashes one-day series against Australia, but his most notable achievement came with the bat when he scored a quickfire 31 in a narrow defeat at The Oval.",
        "Rashid was included in the party to tour South Africa in 2009-10, but had a difficult time on the trip. He began amid high hopes that his combination of legspin and promising lower-order batting could cement a permanent role in the side, but his solitary over in the second Twenty20 went for 25, then he bowled three overs for 27 in the second ODI before being left out for a fit-again Graeme Swann. When he was released from the one-day party, James Tredwell, the Kent offspinner, remained on stand-by which suggested Rashid had fallen down the pecking order. ",
        "Andy Flower, England's coach, rightly suggested that he would benefit from a chance to deepen his game at county level, but progress was not immediate. Yorkshire, by now, were showing signs of disquiet over Rashid's bowling. England had demanded that he bowled much quicker and his confidence and method had deserted him when he returned from international duty. His county form faltered, although he did win a place in the England Lions squad to tour UAE and was called-up briefly for the end of the World Cup campaign.",
        "At home, Rashid enjoyed his most productive season for Yorkshire in 2010, scoring 732 first-class runs at 45.75 and taking 57 wickets at 31.29. He began the 2011 season with a bang, taking 6 for 77 and 5 for 37 to secure victory against Worcestershire at New Road, the best figures for a leg-spinner in Yorkshire history, but failed to maintain his form, finishing the season with 39 wickets at 43.38. From 10 Championship matches in 2012 he totalled only 16 wickets and 129 runs and his discontent was apparent. ",
        "Rashid was at a crossroads. But more than 800 Championship runs at 50-plus in 2013 suggested that in his mid-20s not just his batting was maturing, and his bowling became more thoughtful, and dangerous in turn with a good googly particularly evident. Yorkshire's challenge was to bring his career to fruition, to bring him not just success on the field but a general contentment. A career that had begun with so much optimism began to reawaken England's interest again - cagily at first with a Lions recall - as Yorkshire won the title in 2014. The appointment of Trevor Bayliss as coach coincided with his return to the England side for the first time in nearly six years, a string of limited-overs displays being joined by limited success in his first three Tests, against Pakistan on the slow, big turners of the UAE.",
        "He was a much-loved figure on Yorkshire grounds, contributing to back-to-back Championships in 2014 and 15, and dubbed \"The Hoover\" by the head coach Jason Gillespie. But his request to rest out a title decider against Middlesex at Lord's the following year - he later explained that his grandmother was unwell - exasperated his captain, Andrew Gale. Gale's appointment as Yorkshire's coach at the end of the season suggested that conversation was not entirely finished.",
        null
    ],
    "recent_matches": [
        {
            "Bat & Bowl": "-",
            "Ground": "Lord's",
            "Match Date": "9 Aug 2018",
            "Opposition": "v India",
            "Scorecard": "Test # 2315",
            "Team": "England"
        },
        {
            "Bat & Bowl": "13, 2/31, 16, 1/9",
            "Ground": "Birmingham",
            "Match Date": "1 Aug 2018",
            "Opposition": "v India",
            "Scorecard": "Test # 2314",
            "Team": "England"
        },
        {
            "Bat & Bowl": "1*, 2/19",
            "Ground": "Chesterfield",
            "Match Date": "28 Jul 2018",
            "Opposition": "v Derbyshire",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "0, 1/19",
            "Ground": "Leeds",
            "Match Date": "27 Jul 2018",
            "Opposition": "v Bears",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "0/44",
            "Ground": "Manchester",
            "Match Date": "20 Jul 2018",
            "Opposition": "v Lancashire",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "3/49",
            "Ground": "Leeds",
            "Match Date": "17 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "ODI # 4018",
            "Team": "England"
        },
        {
            "Bat & Bowl": "2/38",
            "Ground": "Lord's",
            "Match Date": "14 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "ODI # 4016",
            "Team": "England"
        },
        {
            "Bat & Bowl": "22, 1/62",
            "Ground": "Nottingham",
            "Match Date": "12 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "ODI # 4014",
            "Team": "England"
        },
        {
            "Bat & Bowl": "4*, 0/32",
            "Ground": "Bristol",
            "Match Date": "8 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "T20I # 690",
            "Team": "England"
        },
        {
            "Bat & Bowl": "1/29",
            "Ground": "Cardiff",
            "Match Date": "6 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "T20I # 688",
            "Team": "England"
        }
    ]
}