{
    "batting_averages": [
        {
            "": "Tests",
            "100": "32",
            "4s": "1409",
            "50": "56",
            "6s": "11",
            "Ave": "45.27",
            "BF": "25911",
            "Ct": "164",
            "HS": "294",
            "Inns": "285",
            "Mat": "158",
            "NO": "16",
            "Runs": "12179",
            "SR": "47.00",
            "St": "0"
        },
        {
            "": "ODIs",
            "100": "5",
            "4s": "363",
            "50": "19",
            "6s": "10",
            "Ave": "36.40",
            "BF": "4154",
            "Ct": "36",
            "HS": "137",
            "Inns": "92",
            "Mat": "92",
            "NO": "4",
            "Runs": "3204",
            "SR": "77.13",
            "St": "0"
        },
        {
            "": "T20Is",
            "100": "0",
            "4s": "10",
            "50": "0",
            "6s": "0",
            "Ave": "15.25",
            "BF": "54",
            "Ct": "1",
            "HS": "26",
            "Inns": "4",
            "Mat": "4",
            "NO": "0",
            "Runs": "61",
            "SR": "112.96",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "62",
            "4s": "",
            "50": "106",
            "6s": "",
            "Ave": "47.36",
            "BF": "43778",
            "Ct": "295",
            "HS": "294",
            "Inns": "507",
            "Mat": "286",
            "NO": "36",
            "Runs": "22311",
            "SR": "50.96",
            "St": "0"
        },
        {
            "": "List A",
            "100": "12",
            "4s": "",
            "50": "34",
            "6s": "",
            "Ave": "39.80",
            "BF": "7332",
            "Ct": "66",
            "HS": "137",
            "Inns": "158",
            "Mat": "160",
            "NO": "11",
            "Runs": "5851",
            "SR": "79.80",
            "St": "0"
        },
        {
            "": "T20s",
            "100": "1",
            "4s": "95",
            "50": "5",
            "6s": "15",
            "Ave": "31.85",
            "BF": "699",
            "Ct": "13",
            "HS": "100*",
            "Inns": "30",
            "Mat": "32",
            "NO": "2",
            "Runs": "892",
            "SR": "127.61",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "7.00",
            "BBI": "1/6",
            "BBM": "1/6",
            "Balls": "18",
            "Econ": "2.33",
            "Inns": "2",
            "Mat": "158",
            "Runs": "7",
            "SR": "18.0",
            "Wkts": "1"
        },
        {
            "": "ODIs",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "92",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "T20Is",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "4",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "30.14",
            "BBI": "3/13",
            "BBM": "",
            "Balls": "282",
            "Econ": "4.48",
            "Inns": "",
            "Mat": "286",
            "Runs": "211",
            "SR": "40.2",
            "Wkts": "7"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "18",
            "Econ": "3.33",
            "Inns": "",
            "Mat": "160",
            "Runs": "10",
            "SR": "-",
            "Wkts": "0"
        },
        {
            "": "T20s",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "32",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/1155715.html",
        "http://www.espncricinfo.com/ci/content/story/1154194.html",
        "http://www.espncricinfo.com/ci/content/story/1153877.html",
        "http://www.espncricinfo.com/england/content/story/1153512.html",
        "http://www.espncricinfo.com/ci/content/story/1153668.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=11728"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/279200/279265.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/279200/279265.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/279200/279265.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nDecember 25, 1984, Gloucester "
        ],
        "Bowling style": [
            "Right-arm slow"
        ],
        "Current age": [
            "33 years 236 days"
        ],
        "Education": [
            "Bedford School"
        ],
        "Full name": [
            "Alastair Nathan Cook"
        ],
        "Height": [
            "\n6 ft 2 in "
        ],
        "Major teams": [
            "England,",
            "Bedfordshire,",
            "England Lions,",
            "England Under-19s,",
            "Essex,",
            "Marylebone Cricket Club"
        ],
        "Nickname": [
            "Cooky, Chef"
        ],
        "Playing role": [
            "Opening batsman"
        ]
    },
    "profile_info": [
        "\nWhen Alastair Cook resigned as England's Test captain in the aftermath of a 4-0 trouncing by India in 2016, he ended a five-year tenure that had established him as a leader of great integrity and empathy without ever managing to achieve lasting accolades as one of the finest skippers of the age. Cook's leadership was, in many ways, like his record-breaking batting: unyielding, determined and deliberate, but lacking the spark of tactical genius to win him ultimate approval. But his rock-like commitment to the cause, and high personal standards, were cause for considerable respect and gratitude. That was enough for Andrew Strauss, his predecessor as England captain and by then England's managing director, to judge that he \"deserves to be looked upon as one of England's great captains.\" \n",
        "As Cook contemplated a return to life in the ranks - unlike many jaded captains, he judged that, at 32, his appetite for scoring runs remained high - he had assembled a deeply impressive batting record. His 30 Test hundreds were far and away a record for England; Kevin Pietersen, the brilliant and rejected maverick who had given his captaincy its bleakest hours, by then seven hundreds behind. Twelve of those hundreds came as England captain (10 after he had won the job on a permanent basis), although he made only five in his last 48 Tests in charge, more symptomatic perhaps of the burdens he had to withstand rather than worsening technical deficiencies. His 24 Test wins in 59 Tests made him the joint second-most successful captain for England in terms of Test wins, behind Michael Vaughan, who had 26. His 22 defeats were also a record.",
        "Cook, by the time of his resignation, was already established as England's highest Test runscorer, having surpassed his great mentor with England and Essex, Graham Gooch, on a chilly day at Headingley against New Zealand in 2015. Gooch regarded him as a once-in-a-generation cricketer, but it was typical of Cook that he ticked off such statistical milestones with little fanfare, resorting neither to extravagant strokeplay nor rousing speeches: he was no attention seeker. His team, Pietersen apart, gave him great loyalty. Those who perceived him from afar as representative of English cricket's aloof and elitist ways seriously misjudged a warm and approachable man.",
        "His finest captaincy moment may well have come near the start of his reign. The series victory in India in 2012 - England's first for 28 years - was testament not just to his outstanding batting, and the presence of two matchwinning spinners in Monty Panesar and Graeme Swann, but also his willingness, at that point, to reintegrate Pietersen to the team despite considerable opposition. Two modest Australian teams were defeated in favourable English conditions in 2013 and 2015 - victory did not always silence grumbles about England's safety-first, regimented approach - and, in his final year in the job, South Africa fell too.",
        "There were significant captaincy disappointments. He led the side that was whitewashed in the 2013-14 Ashes and which subsequently descended into a power struggle over Pietersen. The coach, Andy Flower, resigned, Pietersen was banished, but Cook (who had been party to the decision over Pietersen) stayed on, only to be beaten by Sri Lanka in England the following summer when he almost resigned, such was the ferocity of the criticism on social media. Heartfelt applause at the Ageas Bowl for his painstaking 95 against India to end a desperately lean run was something he treasured.",
        "Emboldened by Strauss' return as England's MD, he sought a more caring and relaxed England dressing room, but results still lurched from one extreme to another. England were held to a draw in the Caribbean by a West Indies side labelled \"mediocre\" by the ECB chairman and there were fearful collapses, too, against Pakistan' spinners in the UAE. If Plan A (bat long and drain the opposition) did not work, he could look short of a Plan B and his strangely mangled speech in media conferences - he was no public speaker - did not enhance his look. ",
        "His stubbornness was sometimes to his detriment. The apparently unquenchable self-belief, that helped turn a relatively limited player into England's record Test run-scorer, also convinced him that he was the man to revive England's ODI fortunes. As a result he lingered too long as captain of an outmoded side and was stung by the consequent criticism. While he led the team within an ace of that elusive global ODI title (the Champions Trophy of 2013), he was omitted from the 2015 World Cup squad, ending his limited-overs career around his 30th birthday. The change came too late to spare England a humiliating failure, but their improvement in the format thereafter was telling. ",
        "Those in the know were saying that the tall, dark and handsome Alastair Cook was destined for great things very early on. A correct and stylish left-hander strong on the pull, Cook was thrown in at the deep end by Essex the year after he left Bedford School with a fistful of batting records.  He captained England in the Under-19 World Cup early in 2004, scored his maiden first-class hundred later that year, and added a double-century for Essex against the Australian tourists in 2005. ",
        "The following spring he was called up by the full England side when injuries struck in India. He had been in the Caribbean with the A team when the SOS came but, unfazed, stroked 60 and a magnificent century to complete a memorable debut in Nagpur. His ability to play long, attritional innings without showing signs of fatigue - it became a cliché that he did not sweat - was evident from the outset.",
        "He remained consistent, seemingly at ease with the pressure, and was a shoo-in for the 2006-07 Ashes. Before that series even started Glenn McGrath paid him the honour of publicly announcing that he would be targeting Cook: it made for a tough baptism, but although he was hardly prolific (276 runs) he did manage a century in Perth. Bowlers began to exploit that penchant for hanging on the front foot, but Cook still made his share of runs. By the time of his 25th birthday on Christmas Day 2009 he had scored far more runs (3536 to David Gower's 2548) and centuries (nine to Ian Botham's six) than any other Englishman of a comparable age. He hit three more Test hundreds in 2009 - but none of them were in the Ashes series, in which 95 at Lord's was his only score above 32 as the Aussies probed that front-pad problem.",
        "The Ashes tour of 2010-11represented his outstanding feat. He came good on a host of promises, scoring an incredible 766 runs in seven innings to anchor England's first series win in Australia for 24 years. In so doing, he went past 5,000 Test runs, having turned 26 on Christmas Day - the second youngest batsman to reach the landmark after Sachin Tendulkar. Two years later and further records had been broken as he became England's leading Test century-maker - hitting No. 23 against India in Kolkata, his third in three matches - and the youngest player to pass 7000 runs.",
        "Strauss had taken time off at the start of 2010, enabling Cook to captain for the first time in Bangladesh, scoring centuries as both Tests were won. His appointment had long seemed inevitable and the fact he had seemingly not particularly worked for it, nor craved it, but it had fallen into his lap, was a cause for some disquiet who were suspicious of English cricket's preference for public school manners. Soon he was named as Strauss' full-time successor in the one-day captaincy even though his methodical batting approach was out of kilter with the evolution of the 50-over game. ",
        "Little more than a year later, after Strauss' abrupt retirement, the Test role followed, with a demanding tour of India his first assignment. It was a challenge that could have broken lesser men with the Pietersen saga in full cry, but it turned it into a triumph as England won the Test series 2-1 and Pietersen returned to the side to play a key role. Pietersen did not last long, but Cook did and England were all the better for his longevity.",
        null
    ],
    "recent_matches": [
        {
            "Bat & Bowl": "21",
            "Ground": "Lord's",
            "Match Date": "9 Aug 2018",
            "Opposition": "v India",
            "Scorecard": "Test # 2315",
            "Team": "England"
        },
        {
            "Bat & Bowl": "13, 0",
            "Ground": "Birmingham",
            "Match Date": "1 Aug 2018",
            "Opposition": "v India",
            "Scorecard": "Test # 2314",
            "Team": "England"
        },
        {
            "Bat & Bowl": "180, 5",
            "Ground": "Worcester",
            "Match Date": "16 Jul 2018",
            "Opposition": "v India A",
            "Scorecard": "FC",
            "Team": "Eng Lions"
        },
        {
            "Bat & Bowl": "96, 3",
            "Ground": "Chelmsford",
            "Match Date": "25 Jun 2018",
            "Opposition": "v Somerset",
            "Scorecard": "FC",
            "Team": "Essex"
        },
        {
            "Bat & Bowl": "33, 0",
            "Ground": "Chelmsford",
            "Match Date": "20 Jun 2018",
            "Opposition": "v Notts",
            "Scorecard": "FC",
            "Team": "Essex"
        },
        {
            "Bat & Bowl": "11",
            "Ground": "Chelmsford",
            "Match Date": "14 Jun 2018",
            "Opposition": "v Yorkshire",
            "Scorecard": "LA",
            "Team": "Essex"
        },
        {
            "Bat & Bowl": "58, 9",
            "Ground": "Manchester",
            "Match Date": "9 Jun 2018",
            "Opposition": "v Lancashire",
            "Scorecard": "FC",
            "Team": "Essex"
        },
        {
            "Bat & Bowl": "46",
            "Ground": "Leeds",
            "Match Date": "1 Jun 2018",
            "Opposition": "v Pakistan",
            "Scorecard": "Test # 2305",
            "Team": "England"
        },
        {
            "Bat & Bowl": "70, 1",
            "Ground": "Lord's",
            "Match Date": "24 May 2018",
            "Opposition": "v Pakistan",
            "Scorecard": "Test # 2304",
            "Team": "England"
        },
        {
            "Bat & Bowl": "37, 66",
            "Ground": "Worcester",
            "Match Date": "11 May 2018",
            "Opposition": "v Worcs",
            "Scorecard": "FC",
            "Team": "Essex"
        }
    ]
}