{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "2",
            "6s": "1",
            "Ave": "38.00",
            "Ct": "4",
            "HS": "85*",
            "Inns": "9",
            "Mat": "5",
            "NO": "3",
            "Runs": "228",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "8",
            "50": "44",
            "6s": "",
            "Ave": "19.48",
            "Ct": "452",
            "HS": "164",
            "Inns": "602",
            "Mat": "375",
            "NO": "53",
            "Runs": "10696",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "3",
            "5w": "2",
            "Ave": "15.00",
            "BBI": "8/43",
            "BBM": "9/110",
            "Balls": "948",
            "Econ": "2.46",
            "Inns": "8",
            "Mat": "5",
            "Runs": "390",
            "SR": "36.4",
            "Wkts": "26"
        },
        {
            "": "First-class",
            "10": "41",
            "4w": "",
            "5w": "131",
            "Ave": "21.09",
            "BBI": "10/42",
            "BBM": "",
            "Balls": "71549",
            "Econ": "2.96",
            "Inns": "",
            "Mat": "375",
            "Runs": "35318",
            "SR": "42.7",
            "Wkts": "1674"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/1134285.html",
        "http://www.espncricinfo.com/ci/content/story/996451.html",
        "http://www.espncricinfo.com/magazine/content/story/973337.html",
        "http://www.espncricinfo.com/magazine/content/story/710639.html",
        "http://www.espncricinfo.com/somerset/content/story/489698.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=21593"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/272400/272471.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/272400/272471.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/272400/272471.icon.jpg"
    ],
    "personal_info": {
        "Also known as": [
            "Alberto Trott"
        ],
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nFebruary 6, 1873, Abbotsford, Melbourne, Victoria, Australia "
        ],
        "Bowling style": [
            "Right-arm slow"
        ],
        "Died": [
            "July 30, 1914, Willesden Green, Middlesex (aged 41 years 174 days) "
        ],
        "Full name": [
            "Albert Edwin Trott"
        ],
        "Major teams": [
            "Australia,",
            "England,",
            "Hawke's Bay,",
            "London County,",
            "Middlesex,",
            "Victoria"
        ],
        "Nickname": [
            "Albatrott"
        ],
        "Other": [
            "Umpire"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        null,
        "Following this good beginning, Trott went to the top of the tree, 1899 and 1900 being his greatest years. It would have been hard indeed in those two seasons to find a better all-round man. In first-class matches in 1899 he scored 1,175 runs and took 239 wickets, and in 1900 his figures came out at 1,337 runs and 211 wickets. Thanks to his bowling, his hard hitting, and brilliant fielding, and also his strong personality, he became for the time more popular at Lord's than any other professional. In those days his bowling was extraordinarily good and quite individual. Appreciably lower in delivery than most Australian bowlers, he had plenty of spin, but he depended less on break than upon an endless variety of pace. He rarely bowled two balls alike, and he could whip in his yorker at a tremendous speed. A long and very bright career seemed before him, but, unhappily, he soon began to fall off. Even in 1901, though he took 176 wickets, he was not quite the man he had been, and from that time he steadily declined. Becoming heavy and muscle-bound, he could no longer bowl the extra fast ball that had been so deadly, and batsmen ceased to fear him. In 1902-3-4 he still bowled well, but after 1904 he was only a shadow of his former self. In his benefit match against Somerset at Lord's on Whit-Monday, 1907, he came out with a last flash of greatness, taking four wickets in four balls, and finishing the game by doing the  hat trick a second time in the same innings. This was a feat without precedent in first-class cricket. Trott played for Middlesex for the last time in 1910. His active career as a cricketer over, he became one of the county umpires, giving up the work early last season. His health was then so bad that he could go on no longer. One fact in Trott's career must not be forgotten. He was the only batsman who ever hit a ball over the present pavilion at Lord's. The great hit was made off Noble's bowling in a match between the M. C. C. and the Australians in 1899. Near the wicket, Trott was one of the best fieldsmen of his day, few catches that could be reached escaping his capacious hands. Appended are Trott's records in first-class cricket in England from 1898 to 1907.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}