{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "9.00",
            "Ct": "1",
            "HS": "9",
            "Inns": "1",
            "Mat": "1",
            "NO": "0",
            "Runs": "9",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "15",
            "50": "71",
            "6s": "",
            "Ave": "21.65",
            "Ct": "404",
            "HS": "194",
            "Inns": "833",
            "Mat": "488",
            "NO": "78",
            "Runs": "16346",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "1",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "9",
            "4w": "",
            "5w": "52",
            "Ave": "19.93",
            "BBI": "8/15",
            "BBM": "",
            "Balls": "61070",
            "Econ": "2.27",
            "Inns": "",
            "Mat": "488",
            "Runs": "23120",
            "SR": "52.6",
            "Wkts": "1160"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/1096855.html",
        "http://www.espncricinfo.com/magazine/content/story/265946.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154868.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/122004/056910.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJuly 22, 1863, Ealing, Middlesex "
        ],
        "Died": [
            "May 16, 1952, Beckenham, Kent (aged 88 years 299 days) "
        ],
        "Full name": [
            "Alec Hearne"
        ],
        "Major teams": [
            "England,",
            "Kent"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nHEARNE, ALEC, who died at Beckenham on May 16, aged 88, was one of the best cricketers who never played for England. A younger brother of George and Frank, both Kent cricketers, he was born at Ealing on July 22, 1863. He derived his qualification for Kent from the fact that his father, old George Hearne, held the post of groundsman at Catford Bridge, where, in 1875, Kent decided all their home county matches. When first tried for the county in 1884, Alec Hearne was no batsman, but a clever leg-break bowler slightly above normal pace, with a good command of length, deceptive flight and plenty of spin. More than once in his early years he proved a thorn in the side of Yorkshire, enjoying a particular triumph at Bramall Lane in 1885 when taking 13 wickets, including five for 13 in one innings, at a cost of 48 runs. The strain upon his elbow entailed in imparting a leg-break troubled him so much that after a few seasons he took to bowling off-breaks, which he did with considerable success. Still, his great ambition was to become a good batsman, and by 1889 he established himself as the skilful run-getter that he remained for nearly twenty years. \n",
        "Neat in method, he was strong in back-play and cut with precision, getting well over a rising ball or, if it got up particularly high, upper-cutting it over the slips. On slow pitches he was quick and accurate in hooking. Altogether Hearne played in first-class cricket for twenty-three seasons, scoring 16,380 runs, average 21, and taking 1,167 wickets for 19 runs each. Most of his work was done for Kent, for whom he scored eleven of his fifteen centuries, but he played four times for Players against Gentlemen and in the winter of 1891-92 formed one of the team which, under W. W. Read, went to South Africa. Among his big scores were 162 not out against Nottinghamshire at Trent Bridge in 1899 when he and J. R. Mason (181 not out) put on 351 and established a Kent third-wicket record which stood for thirty-five years, and 155 against Gloucestershire at Gravesend in 1895--the match in which W. G. Grace, hitting 257 and 73 not out, was on the field while every ball was bowled. Other notable innings were 154 not out against Worcestershire at Worcester in 1906 and 152 not out from the Essex bowling at Leyton in 1901.",
        "His most remarkable bowling analyses for Kent were: five wickets for 15 runs v. Hampshire at Tonbridge, four for 0 v. Somerset at Taunton, five for 13 v. Warwickshire at Maidstone, eight for 36 v. Middlesex at Lord's, four for 10 v. Gloucestershire at Tonbridge in 1902 and eight for 15 against the same county on the same ground the following year. Twice he performed the hat-trick, for M.C.C. v. Yorkshire at Lord's in 1888 and for Kent v. Gloucestershire at Clifton in 1900.",
        "That Hearne should never have taken part in a Test match was the more remarkable because he accomplished several fine feats in games with various Australian teams. In 1884, in which summer Kent were the only county side to beat Murdoch's third team, he took seven wickets for 66, and two years later, when Kent triumphed by ten wickets at Canterbury, he dismissed four batsmen for 37 runs. In 1890 he helped to a further Kent victory with scores of 24 and 35, and in 1893, when the Australians lost on the St. Lawrence ground, he made 20 and 39 and took eight wickets. In 1893 he averaged 38 against the Australians, with a highest score of 120 for the South at The Oval, and obtained 17 wickets for 12 runs apiece. He played another three-figure innings against the Australians in 1899, getting 168 for W. G. Grace's XI at the Crystal Palace.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}