{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "2.00",
            "Ct": "2",
            "HS": "4",
            "Inns": "2",
            "Mat": "1",
            "NO": "0",
            "Runs": "4",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "14",
            "50": "60",
            "6s": "",
            "Ave": "24.81",
            "Ct": "229",
            "HS": "243*",
            "Inns": "641",
            "Mat": "370",
            "NO": "58",
            "Runs": "14465",
            "St": "10"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "1",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "2",
            "Ave": "25.21",
            "BBI": "5/23",
            "BBM": "",
            "Balls": "7699",
            "Econ": "2.14",
            "Inns": "",
            "Mat": "370",
            "Runs": "2748",
            "SR": "70.6",
            "Wkts": "109"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155681.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/032005/058868.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/032005/058868.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/032005/058868.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJanuary 16, 1855, Bethnal Green, London "
        ],
        "Bowling style": [
            "Right-arm fast"
        ],
        "Died": [
            "February 19, 1941, Fulvens Farm, Hoe, Abinger Hammer, Surrey (aged 86 years 34 days) "
        ],
        "Education": [
            "Harrow School; Oxford University"
        ],
        "Fielding position": [
            "Wicketkeeper"
        ],
        "Full name": [
            "Alexander Josiah Webbe"
        ],
        "Major teams": [
            "England,",
            "Middlesex,",
            "Oxford University"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        " Mr. Alexander Josiah Webbe, of high renown in Harrow, Oxford University and Middlesex cricket, died on February 19, at his home, Fulvens Farm, Abinger Hammer, Surrey, aged 86. Born on January 16, 1855, he had not been seen on a cricket field in active pursuit of the game in an important fixture for over forty years, but during all that time he still exercised much influence at Lord's as President of Middlesex and member of the Marylebone Club Committee, to which he was first elected in 1886.",
        "Like the Walkers before him, he first made his name in Harrow cricket, and was a member of the Eleven from 1872 to 1874, finishing as captain of the School Eleven when, in the big match at Lord's notwithstanding his personal contributions of 77 and 80, Eton were victorious by five wickets. Going up to Trinity College, Oxford, Webbe got his Blue as a freshman, and on his first appearance against Cambridge he made 55, the highest score in the match, and 21, so helping materially in a narrow victory by six runs. As evidence of his popularity and excellence as a cricketer, he was twice captain of Oxford, and, when first the leader, his side won handsomely by ten wickets, he and his brother, H. R. Webbe, hitting off 47 runs needed for victory. It is of special interest to recall that he and W. S. Patterson, the Cambridge captain, both played that year for Gentlemen against Players at Lord's, in what was described as the glorious match, which the Gentlemen won by one wicket when everybody present anticipated a triumph for the Players. W. S. Patterson and A. J. Webbe were the last survivors of the twenty-two engaged in that game and, after Patterson passed away in October 1939, A. J. Webbe remained as the oldest living University captain.",
        "Another very interesting episode during his early period at Oxford was that in 1875 he played for the Gentlemen at Lord's and, going in first, helped W. G. Grace make 203 in the opening stand, his share being 65; the champion scored 152. Writing in his book, W. G. Grace said of that occasion, In a sticky-wicket season, batting suffered, but one young player, Mr. A. J. Webbe, came to the front with a rush; when we put on 203 runs his defence and patience were perfect. Those attributes expressed by the greatest of batsmen fairly described some of Webbe's characteristics at the wicket.",
        " Webbe also started playing for Middlesex during his first year at Oxford when twenty years of age, and his success in the strongest company still serves as an example of how the best schoolboy cricketers in those days quickly reached the front rank. In every particular a great batsman, he possessed skill in defence, with untiring patience and remarkable power in stroke play. True to type, like many Harrow batsmen of the period, he stood at the wicket with legs wide apart, a position well suited to playing back in defence or cutting--something like the posture adopted and made memorable in later years by Gilbert Jessop, the Croucher. Webbe cut splendidly, both square and late, used the  Harrow drive, now known as the hit through the covers, and placed the ball to the on or hit to leg with perfectly timed strokes. In fact, an admirable exponent of the batsman's art. Of middle height and good build, his early stamina had proof in an innings of 299 not out for Trinity College against Exeter; also in 1875 he made his first hundred in important cricket, 120 for the University against Gentlemen of England.",
        null,
        "Lord Harris accepting an invitation from the Melbourne Club for a team of Amateurs to visit Australia in the autumn of 1878, A. J. Webbe was one of the chosen. The impossibility of finding amateur bowlers able to go necessitated the inclusion of Tom Emmett and George Ulyett of Yorkshire. By no means representative of England, the side lost the one match against Australia. The death of A. J. Webbe leaves as the only survivor of that touring team F. A. Mackinnon, head of the clan Mackinnon, who has maintained his interest in Kent, his cricketing county, by going to the Canterbury Festival regularly up to 1939.",
        "Free to give practically all his time to cricket, A. J. Webbe kept up his close connection with the game, as known to the public, for nearly seventy years--from his presence in the Harrow eleven to his resignation of the Middlesex Club presidency of 1937; and even to the last, as a trustee of M.C.C., he held an honoured place in cricket.",
        "Besides his first-class activities, A. J. Webbe, on leaving school, went on the annual tours of Harrow Wanderers, under the lead of I. D. Walker, and he took teams to Oxford and Cambridge each season. After captaining Oxford Harlequins for several years, he was elected president of the club. For such sides he used to bowl medium pace, but really his skill was confined to batsmanship and fielding. Good everywhere, he excelled in the deep, and some magnificent catches stand to his credit.",
        "At other games A. J. Webbe ranked high. He represented Oxford twice at racquets in the doubles, and in 1888 he won the tennis silver racquet at Lord's. Added to his fondness for games and skill in their practice, he served on hospital committees and in many ways helped to relieve the troubles and sufferings of people less fortunate than himself.",
        null,
        "I played my first match for Middlesex under his captaincy at Taunton in August 1894 and, among the many happy things which cricket has brought me, I am glad to remember that I was in the eleven when he played his last match for Middlesex at Worcester in July 1909--his only appearance for the County that season. He saves us from impending defeat by playing a splendid innings of 59 not out, half the total made on a very difficult wicket. After that, when in turn he was honorary secretary and president of Middlesex, it was easy to know where to go for encouragement and sympathy; this attitude towards successive captains he maintained to the end of his life. Mr. F. T. Mann, Mr. Nigel Haig, Mr. R. W. V. Robins, Mr. H. J. Enthoven and Mr. I. A. R. Peebles will fully endorse this.",
        "Just as the Walkers made Middlesex cricket, Webbie continued in their tradition. No County captain ever had a more helpful and understanding supporter. We may count ourselves a very lucky band. Webbe was the soul of Middlesex cricket. He was a fine leader, kindness itself, with a rare charm of manner, and no one ever had a more loyal and truer friend. To lame dogs and in the troubles which from time to time befall cricketers he was a veritable champion. He lived to a great age and his passing was to be expected, but none the less one feels that a landmark has been removed and that something very tangible and visible has gone out of one's life. He fully earned almost every honour that cricket can give--for he was a great cricketer--and Lord's will not be the same without him to hundreds of others besides myself.",
        "Mr. A. J. H. Cochrane, an Oxford Blue in 1885, 1886 and 1888, who played for Derbyshire, and remains, at the age of 77, in close touch with first-class cricket, writes:--",
        "I am glad to pay a brief tribute to the memory of A. J. Webbe, as one among the many devoted friends who lament him, not only as a famous cricketer, but as a man whose long life was full of kindly deeds and kindly thoughts. His death breaks a line with the heroic past, for as an admiring small boy I watched him play in the early 80's, when I. D. Walker's Middlesex champions came North in August, and their matches at Nottingham or Sheffield were the great events of the summer holidays. I remember an innings of his against Yorkshire in 1882--the light was bad and the wicket, ruined by rain, was exactly suited to the left-hand slow of Peate who, that season, was the best bowler in England.",
        " Middlesex, with a splendid batting side, had to get something like 140 to win, and lost by 20 runs. Webbie went in first and, while his gifted colleagues, failed one after the other, carried out his bat for 62. His watchfulness and correct timing were remarkable, and he never made a mistake or looked like getting out.",
        "At Oxford a few years later I came to know him, for he brought down teams against us every summer. He always seems to me to have been the central figure of any match or gathering at which we met, as much for his personal characteristics as for his cricket reputation. In the field his keenness knew no bounds, making him impetuous and somewhat impatient in his comments, which, while a little disturbing to strangers, were a source of amusement to his acquaintances. At that date, half a century ago, first-class amateurs had more time than they have to-day for minor engagements, and Harlequin or Harrow Wanderers tours formed what I am sure Webbie found an enjoyable part of his summer campaign. I once played for the Harlequins with him at Woolwich, where our hospitable hosts regarded him as a well-known and welcome guest. On these festive occasions he had more opportunities of bowling than in county games, and he was very fond of bowling. He was not at all a bad change either and often got a wanted wicket.",
        "During the last forty years, brought together by other associations as well as cricket, I got to know Webbie well. We met by appointment whenever I went to Lord's during the summer, and I always envied him his memory for faces, among the crowds of all ranks and ages, who saluted him with affection. He and his wife used to stay with us in the country, and we delighted in their visits. Our long talks wandered over many subjects, past and present; we spoke of old comrades and old opponents; and his judgements, mellowed no doubt by increasing years, were always charged with that charity which is the greatest of virtues.",
        "Mr. J. T. Hearne, who played for Middlesex from 1888 for over twenty years and, in 1920, had the rare distinction for a professional of being elected on the Committee of his county club, writes of his old captain:--",
        "It would be impossible for me to express in words the high esteem in which Mr. A. J. Webbe was held by me and how greatly I feel his loss. The whole of my cricket life has been very happy and I have played under many fine captains, but to me he was the best of them all, and I look back on the period of years when playing under his leadership as the most zestfully happy time of all. Ever ready with encouragement, at the same time giving such advice as to inspire one with absolute confidence in his judgement of the game, he could but succeed in getting the best out of one. Added to all this was his wonderfully kind nature, and it was my good fortune to realise quite early that I had in him a true friend to whom I could appeal both on and off the field; a friendship most highly valued which, by many an act of kindness, remained unbroken up to the time of his lamented death. I can in no way overstate how truly I revere the memory of so great a friend.",
        "Two incidents in matches I have never forgotten. Mr. Webbe and I have often spoken of them through the years. Quite early in the 90's when playing Lancashire at Lord's, little Johnny Briggs was making a lengthy stand against us when, after several changes. Mr. Webbe put himself on to bowl--a rare occurrence--I believe at the Nursery end. I was fielding orthodox  third man, but was brought up to what is now known as the gully, and had the satisfaction of catching Briggs off him in his first over. I vividly remember his delight at having broken up a dangerous partnership.",
        "The other happened when we were playing Yorkshire at Bradford. Rain had driven us to the pavilion, and the usual precaution of stringing off the pitch had been taken, with two policemen placed on guard. After some delay and all of us sitting in front of the dressing-room, Mr. Webbe was the first to notice that the two guards had absentmindedly stepped over the rope and were patrolling side by side up and down the pitch, and, as captain, he shouted them from the pavilion to get off!",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}