{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "0",
            "50": "0",
            "6s": "0",
            "Ave": "-",
            "Ct": "1",
            "HS": "2*",
            "Inns": "1",
            "Mat": "4",
            "NO": "1",
            "Runs": "2",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "4s": "",
            "50": "0",
            "6s": "",
            "Ave": "9.36",
            "Ct": "171",
            "HS": "41*",
            "Inns": "414",
            "Mat": "362",
            "NO": "167",
            "Runs": "2312",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "44.87",
            "BBI": "3/85",
            "BBM": "4/127",
            "Balls": "816",
            "Econ": "2.63",
            "Inns": "7",
            "Mat": "4",
            "Runs": "359",
            "SR": "102.0",
            "Wkts": "8"
        },
        {
            "": "First-class",
            "10": "17",
            "4w": "",
            "5w": "95",
            "Ave": "23.63",
            "BBI": "8/34",
            "BBM": "",
            "Balls": "74503",
            "Econ": "2.95",
            "Inns": "",
            "Mat": "362",
            "Runs": "36753",
            "SR": "47.9",
            "Wkts": "1555"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/1015323/the-roles-they-played",
        "http://www.espncricinfo.com/blogs/content/story/725199.html",
        "http://www.espncricinfo.com/magazine/content/story/576442.html",
        "http://www.espncricinfo.com/wisdencricketer/content/story/231414.html",
        "http://www.espncricinfo.com/wisdencricketer/content/story/230226.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=13416"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/102004/055254.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/102004/055254.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/102004/055254.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nFebruary 29, 1908, Woodcote, Epsom, Surrey "
        ],
        "Bowling style": [
            "Right-arm fast"
        ],
        "Died": [
            "October 7, 2001, South London (aged 93 years 220 days) "
        ],
        "Full name": [
            "Alfred Richard Gover"
        ],
        "Major teams": [
            "England,",
            "Surrey"
        ],
        "Other": [
            "Coach"
        ]
    },
    "profile_info": [
        "\nAlf Gover had two long careers in cricket. The first was as a whole-hearted fast bowler for Surrey and, briefly, England; he then turned to coaching, and for around 40 years ran the best-known cricket school in England, at East Hill in Wandsworth, near Clapham Junction in south London. \n",
        "Gover the bowler sent down brisk outswingers, using an eccentric bowling action - right arm pumping, right foot skipping past left in delivery - that he wouldn't have recommended to his latter-day pupils. But it was mightily effective: he took 200 wickets in both 1936 and 1937, playing half the time on the shirt-front Oval pitches on which Len Hutton was to compile 364 against Australia in 1938.",
        "At a time when England weren't overstocked with fast bowlers it was surprising that Gover won only four Test caps, three of them in his golden years of 1936 and 1937. The final call came after the war, when the 38-year-old Gover opened the bowling against India at his beloved Oval, alongside the new Surrey and England bowling star Alec Bedser.",
        "In all Gover took 1555 wickets at 23.63. His best return was 8 for 34, which included four wickets in four balls, for Surrey against Worcestershire at New Road in 1935. His batting was typical of an era when batsmen batted and bowlers bowled: only 2312 runs at 9.36. He once declined the umpire's offer of a guard on the basis that he'd played at the same ground the year before.",
        "Although his playing career was a fine one, Gover will probably be better remembered as a coach. His indoor school was the forerunner of today's swish centres of excellence. You entered by a regular street door and shuffled through into a sweaty changing-room before emerging, blinking, into the gas-lit and low-ceilinged coaching hall. Here Alf himself would often hold court, bowling at timorous teenagers in a unique round-arm style from halfway down the net. This was an imposing sight, as he was 6ft 2ins tall and as trim as in his playing days, and was rarely seen in public without his England sweater and a neckerchief.",
        "Several future stars went to Gover's for advice or remedial action. Geoff Griffin, the crooked-armed South African fast bowler, was sent there in 1960 to try to modify his action. It worked for a while, but Griffin - after the unique double of a hat-trick and being called for throwing in the same Lord's Test - eventually faded away. Later Viv Richards and Sunil Gavaskar both had spells at the school before graduating to serious cricket in England.",
        "Gover remained a familiar face at The Oval. He was a tireless fundraiser, selling raffle tickets for a tanner (six old pence, or 2.5p) a time around the pavilion, and circling the boundary menacingly at the unlikely grounds at which Surrey used to play the odd Sunday game - Sutton, Cheam, Sunbury, and the British Aerospace ground at Byfleet (since cut in half by the M25). I must have bought several pounds-worth of tickets, and don't remember ever winning anything. But you felt warm inside when the announcer revealed that Alf had raised £19/17/6d for youth cricket in Surrey.",
        "All that fundraising led to high office: Gover was Surrey's genial president in 1980. He held court with some well-worn anecdotes - and, if the Bedsers were in the room, alecdotes - delivered out of the side of his mouth with a sly smile. He gave up the school at the end of 1989. It creaked on for a while but, now outshone by ritzier establishments with videos and better showers, it eventually closed for good and the developers moved in.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}