{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "7",
            "50": "0",
            "6s": "0",
            "Ave": "10.09",
            "Ct": "4",
            "HS": "40",
            "Inns": "12",
            "Mat": "7",
            "NO": "1",
            "Runs": "111",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "4s": "",
            "50": "12",
            "6s": "",
            "Ave": "12.44",
            "Ct": "368",
            "HS": "88",
            "Inns": "630",
            "Mat": "404",
            "NO": "101",
            "Runs": "6585",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "1",
            "Ave": "23.75",
            "BBI": "5/38",
            "BBM": "8/89",
            "Balls": "1096",
            "Econ": "1.56",
            "Inns": "10",
            "Mat": "7",
            "Runs": "285",
            "SR": "91.3",
            "Wkts": "12"
        },
        {
            "": "First-class",
            "10": "44",
            "4w": "",
            "5w": "177",
            "Ave": "12.12",
            "BBI": "10/73",
            "BBM": "",
            "Balls": "101967",
            "Econ": "1.44",
            "Inns": "",
            "Mat": "404",
            "Runs": "24577",
            "SR": "50.3",
            "Wkts": "2027"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/1083160.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/648695.html",
        "http://www.espncricinfo.com/magazine/content/story/210469.html",
        "http://www.espncricinfo.com/magazine/content/story/75601.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/152871.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=20137"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/042004/051990.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042004/051990.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042004/051990.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nAugust 29, 1842, Burton Joyce, Nottinghamshire "
        ],
        "Bowling style": [
            "Right-arm slow"
        ],
        "Died": [
            "January 16, 1907, Gedling, Nottinghamshire (aged 64 years 140 days) "
        ],
        "Full name": [
            "Alfred Shaw"
        ],
        "Major teams": [
            "England,",
            "Nottinghamshire,",
            "Sussex"
        ],
        "Other": [
            "Umpire"
        ]
    },
    "profile_info": [
        null,
        "Of all his feats, perhaps the most remarkable was accomplished in a match at Lord's in 1875, between Notts and the M. C. C. In the M. C. C.'s second innings he sent down forty-one overs and two balls for seven runs and seven wickets, bowling out, among other batsmen, W. G. Grace, A. W. Ridley, C. F. Buller, and Lord Harris. On May 27th, 1878, he played for the M. C. C. at Lord's in the sensational match against the first Australian Eleven, and it was no fault of his that the Club suffered a nine wickets' defeat, he and the late Fred Morley getting the Australians out for a total of 41. A little over two years later Shaw appeared for Englandagainst Australia at the Oval in the first Test match ever played in this country. After 1880 his bowling began to show some falling-off, and in the great match at the Oval in 1882 England's slow bowler was Peate. In the meantime the only regrettable incident of Shaw's career had occurred, he being one of the prime movers in the strike of the Notts professionals in 1881. The quarrel was made up before the end of the season, but it left some feeling of soreness behind. Shaw continued to play for Notts for some years longer, dropping out of the eleven in 1887. Though he was at that time a man of 45, it was probably a mistaken policy on the part of the Notts committee to dispense with his services. He had great influence over the other Notts professionals, and for that reason, together with his long experience and fine knowledge of the game, was most valuable as captain. When a few years later the fortunes of Nottshad declined, a member of the team was heard to say, very sorrowfully,  We never went down the hill while we had Shaw with us. That the veteran had a good deal of cricket left in him was proved when he afterwards played, under the residential qualification, for Sussex. Time had robbed him of much of his spin, but his bowling was still wonderfully steady. However, he soon found the strain of county cricket too much for him at his age, and without any formal farewell, he retired from the active pursuit of the game, and in due course took up umpiring.",
        "As a bowler Alfred Shaw placed his chief reliance on accuracy of pitch. In this respect he has never been surpassed. When in his prime he could keep up his end for hours, without ever becoming short or getting in any way loose. In being able to get through so much work he was greatly helped by his delivery, which, from the beginning of his career to its close, was beautifully easy and natural. When the ground helped him, he broke back a good deal, but he never set much store on a big break, always arguing that the most dangerous ball was the one that did just enough to beat the bat. Unlike most of the present-day bowlers, he regarded the off theory as more or less a waste of time, preferring to keep on the wicket and trust to variations of pace and elevation to deceive the batsmen. It may be interesting here to quote W. G. Grace's opinion of him. In his book on cricket Mr. Grace says: The great power of his bowling lay in its good length and unvaried precision. He could break both ways, but got more work on the ball from the off; and he was one of the few bowlers who could very quickly cause a batsman to make a mistake if he was too eager to hit. An impatient batsman might make two spanking hits in succession off him, but he would not make a third. Shaw was sure to take his measure and get him in a difficulty. On a good wicket, when batting against him, I did not find it difficult to play the ball; but I had to watch him carefully, and wait patiently before I could score.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}