{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "0",
            "50": "0",
            "6s": "0",
            "Ave": "2.50",
            "Ct": "1",
            "HS": "3",
            "Inns": "2",
            "Mat": "1",
            "NO": "0",
            "Runs": "5",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "52",
            "4s": "",
            "50": "109",
            "6s": "",
            "Ave": "38.31",
            "Ct": "206",
            "HS": "306*",
            "Inns": "669",
            "Mat": "429",
            "NO": "59",
            "Runs": "23373",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "1",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "43.00",
            "BBI": "3/12",
            "BBM": "",
            "Balls": "1981",
            "Econ": "2.73",
            "Inns": "",
            "Mat": "429",
            "Runs": "903",
            "SR": "94.3",
            "Wkts": "21"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/235972.html",
        "http://www.espncricinfo.com/wisdencricketer/content/story/231414.html",
        "http://www.espncricinfo.com/magazine/content/story/214145.html",
        "http://www.espncricinfo.com/magazine/content/story/135627.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154756.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/215300/215349.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/215300/215349.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/215300/215349.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nFebruary 16, 1886, Brixton, London "
        ],
        "Died": [
            "July 23, 1942, Lord's Cricket Ground, St John's Wood, London (aged 56 years 157 days) "
        ],
        "Full name": [
            "Andrew Ducat"
        ],
        "Major teams": [
            "England,",
            "Surrey"
        ]
    },
    "profile_info": [
        null,
        "That Ducat should collapse and die, bat in hand, was the last thing anyone would have expected of such a well-set-up, vigorous, healthy-looking and careful-living man. Evidence of those in the field proved clearly that he expired directly after playing a stroke and as he prepared to receive another ball, for he was dead when carried to the pavilion. The medical report gave the cause of death--failure of a heart that showed signs of definite weakness.",
        "The loss of Ducat in this way may be attributed to the war, but for which there would not have been the Home Guard for him to join. His Surrey Unit were playing their Sussex brothers-in-arms, and Ducat was not out at lunch-time. On resuming, he raised his score from 12 to 29 before the catastrophe occurred.",
        "<>p>\nBorn on February 16, 1886, at Brixton, in South London. Ducat died at the age of 56, cut off when apparently in the full glow of health. In his youth and subsequently he lived at Southend, and there he played cricket well enough to induce him to become a member of the Oval staff in 1906. Good batting for the Surrey second eleven soon took him to the first-class rank in which he stood out conspicuously from 1909 to 1931. In his first full season he gave proof of his ability by scoring a century at the Oval against Somerset and averaging 27 for an aggregate of 1,080. From that form he never looked back. At a time when Surrey possessed a wealth of attractive fast run-getting batsmen anyone might have failed to shine in the splendour revealed by Tom Hayward, Jack Hobbs, Ernest Hayes, Alan Marshal the Australian giant, and J. N. Crawford; but Ducat bore comparison with all this array of talent. In 1910, a summer of indifferent weather, he played the highest innings for Surrey--153 against Yorkshire at the Oval. He got the runs, in his best display so far, in less than three hours, his driving, pulling, leg-hitting and cutting being brilliant. In seventy-five minutes he and Hobbs put on 121, and Hitch helped in such a hurricane of hitting that 127 runs came in an hour. That performance, typical of Ducat at his best, was the forerunner of many grand displays. Naturally, and by preference, a forcing batsman, he used his height, five feet ten inches, in perfect forward strokes which brought the drive into action with a minimum of effort, such was the accuracy in timing of his pendulum swing of the bat propelled by strong arms and shoulders.",
        "Altogether he put together 52 three-figure innings, all for Surrey, the highest being 306 not out against Oxford University at the Oval in 1919. This really sumptuous display, at the expense of a by no means poor bowling side, was not the only proof that he had not suffered from lack of first-class cricket during the four years of war. In fact, that season he scored 1,695 runs, entirely for Surrey, and his 52.96 placed him sixth in the batting averages for the whole country. Before this happy resumption of cricket, accidents caused serious checks in Ducat's career. An injured knee kept him out of several matches in 1912, and when football began that winter a broken leg incapacitated him completely. It seemed that he might be a permanent cripple, but a silver plate in the shin bone enabled him to recover so thoroughly that the loss of 1913, so far from prejudicing his prospects, preceded a prosperous season, for in 1914 he hit four centuries in championship matches and with 42 came out second to Hobbs--in superb form--in the Surrey averages. Again misfortune overtook him when in net practice prior to the start of the 1924 season a ball from Hitch fractured a bone in his arm, and \"Mac,\" as he was called by all his friends, could not play during that summer.",
        "Meanwhile the highest honour of the game rewarded Ducat. For the good reason of his skill and resolution in playing fast bowling and his unfailing courage he was picked for the Leeds Test match against Australia in 1921, when J. M. Gregory and E. A. McDonald struck terror into the hearts of many batsmen. Speed and sure hands in deep fielding also influenced his selection. Honoured with the distinguished place of number four, Ducat still found himself dogged by ill-luck, for, in playing McDonald, the shoulder of his bat was broken and the ball went to the slips, where Gregory held the catch, while the splinter of wood fell on the stumps, shaking off a bail. So Ducat was doubly out. Carter, the Australian wicket-keeper, handed to Ducat the piece of wood--a souvenir which could not compensate the batsman for such an unfortunate dismissal; and he stumped Ducat in the second innings! That was in keeping with the lamentable way in which everything went against England in that series of Tests against W. W. Armstrong's team, the first three wickets falling very cheaply in each of three consecutive defeats which cost England the rubber.",
        "When incapacitated in 1924, Ducat became manager of the Fulham football club, and while holding that appointment he was not always available for Surrey, but he invariably resumed full of runs. Sometimes Hobbs was kept idle by strains, and during one such period in 1928 Ducat scored 119 at Old Trafford, 179 not out against Warwickshire at the Oval, 101 not out and 42 at Horsham against Sussex, and 208 off the Essex bowlers in consecutive matches--649 runs for twice out. His chief partners were Sandham, 282 retired ill, who helped to add 299 in three hours and a half against Lancashire, and Shepherd, 145 not out, who hit so finely at Leyton that 317 runs came for the third wicket in two hours and three-quarters. All this happened in seventeen days; and with a fifth century, 121 against Somerset, Ducat, although not playing in every engagement, made 994 runs in less than six weeks.",
        "Until the end of the 1930 season, in which he scored 1,593 runs, average 45.51, in Championship matches, and 2,067, average 49.21, in all engagements, with 218 against Nottinghamshire at the Oval, the best of five three-figure innings, Ducat maintained his full value as batsman and fieldsman in the Surrey team; but he fell off next year and, his agreement with Surrey having expired, he was called upon to retire. So he said farewell to first-class cricket, at the age of 44, carrying with him the good will of colleagues and the satisfaction of having gained the highest honours at both cricket and Association football. Altogether in first-class cricket he scored 23,373 runs at an average of 38.31.",
        "No wonder that when a vacancy occurred at Eton for a coach that choice should fall upon a professional who himself might have been modelled on the style associated with R. A. H. Mitchell, the Lytteltons, the Studds, and carried on through succeeding generations on Agar's Plough--the forward stroke with the bat kept straight by the left elbow pointing to mid-off. Certainly the controlled off-drive, the square and late cut could be shown by this capable coach for young talent to copy, and the quiet, explanatory manner of Ducat during five years earned popularity which will make his place on the Eton cricket staff difficult to fill. In the Public School section, Mr. C. H. Taylor, master of cricket at Eton, Oxford Blue from 1923 to 1926, who played for Leicestershire, pays a tribute to Andrew Ducat.",
        "Just as at cricket so at football Ducat prospered during a long career which reached its climax in the years immediately following the protracted war break. When with Woolwich Arsenal in the old days at Plumstead he played right-half for England in all three internationals in the spring of 1910, and ten years later, when he was with Aston Villa, I saw him in two of the most remarkable matches ever played. On the day Wales visited Highbury in March 1920, pools of water stood on the sodden mud to which the turf was reduced, and the Welshmen literally splashed their way to victory by the odd goal in three. With Arthur Grimsdell on the left and Barson in the centre, Ducat completed a grand half-back line. A month later, on a sea of mud at Hillsborough, Sheffield, England, when apparently losing, fought back so valiantly that they beat Scotland by the odd goal in nine. Games of that kind live in the memory even if, by force of circumstance, they do not provide a display of perfect football. Ducat played his last international in 1921 against Ireland, England winning by two clear goals at Sunderland, and that summer came his England honour at cricket. Yet, of all his distinctions, Ducat must have prized most that April afternoon in 1920 at Stamford Bridge, when, as captain of Aston Villa, he received the Football Association Cup as reward for a hard-fought victory by the only goal scored over Huddersfield Town. In this way Aston Villa won the Cup for the sixth time, a record which Blackburn Rovers equalled in 1926.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}