{
    "batting_averages": [
        {
            "": "Tests",
            "100": "2",
            "50": "3",
            "6s": "0",
            "Ave": "38.21",
            "Ct": "4",
            "HS": "325",
            "Inns": "23",
            "Mat": "14",
            "NO": "0",
            "Runs": "879",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "107",
            "50": "165",
            "6s": "",
            "Ave": "44.82",
            "Ct": "158",
            "HS": "325",
            "Inns": "1000",
            "Mat": "643",
            "NO": "79",
            "Runs": "41284",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "14",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "31.11",
            "BBI": "3/27",
            "BBM": "",
            "Balls": "1008",
            "Econ": "3.33",
            "Inns": "",
            "Mat": "643",
            "Runs": "560",
            "SR": "56.0",
            "Wkts": "18"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/888219/seven-in-the-shallows",
        "http://www.espncricinfo.com/magazine/content/story/714423.html",
        "http://www.espncricinfo.com/blogs/content/story/677125.html",
        "http://www.espncricinfo.com/blogs/content/story/675957.html",
        "http://www.espncricinfo.com/wisdencricketer/content/story/347943.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=20058"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/102004/055046.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/102004/055046.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/102004/055046.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJuly 6, 1890, Streatham, London "
        ],
        "Died": [
            "April 20, 1982, Westminster, London (aged 91 years 288 days) "
        ],
        "Full name": [
            "Andrew Sandham"
        ],
        "Major teams": [
            "England,",
            "Surrey"
        ],
        "Other": [
            "Coach"
        ]
    },
    "profile_info": [
        "\nAndrew Sandham, who died on April 20, at the age of 91, stoically accepted second billing throughout his long career to his incomparable opening partner, Jack Hobbs. Sixty-six times they posted a three-figures stand, including the towering 428 against Oxford University in 1926: yet the spotlight remained fixed to Hobbs, even when he failed and Sandham made runs. \n",
        "From this it might be assumed that Andy Sandham was a mute No. 2. Some of his accomplishments argue otherwise. He once held the world Test record, making the First Test triple-century when he was in his 40th year, a 10-hour innings of 325 at Kingston, Jamaica, when England piled up 849 off the West Indies bowling. ",
        "Sandham had to borrow his captain's long-handled bat and Hendren's shoes (which occasionally slipped off as he scuttled a single); and when England batted again, he went in at No. 7 and made 50. His match aggregate of 375 was a Test record until Greg Chappell beat it at Wellington 44 years and 543 Tests later.",
        "Just before his 45th birthday, in 1935, the year of his second benefit, Sandham became the tenth batsman to score 100 centuries, turning the ball for two - \"I'll always remember that stroke\" - against Hampshire at Basingstoke. He finished with 107 centuries, including one in his last match for Surrey, at Hove in 1937. Ever neat, he finished with exactly 1,000 innings in first-class cricket, which produced 41,284 runs at an average of 44.83. Twice he came close to 300 for the county, retiring ill on 282 at Old Trafford in 1928 and being gently annoyed when Percy Fender declared overnight when he was 292 against Northants at the Oval in 1921.",
        "Sandham was born in Streatham on July 6, 1890, and made his Surrey debut in 1911. In the years to come he established himself as one of the most trusty batsmen, but not as a Test player. Hobbs was an England fixture, and soon after the First World War, Sutcliffe made the other opening berth his own. Thus Sandham won a mere 14 caps, only three of them against Australia. ",
        "Apart from his 325 he made 152 against West Indies at Bridgetown in the First Test of the 1929-30 series, which left him with the respectable Test average of 38.21; but his Ashes innings were all doomed to failure. By way of consolation, he is the only batsman to score a double-century for a county against the Australians; and he did score two centuries in a match for MCC against NSW.",
        "\"A sort of exponent of judo-batsmanship\" was how Denzil Batchelor described him. He was not large enough to bang the ball about. He was a 'touch' player, gliding and steering the ball, or flicking a bouncer off his eyebrows. Robertson-Glasgow saw him as \"primarily the servant of his art and his team, only secondarily the entertainer of the public\". ",
        "He learned much from watching Tom Hayward in the early days, and it almost goes without saying that to bat with Hobbs every day was, for an observant man, a richly rewarding experience. Their running of lighting singles, born of almost telepathic understanding, was one of the game's pre-war joys.",
        "Apart from the 428 against Oxford, Sandham's name remains beside two other Surrey partnership records: 298 for the sixth, and 173 for the tenth, when he went in last man at Leyton in 1921, having been sick after lunch. Ducat made 290 not out, Sandham 58 in 100 minutes. ",
        "He toured South Africa twice, India, West Indies and Australia once, and had several private tours, unobtrusively and modestly representing his country, tucking away runs, fleet-footed in the deep-field, the model professional. ",
        " When it was all over he became Surrey's coach, feeling a profound pride during the seven successive Championship seasons of the 1950s; and then he became the club's scorer.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}