{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "1",
            "Ave": "16.07",
            "Ct": "3",
            "HS": "39*",
            "Inns": "16",
            "Mat": "11",
            "NO": "3",
            "Runs": "209",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "12",
            "50": "26",
            "6s": "",
            "Ave": "20.08",
            "Ct": "181",
            "HS": "144",
            "Inns": "510",
            "Mat": "337",
            "NO": "55",
            "Runs": "9140",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "1",
            "4w": "0",
            "5w": "2",
            "Ave": "29.05",
            "BBI": "6/7",
            "BBM": "11/90",
            "Balls": "2404",
            "Econ": "2.61",
            "Inns": "20",
            "Mat": "11",
            "Runs": "1046",
            "SR": "66.7",
            "Wkts": "36"
        },
        {
            "": "First-class",
            "10": "4",
            "4w": "",
            "5w": "42",
            "Ave": "23.20",
            "BBI": "8/25",
            "BBM": "",
            "Balls": "42650",
            "Econ": "2.83",
            "Inns": "",
            "Mat": "337",
            "Runs": "20141",
            "SR": "49.1",
            "Wkts": "868"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/751685.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155738.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154719.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/102004/054906.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/102004/054906.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/102004/054906.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nDecember 23, 1894, Denmark Hill, London "
        ],
        "Bowling style": [
            "Right-arm fast-medium"
        ],
        "Died": [
            "September 5, 1976, Mare Hill, Pulborough, Sussex (aged 81 years 257 days) "
        ],
        "Full name": [
            "Arthur Edward Robert Gilligan"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Surrey,",
            "Sussex"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        "For all too short a span, before injury reduced his effectiveness, he was himself an exciting cricketer--the best really fast bowler we had produced for many years--though even then we did not quite put him among the great, a batsman of whom one might say that, however low he went in, no match was irredeemably lost until he was out for the second time, and one of the finest mid-offs anyone could remember.",
        "But even at the height of his career his services to cricket did not stop there. Unless he was touring abroad in the winter, he was touring Sussex, speaking at dinners, lecturing and doing all he could to spread the enthusiasm for the game that he himself felt; and this continued for years after his retirement. His first-class career ended in 1932--indeed he played little cricket of any kind afterwards--but he went on working tirelessly for Sussex cricket and, when opportunity offered, for England.",
        "He had been Chairman of Sussex and in 1967 was President of the M.C.C. He remained fit and active to the end. Throughout the summer of 1976 he might be found watching at Hove or Lord's or Arundel, as clear in mind and alert as ever, endlessly appreciative of good cricket and showing the utmost kindness and encouragement to the young, but equally uncompromising in his condemnation of anything which savoured of sharp practice or ill temper. In between he was still playing golf regularly at Pulborough, where he had gone round in under his age, and in the winter he was off to follow an England side in Australia or the West Indies, or to ski on the continent.",
        "At Dulwich, where he also distinguished himself as a runner and a hurdler, he was four years in the XI and Captain in the last two, 1913 and 1914, in both of which seasons he played for Surrey II in the holidays. The war stopped his cricket till 1919, when he got his blue at Cambridge and in the second innings against Oxford took six for 52. This was widely acclaimed as the best fast bowling seen in the match for many years. For Cambridge against Sussex that year he created some sensation by making 101 going in last; he and J. H. Naumann, who like himself later played for Sussex, put on 177 in sixty-five minutes. However it must be admitted that Sussex had, as not infrequently at this time, a very weak bowling side.",
        "Later Gilligan played three matches for Surrey, but in 1920, after again playing for Cambridge, he transferred to Sussex, for whom he continued to play till 1932, captaining them from 1922 to 1929. At first he was only a useful county player, but in 1922 he jumped right to the front, taking 135 wickets with an average of 18.75 and playing for the first time for the Gentlemen. That winter he went with the M.C.C. to South Africa and next summer for the only time did the double.",
        "In 1924 he was picked to captain England and in the first Test at Edgbaston he and Tate bowled out South Africa on a good wicket for 30, Gilligan's share being six for 7; in the follow-on he took five for 83. There can be no doubt that just at that period these two were the most formidable combination in the world. A week or two earlier in consecutive matches for Sussex they had bowled out two of the strongest batting sides in England, Surrey for 53 at the Oval and Middlesex for 41 at Lord's, Gilligan on this occasion taking eight for 25. At the end of June that year he had taken seventy-four wickets at fifteen runs each.",
        "At the beginning of July, batting for Gentlemen v. Players at The Oval, he was struck over the heart by a rising ball from Pearson of Worcestershire, a medium pace off-spinner and a man universally liked and respected. It was clear that he was badly hurt, but no one guessed how badly. He undoubtedly increased the damage by insisting on going on playing and even more by scoring 112 in the second innings in an hour and a half and adding 134 for the last wicket with Michael Falcon. As he himself wrote some years later, That was probably the worst thing I ever did. He was never able to bowl really fast again and indeed was never more than a change bowler. When he captained England in Australia that winter, his ten wickets in the Test cost him 51.90 runs each and his highest score was 31. Except for his brilliant fielding and inspiring captaincy he was a passenger. In 1926 he was a Selector and the following winter made his last tour abroad, captaining the M.C.C. in India, not then a Test-playing country.",
        "At his best, Gilligan was a genuinely fast bowler, who bowled at the stumps or for catches in the slips. His action may have been slightly low, but he was accurate and regarded it as a cardinal sin to bowl short. He was an attacking batsman, who believed especially that fast bowlers needed hitting. His twelve centuries in first-class cricket must have been scored at an average rate of over a run a minute. Nearly all of them he made going in late, when runs were desperately wanted. Moreover, they were usually against strong sides--two against Lancashire, two against Kent, one each against Yorkshire, Nottinghamshire, Surrey and the Players. At mid-off he has had few rivals.",
        "As a captain, he may not have been in the top rank of tacticians, but no one excelled him in getting the best out of his side and inspiring them in the field. From every point of view he was a cricketer with whom England could well do now.",
        "After he retired from active cricket he became a popular radio commentator on Test matches and will be especially remembered for his partnership with another much loved cricketer, Victor Richardson. Gilligan was, as may be imagined, a master of the diplomatic comment if any tiresome incident occurred.",
        "He was prominent too in the golfing world, being President of the English Golf Union in 1959 and also, up to the time of his death, of the County Cricketers' Golfing Society. His two brothers were only less distinguished as cricketers than himself. F. W., the eldest, who played against him in his two `Varsity matches, captained Oxford and kept wicket for Essex for many years in the holidays, while the youngest, A. H. H., succeeded him as Captain of Sussex and took an M.C.C. side to Australia and New Zealand in 1929; his daughter married Peter May.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}