{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "1",
            "6s": "0",
            "Ave": "19.75",
            "Ct": "3",
            "HS": "63",
            "Inns": "13",
            "Mat": "11",
            "NO": "1",
            "Runs": "237",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "45",
            "50": "98",
            "6s": "",
            "Ave": "31.56",
            "Ct": "395",
            "HS": "206",
            "Inns": "709",
            "Mat": "468",
            "NO": "42",
            "Runs": "21051",
            "St": "1"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "11",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "37.09",
            "BBI": "3/14",
            "BBM": "",
            "Balls": "1816",
            "Econ": "3.79",
            "Inns": "",
            "Mat": "468",
            "Runs": "1150",
            "SR": "58.5",
            "Wkts": "31"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wcm/content/story/70323.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155472.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154721.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/052004/052494.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/052004/052494.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/052004/052494.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMay 21, 1893, Mickleham, Surrey "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "February 7, 1963, West Witton, Yorkshire (aged 69 years 262 days) "
        ],
        "Full name": [
            "Arthur William Carr"
        ],
        "Major teams": [
            "England,",
            "Nottinghamshire"
        ]
    },
    "profile_info": [
        null,
        "Arthur William Carr, who collapsed and died after shovelling snow at his home at West Witton, Yorkshire, on February 7, aged 69, was a celebrated Nottinghamshire and England captain. Born at Mickleham, Surrey, he was educated at Sherborne where he was captain of every game except cricket. Nevertheless he earned an early reputation as a cricketer. He headed the School averages in 1910 with 638 runs at 45.47 per innings and took with fast bowling 32 wickets for 15.06 runs each; the following year, with the aid of an innings of 224, he averaged 62. While still at school he made a few appearances for Nottinghamshire and in 1913, at the age of 18, he gave a display of that strong-driving, attacking play which always characterised his cricket when he hit 169 against Leicestershire at Trent Bridge. He and G. M. Lee (200 not out) shared in a stand of 333 in just over three hours.",
        "Not till he took over the captaincy in 1919--a position he occupied till 1934, when he gave up, following a heart attack--did he occupy a regular place in the county eleven. Then, with improved judgement allied to his forcing methods, he became a highly valuable batsman. In each of eleven seasons he exceeded 1,000 runs, his most successful being that of 1925 when, with the help of seven centuries, including his highest--206 against Leicestershire at Leicester--he aggregated 2,338 runs with an average of 51.95. That summer he hit no fewer than forty-eight 6's. During his first-class career he made 21,884 runs, average 31.12, took 28 wickets at 38.17 apiece and, an exceptionally alert fieldsman anywhere near the wicket, held 361 catches.",
        " Carr played for England on eleven occasions. He toured South Africa under F. T. Mann in 1922-23, taking part in all five Test matches; he led his country in four games against Australia in 1926 till he was superseded by A. P. F. Chapman at the Oval--a decision which aroused much controversy--and in 1929 he was recalled to the leadership for the last two matches with South Africa, replacing J. C. White, captain in the first three. In thirteen Test innings he hit 237 runs, with a top score of 63 at Johannesburg, average 19.75. He made a number of appearances for Gentlemen against Players between 1919 and 1929.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}