{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "1",
            "Ave": "11.75",
            "Ct": "2",
            "HS": "38",
            "Inns": "4",
            "Mat": "2",
            "NO": "0",
            "Runs": "47",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "2",
            "50": "59",
            "6s": "",
            "Ave": "19.72",
            "Ct": "377",
            "HS": "112",
            "Inns": "679",
            "Mat": "417",
            "NO": "46",
            "Runs": "12485",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "1",
            "5w": "0",
            "Ave": "33.85",
            "BBI": "4/81",
            "BBM": "4/111",
            "Balls": "456",
            "Econ": "3.11",
            "Inns": "4",
            "Mat": "2",
            "Runs": "237",
            "SR": "65.1",
            "Wkts": "7"
        },
        {
            "": "First-class",
            "10": "24",
            "4w": "",
            "5w": "108",
            "Ave": "24.35",
            "BBI": "8/52",
            "BBM": "",
            "Balls": "89738",
            "Econ": "2.62",
            "Inns": "",
            "Mat": "417",
            "Runs": "39302",
            "SR": "55.5",
            "Wkts": "1614"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/533600.html",
        "http://www.espncricinfo.com/magazine/content/story/335303.html",
        "http://www.espncricinfo.com/wisdencricketer/content/story/290193.html",
        "http://www.espncricinfo.com/wisdencricketer/content/story/229630.html",
        "http://www.espncricinfo.com/cricketer/content/story/142346.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=22357"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/102004/055101.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/102004/055101.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/102004/055101.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nApril 8, 1902, Southfleet, Kent "
        ],
        "Bowling style": [
            "Right-arm fast-medium"
        ],
        "Died": [
            "December 31, 1980, Eastbourne, Sussex (aged 78 years 267 days) "
        ],
        "Full name": [
            "Arthur William Wellard"
        ],
        "Major teams": [
            "England,",
            "Somerset"
        ],
        "Other": [
            "Coach"
        ]
    },
    "profile_info": [
        "\nWELLARD, ARTHUR WILLIAM, died peacefully in his sleep on December 31, 1980, aged 77. In a career extending from 1927 to 1950 he scored 12,575 runs with an average of 19.73 and took 1,614 wickets at 24.35 - figures which suggest a valuable county all-rounder. In fact he was more than that. Though he was a good enough opening bowler to be selected in that rôle for a Test against Australia, and once took nine for 117 in an unofficial Test in India, it is as a batsman that he will be chiefly remembered. In the course of his career he hit some 500 6s, thus accounting for a quarter of the runs he made. But he was no mere slogger: he had a sound defence and was, for one of his type, remarkably consistent. His record was not boosted by large innings. He made only two hundreds, his highest score being 112 against Lancashire at Old Trafford in 1936. A tall, strong man, he bowled fast-medium with a vicious break-back, and a large number of his victims were clean-bowled. For variety in a second spell, or when the pitch was taking spin, he could bowl just as efficiently slow off-breaks round the wicket. He was a fine field anywhere close in. Above all, whatever he was doing he was an indefatigable trier. \n",
        "Born at Southfleet, near Gravesend, he originally played for Bexley and as early as 1921 took six for 21 against Kent Club and Ground. When the sides next met in 1926, he took five for 36. But despite this, and although he headed the Bexley batting and bowling averages for three years, Kent were not interested and tradition has it that, when he asked whether there was any chance of a trial for them, he was told he had much better be a policeman. It was Arthur Haywood, late of the Kent staff and then professional at Taunton School, who suggested that he should approach Somerset and he started to qualify for them in 1927. That year and the next he showed promising form against the touring side, and in his first full season, 1929, he took 131 wickets at 21.38. For the next few years, owing largely to elbow trouble, his bowling was disappointing, but in 1933 he did the double, a feat he repeated in 1935 and 1937. A good example of what he could do was the Hampshire match at Portsmouth in 1933. Coming in when six wickets were down for 38, he made 77 out of 94, took seven for 43, made 60 in the second innings and then took three more wickets for 66. In 1936 he hit Armstrong of Derbyshire, a slow left-armer, for five 6s off consecutive balls: he had already taken nine wickets in the match and his 86 in 62 minutes brought his side a one-wicket victory. In 1938 he again hit five consecutive 6s, this time off Frank Woolley, being dropped just in front of the screen off the sixth ball. On this occasion his scores were 57 and 37 and he took thirteen for 115: so again he had much to do with his side's victory. These feats, at that time unparalleled, were both performed on the small ground at Wells.",
        null,
        "In an age when cricket seems to be receding from school activities, it may be\nencouraging to reflect that Arthur Wellard, one of the most exciting 'natural' players, was similarly deprived and yet, in his late teens, found himself a place in a local club side in Kent and was playing county cricket at 25 - if not for the county of his birth.",
        "Arthur William Wellard, who died in\nhis sleep early on New Year's Eve at the age\nof 78, will always be identified with\nSomerset, whom he represented from 1927\nto 1950. A tall, loose-limbed fast-medium\nbowler with a Tom Richardson breakback\nand occasional swing, he would also bowl\nmedium-pace off-breaks. Yet it was his\nmuscular batting which put him in the\nrecord books. At first something of a rustic\nhitter, he worked on his batting until he\ncould - reluctantly - defend as well as hit\nwith astonishing power. His driving was\nscientific, not 'blind', and epitomised the\ntheory that if a ball was smitten hard and\nhigh enough, no fieldsman on earth could\nstop it. His sixes flowed like ack-ack fire -\n500 of them - more than anyone else since,\nin 1910, clearance of the boundary has spelt\nsix runs. No-one has been able to assess exactly how many balls Wellard lost.",
        "He alone features twice in Wisden's list headed Most Runs Scored off One Over. In 1936, on the small Wells ground, he\nthumped five sixes off an over from Derbyshire slow left-arm bowler 'Tosser' Armstrong. Two years later, on the same\nground, while England completed their\ndemolition of Australia by an innings and",
        "579 runs at The Oval, Wellard hit five sixes\nand a single off an over by Kent's Frank\nWoolley, the single coming from a missed\ncatch to Bryan Valentine on the boundary.\nWellard sealed this match with 13 wickets\nfor 115.",
        "In his first full season with Somerset he\ntook 125 Championship wickets, 69 of\nthem bowled, his pairing in the attack with\nthe wily slow left-armer 'Farmer' White\nproving a most attractive sight for county\nspectators. He performed his only first-class\nhat-trick that year too, at Leicester, where\nhis 'pair' would have triggered the same\nbroad smile of resignation that was to touch\nhis team-mates hundreds of times in the\nyears ahead as catches went down off his\nown bowling. Ron Roberts wrote of him\nthat fielders and Test selectors alike continually let him down.",
        "Indeed, he played only twice for\nEngland - in 1937 at Manchester, when he\ntook four good New Zealand wickets for 81\nin the first innings, and a year later at\nLord's, when he took the wickets of\nHassett, Badcock and Fingleton, and helped\nthe young Compton in an important eighth-wicket stand of 74 on the last day, making\n38 with some awkward defence and typical\nattack, including a six off McCabe into the\ngrandstand.",
        "He was one of the unfortunates chosen in 1939 for the aborted tour of India,\nthough he had seen that country with Tennyson's side in 1937-38, when his six-hitting prowess made him one of the chief drawcards.",
        "During a wartime match at Hayes he reached fifty in eight minutes. Then came\nthe serious business of service in North Africa and Italy, and it remained to be seen how much big cricket was left in Arthur Wellard when hostilities ceased. He was 43, but still fit.",
        "Somerset gave him - or better expressed, he gave them - four more full seasons, helping them to fourth place in 1946 with 106 wickets. In the following\nthree seasons he took 91, 50 and 84, but at progressively and understandably higher cost. In 1950 he took a testimonial, and his remaining cricket was played in the Birmingham League and at club level. Settling in Sutton, Surrey, he coached for a number of years at the Gover School.",
        "A courageous fieldsman close to the bat, he took 375 catches; his run aggregate\nwas 12,515, average 19.73, with two centuries; and he took 1614 wickets at 24.35, his best analysis being 8 for 52 against Worcestershire at Bath in 1947, when his match figures were 15 for 101. Three times he did the double, six times he played for the Players against the Gentlemen (with several successes), and in 1936 he was one of Wisden's Five Cricketers of the Year. In his younger days this smiling giant played senior league football as a full-back and goalkeeper.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}