{
    "batting_averages": [
        {
            "": "Tests",
            "100": "6",
            "4s": "345",
            "50": "13",
            "6s": "40",
            "Ave": "34.28",
            "BF": "4217",
            "Ct": "38",
            "HS": "258",
            "Inns": "77",
            "Mat": "43",
            "NO": "1",
            "Runs": "2606",
            "SR": "61.79",
            "St": "0"
        },
        {
            "": "ODIs",
            "100": "3",
            "4s": "144",
            "50": "12",
            "6s": "55",
            "Ave": "35.50",
            "BF": "1972",
            "Ct": "37",
            "HS": "102*",
            "Inns": "61",
            "Mat": "70",
            "NO": "9",
            "Runs": "1846",
            "SR": "93.61",
            "St": "0"
        },
        {
            "": "T20Is",
            "100": "0",
            "4s": "19",
            "50": "0",
            "6s": "8",
            "Ave": "14.71",
            "BF": "151",
            "Ct": "8",
            "HS": "38",
            "Inns": "19",
            "Mat": "22",
            "NO": "5",
            "Runs": "206",
            "SR": "136.42",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "14",
            "4s": "",
            "50": "32",
            "6s": "",
            "Ave": "34.02",
            "BF": "",
            "Ct": "79",
            "HS": "258",
            "Inns": "197",
            "Mat": "118",
            "NO": "9",
            "Runs": "6396",
            "SR": "",
            "St": "0"
        },
        {
            "": "List A",
            "100": "7",
            "4s": "316",
            "50": "19",
            "6s": "117",
            "Ave": "35.01",
            "BF": "3863",
            "Ct": "67",
            "HS": "164",
            "Inns": "125",
            "Mat": "140",
            "NO": "18",
            "Runs": "3747",
            "SR": "96.99",
            "St": "0"
        },
        {
            "": "T20s",
            "100": "1",
            "4s": "160",
            "50": "8",
            "6s": "93",
            "Ave": "24.69",
            "BF": "1521",
            "Ct": "43",
            "HS": "103*",
            "Inns": "99",
            "Mat": "109",
            "NO": "15",
            "Runs": "2074",
            "SR": "136.35",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "4",
            "5w": "4",
            "Ave": "32.97",
            "BBI": "6/22",
            "BBM": "8/161",
            "Balls": "6126",
            "Econ": "3.35",
            "Inns": "74",
            "Mat": "43",
            "Runs": "3429",
            "SR": "58.9",
            "Wkts": "104"
        },
        {
            "": "ODIs",
            "10": "0",
            "4w": "1",
            "5w": "1",
            "Ave": "39.72",
            "BBI": "5/61",
            "BBM": "5/61",
            "Balls": "2271",
            "Econ": "6.08",
            "Inns": "58",
            "Mat": "70",
            "Runs": "2304",
            "SR": "39.1",
            "Wkts": "58"
        },
        {
            "": "T20Is",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "49.60",
            "BBI": "3/26",
            "BBM": "3/26",
            "Balls": "334",
            "Econ": "8.91",
            "Inns": "18",
            "Mat": "22",
            "Runs": "496",
            "SR": "33.4",
            "Wkts": "10"
        },
        {
            "": "First-class",
            "10": "1",
            "4w": "13",
            "5w": "7",
            "Ave": "29.64",
            "BBI": "7/67",
            "BBM": "10/121",
            "Balls": "13899",
            "Econ": "3.49",
            "Inns": "184",
            "Mat": "118",
            "Runs": "8094",
            "SR": "50.9",
            "Wkts": "273"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "3",
            "5w": "1",
            "Ave": "31.31",
            "BBI": "5/61",
            "BBM": "5/61",
            "Balls": "3916",
            "Econ": "5.75",
            "Inns": "103",
            "Mat": "140",
            "Runs": "3758",
            "SR": "32.6",
            "Wkts": "120"
        },
        {
            "": "T20s",
            "10": "0",
            "4w": "1",
            "5w": "0",
            "Ave": "32.62",
            "BBI": "4/16",
            "BBM": "4/16",
            "Balls": "1382",
            "Econ": "8.21",
            "Inns": "78",
            "Mat": "109",
            "Runs": "1892",
            "SR": "23.8",
            "Wkts": "58"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/1155715.html",
        "http://www.espncricinfo.com/ci/content/story/1155493.html",
        "http://www.espncricinfo.com/ci/content/story/1155441.html",
        "http://www.espncricinfo.com/ci/content/story/1155383.html",
        "http://www.espncricinfo.com/ci/content/story/1155353.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=311158"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/279300/279383.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/279300/279383.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/279300/279383.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nJune 4, 1991, Christchurch, Canterbury, New Zealand "
        ],
        "Bowling style": [
            "Right-arm fast-medium"
        ],
        "Current age": [
            "27 years 75 days"
        ],
        "Full name": [
            "Benjamin Andrew Stokes"
        ],
        "Major teams": [
            "England,",
            "Canterbury,",
            "Durham,",
            "Durham 2nd XI,",
            "England Lions,",
            "England Under-19s,",
            "Melbourne Renegades,",
            "Rajasthan Royals,",
            "Rising Pune Supergiant"
        ],
        "Playing role": [
            "Allrounder"
        ]
    },
    "profile_info": [
        "\nBen Stokes' powerful frame, aggressive intent with bat and ball and energy in the field has encouraged the belief that he will grow into one of the most renowned allrounders in England's history. There is not a challenge that he does not relish and, if at times his batting can appear naïve or his bowling can be exposed on sedate pitches, his combative instincts and crowd-pleasing nature identified him as a Box Office figure. \n",
        "It is his misfortune therefore that for all his great deeds - and he has an extraordinary Test double hundred to his name - he will be most remembered in a cricketing world consumed by the limited-overs game as the fall guy in the 2016 Twenty20 World Cup final in Kolkata when he had to defend 19 in the last over against West Indies only for him to fail to hit his yorker and for Carlos Brathwaite to strike four successive sixes into a sweltering night sky.",
        "As Stokes dropped to his haunches, he could at least console himself that, at 24, he had ample chance to bury that memory. Less than three months earlier, he had been cock of the walk as he made a barnstorming 258 from 198 balls against South Africa in Cape Town - the fastest England double hundred in history, and second of all time, sharing a stand of 399 with Jonny Bairstow and registering the highest Test score by a No. 6. A monstrous blow into the brewery off Dane Piedt satisfied a particular yearning. ",
        "Stokes, from the moment he made his Durham debut, felt very much a product of the north east of England. He was actually born in Christchurch, New Zealand and came from a rich sporting pedigree with his father, Ged, playing international Rugby League for that country.",
        "His prodigious talent was clear from an early age: he was just 18 when he signed a two-year contract with Durham in December 2009. A true allrounder, he had been quietly developing in the Durham Academy for some time and had already made his one-day debut for Durham that summer, snaring Mark Ramprakash, a quiet destroyer of county attacks from the day he was born, with his third legal delivery in senior cricket. From there he enjoyed a productive time at the Under-19 World Cup, scoring a century against India, before registering a maiden fifty on his first-class debut for Durham in the pink-ball season opener against MCC.",
        "Stokes clearly enjoyed his first full season of Championship cricket, notching up 740 runs at 46.25, but it was in 2011 that he really began to blossom. In April he took 6 for 68 and scored a brilliant hundred that included five sixes in an over against Hampshire, and just over a month later registered his maiden limited-overs ton, cracking 150 not out against Warwickshire in the Clydesdale Bank 40. A broken finger hindered his bowling, but he played for England Lions and made his ODI debut against Ireland in Dublin, going on to play four times against India, albeit with limited impact.",
        "Stokes performed better than many with the bat in a damp 2012 season, making 827 runs at 29.53, and coupled with his 37 wickets at 21.47 it was an excellent return. He was called up to the England Lions squad for the tour of Australia in early 2013 but ended up being sent home with three matches remaining, along with Kent's Matt Coles, after two breaches of discipline. It was a watershed moment. He was rapidly rehabilitated, however, playing a key role in Durham's Championship-winning season and being recalled to England's limited-overs teams. Playing as a third seamer in the one-dayers against Australia, and batting strikingly low at No 8, he took a maiden five-wicket haul and won selection for the 2013-14 Ashes tour that suddenly thrust him to the forefront of many people's attention.",
        "Stokes' potentially life-changing experience on England's Ashes otherwise disastrous 2013/14 tour of Australia did not just fill English cricket with hope for a new era, it was a test for even the most stable personality. England were walloped 5-0 in the Tests, lost 4-1 in the one-day series and were whitewashed again in T20, and when the agony was all over, only Stokes returned to England hailed as a star of the future.",
        "Stokes was that rare thing in English cricket: a true allrounder, and what is more a pugnacious as well as talented one, naturally combative, not cowed by confrontation. The maiden Test hundred he produced in Perth from No 6 as England, 2-0 down in the series, resorted to a five-strong attack was a doughty response out of keeping with England's general demeanour throughout the tour. Stokes, the player most under pressure, delivered emphatically, but few others did. It was no wonder that the media and the public took him to their hearts. ",
        "But he remained a work in progress, albeit an impressive one. A dismal 2014 summer insisted as much. An England run of 43 runs in 12 innings in all formats, with six ducks, at an average of 3.60, revealed a batsman bereft of form. All that followed his recovery from a badly broken wrist suffered during an ill-advised attempt to use a dressing locker as a punchbag in the Caribbean. That anger at his dismissal ruled him out of World Twenty20 in Bangladesh. When he swept Durham to the Royal London One-Day Cup final with a vigorous 164 against Nottinghamshire at Chester-le-Street, and then followed up with an important innings at Lord's to see off Warwickshire, it was as if a weight had lifted. ",
        "The 2015 Lord's Test against New Zealand was another breakthrough. Scores of 92 and 101 in typically rumbustious fashion, and three excellent wickets as England forced victory against Brendon McCullum's entertaining tourists caused Lord's to loosen its manners and become noisily emotional. A victorious Ashes series followed later that summer and his 6 for 36 in the second innings at Trent Bridge - arguably his most adroit bowling display in an England shirt - completed a victory that had seemed inevitable from the moment that Stuart Broad had taken 8 to dismiss Australia on the first morning.",
        "Following his Kolkata nightmare, he returned to India later in 2016 on an England Test and one-day tour, eager to make amends. He pillaged a century in the opening Test in Rajkot, despite suffering from cramps, and three hundreds the following English summer - two of them in ODIs - established himself as a fan's favourite. His bowling had been undermined by injuries - a heavy-footed frame caused some concern - but he responded with a Test-best 6 for 22 against the West Indies at Lord's when he swung the ball persistently in a valiant spell of 15 overs without a break.",
        "Now 26, he should have gone to Australia for the 2017-18 Ashes tour not just as England's vice-captain, but as the heartbeat of the side, only for his career to hit the rocks after an England ODI in Bristol in September when he became embroiled a dead-of-night incident outside the Mbargo nightclub in Bristol which led to a lengthy investigation by Avon and Somerset Police. England omitted him pending a Police decision on whether he would be tried, but his shadow hung heavily over the tour and the Ashes were long gone, England beaten 4-0, before the Crown Prosecution Service charged him nearly four months later with affray.",
        null
    ],
    "recent_matches": [
        {
            "Bat & Bowl": "21, 2/73, 6, 4/40",
            "Ground": "Birmingham",
            "Match Date": "1 Aug 2018",
            "Opposition": "v India",
            "Scorecard": "Test # 2314",
            "Team": "England"
        },
        {
            "Bat & Bowl": "10",
            "Ground": "Chester-le-Street",
            "Match Date": "28 Jul 2018",
            "Opposition": "v Notts",
            "Scorecard": "T20",
            "Team": "Durham"
        },
        {
            "Bat & Bowl": "5/52, 3, 3/66, 9",
            "Ground": "Cheltenham",
            "Match Date": "22 Jul 2018",
            "Opposition": "v Gloucs",
            "Scorecard": "FC",
            "Team": "Durham"
        },
        {
            "Bat & Bowl": "4/16, 43",
            "Ground": "Chester-le-Street",
            "Match Date": "20 Jul 2018",
            "Opposition": "v Worcs",
            "Scorecard": "T20",
            "Team": "Durham"
        },
        {
            "Bat & Bowl": "0/43",
            "Ground": "Leeds",
            "Match Date": "17 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "ODI # 4018",
            "Team": "England"
        },
        {
            "Bat & Bowl": "5, 0/29",
            "Ground": "Lord's",
            "Match Date": "14 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "ODI # 4016",
            "Team": "England"
        },
        {
            "Bat & Bowl": "50, 0/27",
            "Ground": "Nottingham",
            "Match Date": "12 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "ODI # 4014",
            "Team": "England"
        },
        {
            "Bat & Bowl": "14, 0/11",
            "Ground": "Bristol",
            "Match Date": "8 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "T20I # 690",
            "Team": "England"
        },
        {
            "Bat & Bowl": "90*",
            "Ground": "Leeds",
            "Match Date": "5 Jul 2018",
            "Opposition": "v Yorkshire",
            "Scorecard": "T20",
            "Team": "Durham"
        },
        {
            "Bat & Bowl": "38, 3/73, 9",
            "Ground": "Lord's",
            "Match Date": "24 May 2018",
            "Opposition": "v Pakistan",
            "Scorecard": "Test # 2304",
            "Team": "England"
        }
    ]
}