{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "6",
            "50": "0",
            "6s": "0",
            "Ave": "11.00",
            "BF": "118",
            "Ct": "2",
            "HS": "28",
            "Inns": "4",
            "Mat": "2",
            "NO": "0",
            "Runs": "44",
            "SR": "37.28",
            "St": "0"
        },
        {
            "": "ODIs",
            "100": "0",
            "4s": "34",
            "50": "2",
            "6s": "3",
            "Ave": "20.60",
            "BF": "381",
            "Ct": "6",
            "HS": "63",
            "Inns": "17",
            "Mat": "20",
            "NO": "2",
            "Runs": "309",
            "SR": "81.10",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "3",
            "4s": "",
            "50": "14",
            "6s": "",
            "Ave": "25.87",
            "BF": "",
            "Ct": "68",
            "HS": "163",
            "Inns": "114",
            "Mat": "75",
            "NO": "6",
            "Runs": "2794",
            "SR": "",
            "St": "0"
        },
        {
            "": "List A",
            "100": "0",
            "4s": "",
            "50": "14",
            "6s": "",
            "Ave": "24.08",
            "BF": "",
            "Ct": "44",
            "HS": "98",
            "Inns": "115",
            "Mat": "136",
            "NO": "12",
            "Runs": "2481",
            "SR": "",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "49.75",
            "BBI": "2/105",
            "BBM": "2/83",
            "Balls": "252",
            "Econ": "4.73",
            "Inns": "4",
            "Mat": "2",
            "Runs": "199",
            "SR": "63.0",
            "Wkts": "4"
        },
        {
            "": "ODIs",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "66.50",
            "BBI": "2/37",
            "BBM": "2/37",
            "Balls": "642",
            "Econ": "4.97",
            "Inns": "17",
            "Mat": "20",
            "Runs": "532",
            "SR": "80.2",
            "Wkts": "8"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "1",
            "Ave": "33.45",
            "BBI": "5/51",
            "BBM": "",
            "Balls": "7293",
            "Econ": "3.46",
            "Inns": "",
            "Mat": "75",
            "Runs": "4215",
            "SR": "57.8",
            "Wkts": "126"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "1",
            "5w": "1",
            "Ave": "28.22",
            "BBI": "5/10",
            "BBM": "5/10",
            "Balls": "4833",
            "Econ": "4.97",
            "Inns": "",
            "Mat": "136",
            "Runs": "4008",
            "SR": "34.0",
            "Wkts": "142"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/890395.html",
        "http://www.espncricinfo.com/england-v-new-zealand-2015/content/story/888309.html",
        "http://www.espncricinfo.com/england/content/story/561777.html",
        "http://www.espncricinfo.com/australia/content/story/561685.html",
        "http://www.espncricinfo.com/magazine/content/story/407730.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=14246"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/042002/035771.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042002/035771.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042002/035771.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nNovember 11, 1977, Melbourne, Victoria, Australia "
        ],
        "Bowling style": [
            "Right-arm fast-medium"
        ],
        "Died": [
            "March 23, 2002, Perth, Western Australia, Australia (aged 24 years 132 days) "
        ],
        "Full name": [
            "Benjamin Caine Hollioake"
        ],
        "Major teams": [
            "England,",
            "Surrey"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nBen Hollioake died when his Porsche 924 left a freeway exit road, made slippery by light rain, and crashed into a brick wall. He had been driving home from the customary family dinner that preceded his and his brother Adam's return to Surrey for the English season, having spent much of the winter with England's one-day squad in Zimbabwe, India and New Zealand. Ben was just 24 years and 132 days old: no England Test cricketer had died so young. \n",
        "The England captain, Nasser Hussain, flew from the Test series in New Zealand for his funeral, which was attended also by Surrey colleagues and Australian players, testimony to his immense popularity. \"Ben was the most naturally gifted cricketer that I have ever played alongside,\" said Alec Stewart, who captained him for Surrey and England. Everyone recalled his easy-going approach to life and the friendships he fostered with his gentle nature and whimsical sense of humour; Adam, in his funeral address, described him as \"a beautiful work of art, a classic sculpture\". And in the game's collective memory, the picture of Ben Hollioake remained fixed on a spring afternoon in 1997 when, making his England debut at 19, this tall, loose-limbed allrounder set Lord's alight with 63 in 48 balls against Australia to take the Man of the Match award.",
        "Ben's selection for that one-day international was a triumph for style over content, for promise over performance. Given English cricket's innate conservatism, it was sensational. In only his second season of county cricket, he had played just five first-class and 21 one-day games; there had been no centuries, no five-wicket returns since he took five for ten in a Sunday League game against Derbyshire on his Surrey debut (Stewart, keeping wicket, said he hit the gloves harder than the established fast bowlers). But he had done well with Andrew Flintoff's series-winning England Under-19 side in Pakistan in 1996-97, opening the bowling with Surrey team-mate Alex Tudor and scoring middle-order runs, and at Edgbaston in April he caught the eye with 46 not out and three for 22 for The Rest against England A.",
        "England, already two-up in the three-match series against Australia by dint of Adam Hollioake's unbeaten half-centuries, and searching for a fast-bowling all-rounder, could afford to try his younger brother. If nothing else, the athleticism of Ben's fielding was worth the admission price. The captain, Mike Atherton, asked him that morning if he fancied going in at No. 3: \"He shrugged and said, in his laconic way, he'd give it a go.\" Some go. Third ball he drove Glenn McGrath back down the ground for four, and he took 13 from McGrath's next over. When he went down on one knee and swept Shane Warne over mid-wicket, Lord's purred. The press didn't just wax their lyricals, they preserved them in honey. Here potentially was a hero for a game desperate to claw back ground lost to football in the national consciousness.",
        "But inside a month McGrath was back at Lord's, taking eight for 38 to bowl England out for 77 in the Second Test. Having located an English length, he then kept them on the back foot until Australia retained the Ashes. England's whitewash in the one-day series and their nine-wicket win in the First Test could be seen for what they were: a glimmer of light in another false dawn.",
        "A cry went up for the Hollioakes' Australian-bred brio to spark an English resurgence. Born in Melbourne, the brothers had travelled to England when their father's work took him there, and Ben played age-group cricket for England while at Millfield. Although he completed his schooling in Perth after the family moved back to Australia, Surrey had already lined him up to rejoin Adam at The Oval. Between England's heavy defeats at Manchester and Leeds, the brothers helped Surrey win the Benson and Hedges Cup. Once more, Ben's batting at Lord's was sublime. Again coming in first wicket down, he struck 98 from 112 balls, using all of his six feet two inches to drive the ball on the up off the front foot. Again he won the match award. Adam dedicated the victory to Graham Kersey, the young Surrey wicket-keeper, who also died following a car crash in Australia, just as he would dedicate the 2002 Championship title to Ben.",
        "Once England went behind in the Ashes series, the Hollioakes' selection for the Fifth Test at Trent Bridge was the obvious last throw of the dice. They became the fifth set of brothers to play a Test for England, following the three Graces and the Hearnes in making simultaneous debuts, while Ben, at 19 years 269 days, became England's youngest Test player since Brian Close (18 years 149 days) in 1949.",
        "But Test cricket allowed no quarter, certainly not against Australia in the 1990s. Ben had Greg Blewett caught behind in his eighth over, but his ten overs of springy fast-medium cost 57 runs. Batting at No. 7, he hit a few classy boundaries in his first-innings 28, but Warne had him lbw for two second time round and it was Adam (45 and two), rather than Ben, who kept his place for the consolation victory at The Oval. Perhaps he had that in mind when, accepting the Cricket Writers' Club Young Cricketer of the Year award with a gracious eloquence few of his peers could have emulated, he brought the house down by remarking that this would be one trophy with only one Hollioake name on it. The years of playing catch-up with a sibling six years older had fuelled an affectionate rivalry.",
        "While Adam went to the West Indies that winter, Ben toured Kenya and Sri Lanka with England A. He opened the bowling and his first senior hundreds, 103 and 163 against Sri Lanka A, put him top of the first-class batting averages, yet there would not be another century, first-class or one-day, until he made 118 against Yorkshire in 2001 in his last match at The Oval. The brothers joined forces for the one-day series in the West Indies, when Adam captained England following Atherton's resignation, but Ben's 55 runs and two wickets were not enough to keep him in the team back home, despite useful form in the B&H. Instead, England mixed and matched Matthew Fleming, Mark Ealham, Chris Lewis and Ian Austin in their one-day games against South Africa and Sri Lanka. There was, however, a recall to replace Flintoff for the one-off Test against Sri Lanka at The Oval - where Hollioake was expensive again with the ball and made 14 and a golden duck as Muttiah Muralitharan took 16 wickets - and a place in Stewart's side to Australia that winter. Troubled by a groin injury early on, and never regaining form, he played only two first-class matches and a one-day international. \"To watch him struggling to pinch singles from part-time bowlers in Hobart was painful,\" wrote Wisden's correspondent.",
        "At least Ben was spared the subsequent World Cup débâcle that cost Adam his England place. Instead, his four half-centuries and 20 wickets in 12 games contributed to Surrey's Championship-winning season in 1999. He took five wickets in an innings for the only time in first-class cricket: five for 51 against Glamorgan at The Oval. But next year, while Surrey retained their title and finished top of Division Two in the one-day league, he was dropped in mid-August. His previous nine Championship games had realised just 138 runs and eight wickets. Gone were the days when Ben Hollioake made a complex game look childishly simple; compared with Martin Bicknell and Tudor, his bowling was medium-paced and soft.",
        "However, that golden talent was too bright to be denied, especially as he grafted necessary disciplines to it. One-day runs and wickets early in 2001 brought an England recall for the one-day series, in which his nonchalant 37 against Australia at Bristol and defiant 53 against Pakistan at Headingley, after England had been 39 for five, kindled hopes that those 1997 innings would no longer be an albatross. There was also another Lord's match award, as Surrey dethroned the one-day kings, Gloucestershire, in the Benson and Hedges Cup final, and Ben, down the order this time, helped Adam rebuild their innings with a mature 73.",
        null
    ],
    "recent_matches": [
        {
            "Bat & Bowl": "3*, 0/29",
            "Ground": "Bridgetown",
            "Match Date": "7 Nov 2010",
            "Opposition": "v Ind Masters",
            "Scorecard": "Other T20",
            "Team": "Eng Masters"
        },
        {
            "Bat & Bowl": "0/17",
            "Ground": "Bridgetown",
            "Match Date": "6 Nov 2010",
            "Opposition": "v SL Masters",
            "Scorecard": "Other T20",
            "Team": "Eng Masters"
        },
        {
            "Bat & Bowl": "1/37",
            "Ground": "Bridgetown",
            "Match Date": "5 Nov 2010",
            "Opposition": "v WI Masters",
            "Scorecard": "Other T20",
            "Team": "Eng Masters"
        },
        {
            "Bat & Bowl": "0/33",
            "Ground": "Bridgetown",
            "Match Date": "5 Dec 2009",
            "Opposition": "v SA Masters",
            "Scorecard": "Other T20",
            "Team": "Eng Masters"
        },
        {
            "Bat & Bowl": "1*, 0/33",
            "Ground": "Bridgetown",
            "Match Date": "4 Dec 2009",
            "Opposition": "v SA Masters",
            "Scorecard": "Other T20",
            "Team": "Eng Masters"
        },
        {
            "Bat & Bowl": "1/28",
            "Ground": "Bridgetown",
            "Match Date": "3 Dec 2009",
            "Opposition": "v SL Masters",
            "Scorecard": "Other T20",
            "Team": "Eng Masters"
        },
        {
            "Bat & Bowl": "2/18",
            "Ground": "Bridgetown",
            "Match Date": "30 Nov 2009",
            "Opposition": "v WI Masters",
            "Scorecard": "Other T20",
            "Team": "Eng Masters"
        },
        {
            "Bat & Bowl": "1/20, 5",
            "Ground": "Wormsley",
            "Match Date": "8 Sep 2009",
            "Opposition": "v Aus Masters",
            "Scorecard": "Other T20",
            "Team": "PCA XI"
        },
        {
            "Bat & Bowl": "-",
            "Ground": "London",
            "Match Date": "2 Sep 2009",
            "Opposition": "v World Mast.",
            "Scorecard": "Other T20",
            "Team": "PCA XI"
        },
        {
            "Bat & Bowl": "1",
            "Ground": "Sheffield",
            "Match Date": "23 Jun 2008",
            "Opposition": "v Yorks Acad",
            "Scorecard": "Other OD",
            "Team": "PCA XI"
        }
    ]
}