{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "13.36",
            "Ct": "9",
            "HS": "27",
            "Inns": "14",
            "Mat": "7",
            "NO": "3",
            "Runs": "147",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "21",
            "50": "63",
            "6s": "",
            "Ave": "33.41",
            "Ct": "190",
            "HS": "214",
            "Inns": "382",
            "Mat": "235",
            "NO": "32",
            "Runs": "11696",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "1",
            "5w": "2",
            "Ave": "24.16",
            "BBI": "8/107",
            "BBM": "8/136",
            "Balls": "970",
            "Econ": "3.73",
            "Inns": "11",
            "Mat": "7",
            "Runs": "604",
            "SR": "38.8",
            "Wkts": "25"
        },
        {
            "": "First-class",
            "10": "11",
            "4w": "",
            "5w": "45",
            "Ave": "23.80",
            "BBI": "9/31",
            "BBM": "",
            "Balls": "26559",
            "Econ": "3.38",
            "Inns": "",
            "Mat": "235",
            "Runs": "14972",
            "SR": "42.2",
            "Wkts": "629"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/450087.html",
        "http://www.espncricinfo.com/magazine/content/story/135823.html",
        "http://www.espncricinfo.com/ci/content/story/124923.html",
        "http://www.espncricinfo.com/newzealand/content/story/111903.html",
        "http://www.espncricinfo.com/newzealand/content/story/116686.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=9158"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/042004/052008.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042004/052008.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042004/052008.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nOctober 13, 1877, Bulls Cross, Enfield, Middlesex "
        ],
        "Bowling style": [
            "Legbreak googly"
        ],
        "Died": [
            "October 12, 1936, Wykehurst, Ewhurst, Surrey (aged 58 years 365 days) "
        ],
        "Education": [
            "Eton College: Oxford University"
        ],
        "Full name": [
            "Bernard James Tindal Bosanquet"
        ],
        "Major teams": [
            "England,",
            "Middlesex,",
            "Oxford University"
        ]
    },
    "profile_info": [
        null,
        "But, after all, what is the googly? It is merely a ball with an ordinary break produced by an extra-ordinary method. It is not difficult to detect, and, once detected, there is no reason why it should not be treated as an ordinary break-back. However, it is not for me to defend it. If I appear too much in the role of the proud parent I ask forgiveness.",
        "As to the birth of the  googly, Bosanquet wrote: Somewhere about the year 1897 I was playing a game with a tennis ball, known as `Twisti-Twosti.' The object was to bounce the ball on a table so that your opponent sitting opposite could not catch it... After a little experimenting I managed to pitch the ball which broke in a certain direction; then with more or less the same delivery make the next ball go in the opposite direction! I practised the same thing with a soft ball at `Stump-cricket.' From this I progressed to the cricket ball...",
        "I devoted a great deal of time to practisting the googly at the nets, occasionally in unimportant matches. The first public recognition we obtained was in July, 1900, for Middlesex v. Leicestershire at Lord's. An unfortunate individual (Coe, the left-hander) had made 98 when he was stumped off a fine specimen which bounced four times -- This small beginning marked the start of what came to be termed a revolution in bowling...",
        "The googly (bowled by a right-hand bowler to a right-hand batsman) is nothing more or less that an ordinary off-break. The method of delivery is the secret of its difficulty, and this merely consisted in turning the wrist over at the moment of delivery far enough to alter the axis of spin, so that a ball which normally delivered would break from leg, breaks from the off.",
        "A few incidents stand out vividly. The first time it was bowled against the Australians -- at Lord's late one evening in 1902 -- when I had two overs and saw two very puzzled  Australians return to the pavilion. It rained all next day and not one of them tumbled to the fact that it was not an accident. The first googly ever bowled in Australia, in March 1903; Trumper batting, having made 40 in about twenty minutes. Two leg-breaks were played beautifully to cover, but the next ball (delivered with a silent prayer) pitching in the same place, saw the same graceful stroke played -- and struck the middle stump instead of the bat! W. Gunn stumped when appreciably nearer my wicket than his own! Arthur Shrewsbury complaining that it wasn't fair. There are two or three bright patches I can recall. For instance in 1904 when in three consecutive matches I got five wickets in each innings v. Yorkshire, six in each v.  Nottinghamshire, and seven in each v. Sussex (including Fry and `Ranji').",
        "There was one week in 1905 in which I had eleven wickets v. Sussex at  Lord's (and got 100 in each innings; the double feat is still a record); and during the next three days in the  first Test match at Nottingham I got eight out of nine wickets which fell in the second innings, the last man being out just before a thunderstorm broke -- and even then if Trumper could have hobbled to the wicket it meant a draw! This recalls the fourth Test match at Sydney in March, 1904, in which at one period in the second innings I had six for 12, and then got Noble leg-before and never appealed. The last man was in, and the match won, and there were reasons!",
        "There is a good story of Dick Lilley, the best wicketkeeper in a big match we have known. In the  Gentlemen and Players match at The Oval in 1904 I got a few wickets in the second innings. Then one of the `Pros.' came in and said, `Dick's in next; he's calling us a lot of rabbits; says he can see every ball you bowl. Do try and get him and we'll rag his life out'. Dick came in. I bowled him two overs of leg-breaks then changed my action and bowled another leg-break. Dick played it gracefully to  fine leg and it removed his off stump! I can still hear the reception he got in the dressing room.",
        "In that match  Bosanquet took 8 wickets (6 in the second innings for 60 runs) and scored 145.",
        "These performances, described personally, convey some idea of Bosanquet's ability but scarcely do justice to a splendid all-round cricketer. Quite six feet tall, Bosanquet brought the ball over from a great height so that flight as well as the uncertain break mystified batsmen until a whole side became demoralised. When playing a big innings, Bosanquet in fine upstanding style, put power into his drives and forcing strokes with apparently little effort.",
        "Born on October 13, 1877,  Bosanquet was sent to Eton and profited so much by coaching by Maurice Read and William Brockwell, the famous Surrey professionals, that he got his place in the eleven and against Harrow at Lord's in 1896, scored 120. In his second year at Oxford, 1898, he received his Blue from F. H. E. Cunliffe and played three times against Cambridge without doing anything exceptional. In those days he was a useful bowler, medium to fast, and gradually cultivated the leg-break.",
        "Bosanquet played a lot for Middlesex from  1900 to 1908 and made a few appearances for the county subsequently, but did not bowl after 1908. His great year was 1904 when he made 1,405 runs, with an average of 36 and took 132 wickets for less than 22 runs apiece. Twice he put together two separate hundreds in the same match, 136 and 139 against Leicestershire at Lord's in 1900, and 103 and 100 not out against Sussex at Lord's in 1905. This was the match in which he took eleven wickets.",
        "Among his bowling feats besides those in Test matches were:-- 15 wickets for 65 runs, including nine wickets in one innings, for Oxford against Sussex at Oxford in 1900; 14 wickets for 190 runs for Middlesex against Sussex at Brighton in 1904, and nine wickets in one innings for the M.C.C. against  South Africans at Lord's in 1904.",
        "Bosanquet took part in six different tours, going to America with P. F. Warner's team in 1898, and with K. S. Ranjitsinhji's team in 1899; to New Zealand and Australia with Lord Hawke's team in 1902-03; to Australia with the M.C.C team in 1903-04. He captained sides that went to America in 1901 and to the West Indies in 1901-02.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}