{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "7.93",
            "Ct": "61",
            "HS": "24",
            "Inns": "42",
            "Mat": "28",
            "NO": "13",
            "Runs": "230",
            "St": "12"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "9",
            "6s": "",
            "Ave": "10.88",
            "Ct": "1237",
            "HS": "93",
            "Inns": "835",
            "Mat": "674",
            "NO": "243",
            "Runs": "6445",
            "St": "258"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "28",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "102.00",
            "BBI": "1/9",
            "BBM": "",
            "Balls": "138",
            "Econ": "4.43",
            "Inns": "",
            "Mat": "674",
            "Runs": "102",
            "SR": "138.0",
            "Wkts": "1"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/890395.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155725.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154855.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/99900/99941.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/99900/99941.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/99900/99941.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJanuary 28, 1880, Mitcham, Surrey "
        ],
        "Died": [
            "February 14, 1970, Shoreham-by-Sea, Sussex (aged 90 years 17 days) "
        ],
        "Fielding position": [
            "Wicketkeeper"
        ],
        "Full name": [
            "Herbert Strudwick"
        ],
        "Major teams": [
            "England,",
            "Surrey"
        ],
        "Other": [
            "Umpire"
        ]
    },
    "profile_info": [
        null,
        "Strudwick figured regularly behind the stumps for Surrey for 25 years and, becoming scorer afterwards, served the county altogether for 60 years. He played 28 times for England between 1911 and 1926 during the period when Australia and  South Africa were their only Test match opponents and would doubtless have been chosen more often had he not been contemporary with A. A. Lilley, of Warwickshire, a better batsman. Four times he toured Australia, in 1903-04, 1911-12, 1920-21 and 1924-25 and visited South Africa with M.C.C. in 1909-10 and 1913-14. In addition, he was a frequent member of Players teams against Gentlemen. For  England at Johannesburg in 1913-14, he dismissed seven South African batsmen in the match. His best performance in a single innings was six catches against Sussex at The Oval in 1904 and in a match eight victims (seven caught, one  stumped) against Essex at Leyton in 1904.",
        "No more genuine sportsman, in every sense of the word, than the teetotal, non-smoking Strudwick ever took the field for Surrey. An idol of the Surrey crowd, he was always ready to proffer helpful advice to young players. He never appealed unless sure in his own mind that a batsman was out, and such was his keenness to save runs that he was frequently known to chase a ball to the boundary. Sir H. D. G. Leveson Gower, the former Oxford, Surrey and England captain, once wrote: When you walk on to a certain cricket ground and you find Strudwick behind the wicket, you feel that you will not only get full value for your money, but you will participate in the cheerfulness that his presence always lends to the day.",
        null,
        "It is of interest to note that a lady set Struddy on the path to becoming the world's most celebrated wicketkeeper. As a choir-boy at Mitcham, his birth-place, he took part in matches under the supervision of the daughter of the vicar, a Miss Wilson. Then about 10 years old, Strudwick habitually ran in from cover to the wicket to take returns from the field. Observing how efficiently he did this, Miss Wilson once said:  You ought to be a wicketkeeper. From that point, Strudwick became one.",
        "Not in the ordinary way regarded as much of a batsman, he hit 93 in ninety minutes, easily his largest innings, against Essex at The Oval in 1913, when he and H. S. Harrison shared an eighth-wicket partnership of 134. In the Second Test Match at Melbourne during the Australian tour of J. W. H. T. Douglas's 1920-21 team, he distinguished himself with innings of 21 not out and 24.",
        "Honours bestowed upon Struddy included honorary membership of M.C.C. in 1949 and life membership of Surrey, whose oil-paintings of celebrities in the Long Room at The Oval include one of him.",
        "Tributes to Strudwick included:",
        null,
        null,
        null,
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}