{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "1",
            "6s": "8",
            "Ave": "13.39",
            "Ct": "15",
            "HS": "66",
            "Inns": "38",
            "Mat": "27",
            "NO": "15",
            "Runs": "308",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "4",
            "50": "26",
            "6s": "",
            "Ave": "19.21",
            "Ct": "288",
            "HS": "129",
            "Inns": "525",
            "Mat": "426",
            "NO": "130",
            "Runs": "7590",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "2",
            "4w": "7",
            "5w": "3",
            "Ave": "27.88",
            "BBI": "7/70",
            "BBM": "11/149",
            "Balls": "6360",
            "Econ": "2.57",
            "Inns": "51",
            "Mat": "27",
            "Runs": "2733",
            "SR": "64.8",
            "Wkts": "98"
        },
        {
            "": "First-class",
            "10": "20",
            "4w": "",
            "5w": "84",
            "Ave": "23.08",
            "BBI": "8/30",
            "BBM": "",
            "Balls": "85500",
            "Econ": "2.52",
            "Inns": "",
            "Mat": "426",
            "Runs": "35961",
            "SR": "54.8",
            "Wkts": "1558"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/888219/seven-in-the-shallows",
        "http://www.espncricinfo.com/bodyline/content/story/316843.html",
        "http://www.espncricinfo.com/bodyline/content/story/316838.html",
        "http://www.espncricinfo.com/ci/content/story/316652.html",
        "http://www.espncricinfo.com/bodyline/content/story/316500.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=22192"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/39800/39886.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/39800/39886.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/39800/39886.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nAugust 8, 1909, Annesley Woodhouse, Nottinghamshire "
        ],
        "Bowling style": [
            "Left-arm fast-medium"
        ],
        "Died": [
            "June 6, 1984, Lenton, Nottinghamshire (aged 74 years 303 days) "
        ],
        "Full name": [
            "William Voce"
        ],
        "Major teams": [
            "England,",
            "Nottinghamshire"
        ]
    },
    "profile_info": [
        null,
        "Unfortunately, at this stage of the tour  Voce's back gave out.  Allen was strongly opposed to playing him in the  fourth Test. He reckoned that no fast bowler can give of his best unless he is completely sound, and he hoped by resting  Voce to have him fit to win the  fifth Test. However, he was overruled by his selection committee.  England again lost:  Voce took one  wicket only which cost him 135 runs. Nor was he up to form in the last Test when  Australia, scoring 604, won by an  innings. He took three for 123, giving him a record for the series of 26 wickets at 21.53. During this tour a close and life-long friendship had arisen between  Voce and his captain. Years later he told  Allen that he now reckoned that bodyline had been wrong, but that, from loyalty to his old friend  Larwood, he was not prepared to say anything on the subject to the press. This sidelight on his character helps to explain why he was so widely respected when, after his playing days were over, he coached first at Trent Bridge and later for many years for MCC at Lord's and elsewhere.",
        "After starting work in a colliery when fourteen,  Voce was noticed in local cricket by  Fred Barratt, the  Nottinghamshire fast bowler, and engaged on the county staff in 1926. Success in the Second XI brought him a trial for  Nottinghamshire in June  1927, against  Gloucestershire at  Trent Bridge. He seized it by taking five for 36 and followed this a few weeks later with six for 39 against  Essex. Strong though the county's bowling was, he kept his place for the rest of the season and finished with 37 wickets at 27.18. At this time he was an orthodox slow left-armer, though in the later matches he sometimes lowered his arm slightly and bowled swingers. In  1928 he definitely settled to bowl fast-medium and many felt that  England had lost a great slow left-armer. That may well be true, but it is certain that they had gained a great fast one. After heading the  Nottinghamshire averages in 1929 and having a big part in winning them the Championship, he went that winter with  MCC to the  West Indies and played with considerable success in what were then called Representative matches and have since been canonised as Tests. There was, in fact, simultaneously an  MCC side playing Tests in  New Zealand and the two teams between them contained only five men who played in the Tests against  Australia in  1930. On this tour  Voce bowled mainly fast, but his chief success was in  Trinidad where, moderating his pace to medium on the matting, he took twelve for 110 against the island and eleven for 119 in the Test. In the Tests in  South Africa in the next winter, he took 23 wickets, more than any other bowler on either side, and, after representing  England at home against  New Zealand in  1931 and  India in  1932, he was picked for  Jardine's Australian tour. Despite their success there, neither he nor  Larwood was selected to play against  Australia in  England in  1934 and, as  Jardine himself had refused to be considered, there was much the same indignation in many quarters as in 1984: it was felt that owing to diplomatic considerations  England were fielding something considerably less than their best team. Criticism increased when at  Trent Bridge in August  Voce took eight for 66 against the tourists and was accused of bouncing the ball at them unnecessarily.",
        "Before the 1935 season started both he and  Larwood asked  MCC not to pick them for any of the Tests. However, midway through 1936  Voce again made himself available if wanted, and, picked for the  third Test against  India, bowled well without any luck at all: it was this performance that made him a certainty for the side to  Australia that winter. With that tour, through no fault of his own, his best days ended. In 1937, after playing in the  first Test against  New Zealand, he damaged a knee and had to have a cartilage removed, which finished his cricket for the season. In 1938 he was much troubled by synovitis and his wickets were expensive, and he thus shares with  J. N. Crawford and  D. R. Jardine the distinction of being a great  England cricketer who never appeared against  Australia in a Test in  England. In 1939 he was given a benefit, and modern readers may be surprised to hear that this produced only £980. In 1946 he was 37 and it could hardly be expected that, after six seasons away from serious cricket, he would be the bowler he had been, especially as he was still in the forces and not regularly available. None the less, four for 7 in a Test trial won him a place in the  second Test against  India and also in the side for  Australia in the autumn. The selection was a mistake: the beautiful action remained, the venom had gone, and he now bowled in those whom once he would have bowled out. Moreover his knee still troubled him, and in June 1947 he resigned from the county side. However, appointed their coach, he continued to play occasionally in a crisis till 1952.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}