{
    "batting_averages": [
        {
            "": "Tests",
            "100": "6",
            "50": "13",
            "6s": "9",
            "Ave": "40.00",
            "Ct": "39",
            "HS": "219",
            "Inns": "63",
            "Mat": "39",
            "NO": "2",
            "Runs": "2440",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "86",
            "50": "197",
            "6s": "",
            "Ave": "42.39",
            "Ct": "527",
            "HS": "267*",
            "Inns": "964",
            "Mat": "571",
            "NO": "92",
            "Runs": "36965",
            "St": "1"
        },
        {
            "": "List A",
            "100": "0",
            "50": "0",
            "6s": "",
            "Ave": "12.00",
            "Ct": "1",
            "HS": "36",
            "Inns": "4",
            "Mat": "4",
            "NO": "0",
            "Runs": "48",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "3",
            "5w": "0",
            "Ave": "41.29",
            "BBI": "4/68",
            "BBM": "8/172",
            "Balls": "3234",
            "Econ": "3.14",
            "Inns": "51",
            "Mat": "39",
            "Runs": "1693",
            "SR": "78.8",
            "Wkts": "41"
        },
        {
            "": "First-class",
            "10": "3",
            "4w": "",
            "5w": "11",
            "Ave": "33.31",
            "BBI": "7/48",
            "BBM": "",
            "Balls": "32942",
            "Econ": "2.90",
            "Inns": "",
            "Mat": "571",
            "Runs": "15956",
            "SR": "68.7",
            "Wkts": "479"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "38.00",
            "BBI": "2/76",
            "BBM": "2/76",
            "Balls": "70",
            "Econ": "6.51",
            "Inns": "",
            "Mat": "4",
            "Runs": "76",
            "SR": "35.0",
            "Wkts": "2"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/925349.html",
        "http://www.espncricinfo.com/magazine/content/story/563753.html",
        "http://www.espncricinfo.com/magazine/content/story/393923.html",
        "http://www.espncricinfo.com/magazine/content/story/377353.html",
        "http://www.espncricinfo.com/engvaus/content/story/218981.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=12492"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/112004/055855.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/112004/055855.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/112004/055855.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMarch 26, 1916, Lingwood, Norfolk "
        ],
        "Bowling style": [
            "Right-arm fast"
        ],
        "Died": [
            "April 24, 1986, Whitehill Court, Chesham, Buckinghamshire (aged 70 years 29 days) "
        ],
        "Education": [
            "Bracondale School, Norwich"
        ],
        "Full name": [
            "William John Edrich"
        ],
        "Major teams": [
            "England,",
            "Middlesex,",
            "Norfolk"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        "He came of a Norfolk farming family, which sometimes produced its own XI. Three of his brothers played with some success in first-class cricket and his cousin, John, had later a distinguished  Test match career.  Bill Edrich first appeared for  Norfolk in  1932 at the age of sixteen, and by  1936 had scored 1,886 runs for them in the  Minor Counties Championship alone, not to mention an  innings of 111 against the  1935 South African side. By then he had begun to qualify for  Middlesex, and in  1936 he made three hundreds in first-class cricket for  MCC and came second in the first-class averages with an average of 55. So it was no surprise when next year, in his first full season of first-class cricket, he scored 2,154 runs with an average of 44.87, heading the batting, and was picked for  Lord Tennyson's side in  India. In  1938 he started by making 1,000 runs before the end of May, a target he achieved only with the help of an unexpectedly generous action by  Bradman who, captaining the  Australians against  Middlesex on May 31, made an otherwise meaningless declaration to give him a chance of getting the last 20 runs. After this feat his place in the  England side was secure; so secure that he kept it right through the  series even though failure followed failure and six  innings produced only 67 runs. In the following winter, as a member of the side to  South Africa, his ill luck pursued him, five  innings bringing 21 runs. At last, in the  second innings of the timeless  fifth Test, when  England were set 696 to win, he saved the side by batting 7 hours, 40 minutes for 219. Timeless or not, the match was abandoned when the score stood at 654 for five: the rain came down, everyone had enough, and the Englishmen left to catch their boat.",
        "The sequel to this  innings is perhaps the strangest part of the story. There can surely be no parallel for a batsman failing in eight consecutive Tests and yet keeping his place, but one would at any rate expect that, when he had at last justified the selectors' confidence, he would have retained it. Instead, in  1939, though his average for the season was 49.68, he did not play in a Test against the  West Indians, and in  1946, when Test cricket was resumed after seven years' interval, he had only one match against  India and did not bat in that. Moreover he was only a late choice for the  1946-47 tour of  Australia. Let anyone justify these inconsistencies who can.",
        "During the war Edrich had joined the RAF and had a distinguished career, winning the DFC as a bomber pilot. Up to the war he had played as a professional; after it he became an amateur. Furthermore, until  1938 he had normally opened the  innings. When he played his great innings in  South Africa, he had been moved down the order, and in  1939 Brown and  Robertson established themselves in the  Middlesex side as a great opening  pair. Thenceforward  Edrich's normal place was first wicket. It was in  Australia in  1946-47 that he showed himself indisputably a Test player. His batting in the  first Test has been mentioned. In the second he scored 71 and 119 and made a gallant attempt to stave off an  innings defeat. He followed this with 89 in the  third Test and 60 in the fifth.",
        null,
        "In  1948, in the disastrous  series against  Australia, his sole notable contribution was 111 in the  fourth Test at  Leeds, but next year against  New Zealand he averaged 54 with only one century. In  1950 he contributed a typically gallant 71 in the  second innings of the  first Test at  Manchester, but at  Lord's in the second he failed abjectly in each  innings. His scores were 8 and 8: it would have been better for his reputation if he had taken two first balls. Each time he stayed long enough to make it clear that he was completely out of his depth with  Ramadhin and  Valentine. Nothing worse for the morale of the younger members of the side can be imagined. Inevitably he was dropped for the two remaining Tests, but for  Middlesex he scored much as usual and it was a great surprise when he was omitted from the team for  Australia at the end of the season. The  Australians themselves were astonished, and when the side proved to be incontestably the worst batting one  England had ever sent out, and all the new choices were failures, there were those who thought that his courage and experience might have turned the scale in a series which was closer than the results indicated. No reasons were given at the time for his omission, but in fact an ill-advised late-night party during the  first Test against  West Indies, followed by his calamitous showing in the second, had convinced the selectors, and not least the captain elect, that the team would be better without him. By a generous gesture  Edrich himself was at the station to see the team off and to wish them well.",
        "Although few could have foreseen it at the time, this was the beginning of the end for  Edrich. Never again was he to be the force in Tests that he had been. Recalled as  Hutton's opening partner for the last three Tests against  Australia in  1953, he made 64 at  Leeds and was 55 not out when the Ashes were regained at  The Oval after a period of eighteen years. But he did not do much in his one Test against  Pakistan in  1954, and although at the end of that summer he was picked for  Australia, only a fighting 88 in the  second innings of the  first Test showed what he could once do. That was the end of his career for  England. For  Middlesex he still made runs, if not on the scale of his great years. In  1951 and  1952 he shared the captaincy with  Compton: this, like most such diarchies, was not a success. From  1953, he was sole captain, a position in which he certainly could not be blamed for lack of enterprise. At last in 1957, though he got his 1,000 runs, for the fifteenth time his average dropped to 22.92 and he felt it was time to resign. Next year he played in about half the matches with only moderate results, and at the end of the season he accepted the captaincy of Norfolk, for whom he continued to score runs and to take wickets with slow off-breaks until 1972.",
        "When his first-class career ended he was 42, an age at which many great batsmen have still been batting with almost undiminished powers. However, Edrich had always relied rather on his natural gifts, his wonderful eye, his physical strength and courage than on a studiously sound technique. Granted that he was always well behind the ball when playing a fast bowler, he had a markedly right-handed grip and his best strokes were the  cut, the  hook and the pulled drive. His bat did not have that pendulum-like swing up and down the line which is the foundation of real soundness. Still, he had done enough for the fame and had given much pleasure to many thousands of spectators.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}