{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "4.66",
            "Ct": "2",
            "HS": "10*",
            "Inns": "11",
            "Mat": "15",
            "NO": "5",
            "Runs": "28",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "0",
            "6s": "",
            "Ave": "8.60",
            "Ct": "138",
            "HS": "43*",
            "Inns": "326",
            "Mat": "372",
            "NO": "148",
            "Runs": "1531",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "2",
            "5w": "6",
            "Ave": "22.33",
            "BBI": "6/33",
            "BBM": "9/219",
            "Balls": "3655",
            "Econ": "2.49",
            "Inns": "29",
            "Mat": "15",
            "Runs": "1519",
            "SR": "53.7",
            "Wkts": "68"
        },
        {
            "": "First-class",
            "10": "27",
            "4w": "",
            "5w": "116",
            "Ave": "16.76",
            "BBI": "9/121",
            "BBM": "",
            "Balls": "74457",
            "Econ": "2.21",
            "Inns": "",
            "Mat": "372",
            "Runs": "27470",
            "SR": "45.4",
            "Wkts": "1639"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/bodyline/content/story/316843.html",
        "http://www.espncricinfo.com/bodyline/content/story/316838.html",
        "http://www.espncricinfo.com/ci/content/story/316652.html",
        "http://www.espncricinfo.com/bodyline/content/story/316500.html",
        "http://www.espncricinfo.com/bodyline/content/story/316173.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=9181"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/24900/24996.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/24900/24996.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/24900/24996.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJuly 25, 1908, Elland, Yorkshire "
        ],
        "Bowling style": [
            "Right-arm fast-medium, Right-arm medium"
        ],
        "Died": [
            "September 4, 1987, Otley, Yorkshire (aged 79 years 41 days) "
        ],
        "Full name": [
            "William Eric Bowes"
        ],
        "Height": [
            "\n6 ft 3 in "
        ],
        "Major teams": [
            "England,",
            "Yorkshire"
        ]
    },
    "profile_info": [
        null,
        "No man has ever worked harder at his art. He was constantly practising, constantly experimenting, but throughout he remained content with the ten yards to which that great coach, Walter Brearley, had cut his run when he first went to Lord's. He concentrated on control of length and direction and on moving the ball. He could always bowl a late in-swinger, but Brearley told him that he would never reach the top class unless he could make the ball run away as well. This it would occasionally do by a fluke, as at the Scarborough Festival in 1929, for example. George Hirst was persuaded to play and Bowes bowled him with one that pitched on the leg stump and took the off bail. Hirst, typically, said: Well bowled. That would have been too good for me when I was good. Yet by the middle of 1931, after three years of trying, Bowes was no nearer to discovering how to produce this ball. Meanwhile he was already on the fringe of the England side. Most men in this position would have been satisfied, and concluded that away-swingers were not for them. Not so Bowes; he went on trying and finally found the required hint in an obscure coaching manual, which told him it was all in the position of the feet at the moment of delivery. Within a week or two he was bowling away-swingers as easily as in-swingers, with a barely perceptible change of action. Thenceforward the batsman who had successfully cut two or three in-swingers, and tried to repeat the stroke, was liable to find that he had picked the wrong ball and to chop it into his stumps. That season his wickets cost him 4 runs apiece fewer than in 1930.",
        " Yorkshire had in those days no nursery; players were picked from the nets and graduated through the Second XI. Bowes, wanting a secure tenure, applied with typical enterprise, and with the approval of the county authorities, for a place on the groundstaff at Lord's. He was taken on for 1928, and in his first first-class match for MCC he took five for 69 against Wales; in his second, against Cambridge, he did the hat-trick. Naturally Yorkshire became interested, and after some complex negotiations it was agreed that, while his contract with MCC should stand, he should be released to play for Yorkshire unless MCC required him for a first-class match. As a result he played a few times for the county in 1929 and did enough to show his possibilities, his figures for all first-class matches being 65 wickets at 19 each. In 1930, after several successful matches for Yorkshire, culminating in eight for 69 against Middlesex at Sheffield, he received his county cap. From then on, though his contract with MCC did not end till 1937, they claimed his services only on special occasions and he was a regular member of the county side.",
        "There can be no doubt that his engagement at Lord's had been an advantage to him. Not only had he received much admirable advice and coaching, but he had been carefully nursed and saved from the grind of bowling six days a week in county cricket before he was strong enough, something which has ruined so many promising bowlers. Now that he was a recognised member of the Yorkshire side, he was taken in hand by the senior professionals and taught his trade with a thoroughness which does much to explain why for so many years the county was by and large the most formidable in the Championship. Night after night he and Verity, who started at the same time, were taken up to a hotel bedroom and the day's cricket was discussed, the field set out on the bed with toothbrushes, shaving tackle and the like, and praise and blame administered impartially as required. At one of the first of these sessions Verity, who had accomplished his biggest performance to date, seven for 26 against Hampshire, was greeted with, Seven for 26 and it ought to have been seven for 22! I never saw such bowling. Whatever wast thou doing to give A. K. Judd that four? There is precedent for this attitude. In 1918 Eton dismissed Charterhouse for 13. That great man, C. M. Wells, for many years in charge of Eton cricket, entered the dressing-room with the words, Should have been 9. But however outspoken the Yorkshire professionals were about anything of which they disapproved, there was no lack of praise either. Who could fail to learn in such an atmosphere? There can never have been a greater cricket school than the Yorkshire sides between the wars or two apter pupils than Bowes and Verity. And strong though Yorkshire were in every department, it was the bowling of these two more than anything else that won them their Championships in the 1930s.",
        "There has probably never been a great cricketer who looked less like one than Bowes. Standing 6ft 4in, he was clumsily built and a poor mover. Wearing strong spectacles, he looked far more like a university professor, and indeed batted and fielded like one. However, no side has been so closely welded as Yorkshire in the 1920s and 1930s: every man knew just what he was expected to do and did it without being told. When Bowes suggested that it might be a good thing if he were taught the rudiments of batting, he was told firmly that his job was to take wickets; he was not to waste his valuable strength on making runs. If he ever showed signs of forgetting this, his partners were expected to run him out. Similarly in the field. He was stationed at mid-on and, if the ball came to him, he was to catch it or stop it as the case might be. But if it passed him, he was not to move; it was someone else's duty to chase it and throw it in. This was fully understood on the Yorkshire side. After all, Bowes was their great opener and they had no alternative to him.",
        "But England had Larwood (and later Farnes), Voce and Allen, all faster than Bowes and all but Farnes far better bats and fields. Besides them there was always Hammond, a much better bowler than was generally realised, to open if required. In those days three quick bowlers were usually regarded as ample; a place had to be kept for a slow left-arm bowler and a leg-spinner, if a good enough one could be found. So it is not surprising that selectors often passed Bowes over. Tests against Australia then stood on a footing of their own. Between 1932 and 1939, England played twenty Tests against Australia and Bowes was picked for six only; but as in these he took, in an era of mammoth scoring, 30 wickets at 24.70, it was clear that he was in no way out of his class. Yet even for the 1932-33 tour of Australia, his one tour abroad, he received his invitation only three days before the team sailed, having forced himself into the side by some superb bowling in the last weeks of the season.",
        "One wicket on that tour in particular is remembered and deserves description. At Melbourne in the Second Test, Bradman, who had missed the First Test, came in to such tumultuous applause that Bowes had to stop in the middle of his run for it to subside, and to fill in time he moved mid-on to silly mid-on. Again he started, again he had to stop, and this time he moved his deep fine leg. He noticed that Bradman followed these moves with grave attention, and he felt sure that he expected a bouncer. So he ran up with his most threatening expression, but instead of digging the ball in he deliberately bowled one little more than stump high. Bradman, already halfway in position to hook, had suddenly to alter his stroke and in so doing pulled the ball into his wicket. In other words, a great piece of bowling. In fact, although with his height Bowes naturally had a steeper rise than most bowlers, and was always prepared to bowl a bouncer, he did not rely on it as a regular form of attack and, as he gained in experience, used it less and less. His use of the bouncer has probably been exaggerated by a famous incident at The Oval is 1932, a month or so before the start of this tour, when he bounced some at Hobbs. On that occasion, as far as the two protagonists were concerned there was no lasting ill feeling, though Hobbs never approved of the bodyline tactics.",
        null,
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}