{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "1",
            "6s": "0",
            "Ave": "17.76",
            "Ct": "4",
            "HS": "52*",
            "Inns": "16",
            "Mat": "12",
            "NO": "3",
            "Runs": "231",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "15",
            "50": "48",
            "6s": "",
            "Ave": "21.96",
            "Ct": "140",
            "HS": "165",
            "Inns": "531",
            "Mat": "363",
            "NO": "45",
            "Runs": "10673",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "1",
            "4w": "2",
            "5w": "5",
            "Ave": "20.53",
            "BBI": "7/71",
            "BBM": "11/76",
            "Balls": "1973",
            "Econ": "2.68",
            "Inns": "18",
            "Mat": "12",
            "Runs": "883",
            "SR": "45.8",
            "Wkts": "43"
        },
        {
            "": "First-class",
            "10": "29",
            "4w": "",
            "5w": "121",
            "Ave": "18.34",
            "BBI": "9/59",
            "BBM": "",
            "Balls": "52121",
            "Econ": "2.90",
            "Inns": "",
            "Mat": "363",
            "Runs": "25246",
            "SR": "37.8",
            "Wkts": "1376"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/engvaus/content/story/215631.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155651.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154844.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/67500/67594.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/67500/67594.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMarch 25, 1868, Old Radford, Nottinghamshire "
        ],
        "Bowling style": [
            "Right-arm fast"
        ],
        "Died": [
            "April 26, 1932, Old Radford, Nottinghamshire (aged 64 years 32 days) "
        ],
        "Full name": [
            "William Henry Lockwood"
        ],
        "Major teams": [
            "England,",
            "Nottinghamshire,",
            "Surrey"
        ]
    },
    "profile_info": [
        "\nA difficult, troubled and awkward character, Bill Lockwood struggled with his demons throughout his career, but at his best was a magnificent fast-medium bowler. Unable to gain a place for his native Nottinghamshire, he moved to Surrey, where he learnt much from George Lohmann. By the early 1890s he was one of the finest bowlers in England, bowling at a brisk fast medium, with a high action and pronounced body swing, and clever variation of pace. His specialty was the break-back, often pitching outside off but pounding into the batsman's thigh or passing over leg stump. He also generated speed off the pitch (or appeared to do so), and had a slower ball \"of almost sinful deceit\". A good bat, with 15 first-class hundreds, he tended to ignore his batting in favour of bowling, but did enough to be classed as a genuine allrounder, averaging 21.9 in first-class cricket. \n",
        "Albert Knight, his contemporary, wrote of him \"Lockwood would break back and nip a piece of one's thigh away, looking at one the while and wondering why the blind gods should waste such a delivery on mere flesh\"",
        "His career started a downslide with a disastrous tour of Australia in 1894-95, where he performed poorly on the field, and was accident prone off it, injuring a shoulder, nearly drowning, and severely cutting a hand when a soda syphon exploded. His miseries were compounded on his return when in a short period both his wife and one of his children died, and he turned to drink. His form suffered badly, and by 1897 he was out of the Surrey side. Surrey persuaded him to pledge temperance and he made a remarkable recovery, taking 134 wickets in 1898, and returning to the Test team, playing until the amazing 5th Test in 1902, where, amongst the legendary exploits of Jessop. Hirst, and Rhodes his five second-innings wickets are nearly forgotten. He had a brief reacquaintance with his drinking problems in 1901, when again he lost form after his action was questioned, and his benefit was completely rained out. Careful handling by Surrey took him through to his retirement in 1904. He returned to his native Nottinghamshire, and was a common sight at Trent Bridge in his retirement.",
        null,
        "Not until two years later did he make his mark as a bowler, his great performance that summer being eleven wickets for 40 runs against Kent at the Oval, but in 1892 when Surrey had George Lohmann and Tom Richardson as well as Lockwood, the last-named headed the averages for all matches, taking 168 wickets for less than twelve and a half runs apiece. Lockwood continued a great bowler during the next two seasons but, going out to Australia in 1894-95, he failed deplorably and, on his return home, went down the hill so steadily that in 1897 he lost his place in the Surrey team.",
        "Happily in the ensuing winter he was at great pains to get himself fit, and in 1898 obtained 134 wickets and scored nearly a thousand runs in first-class matches. He remained a splendid bowler for several years after this, but finally dropped out of the Surrey team in 1904.",
        "In 1902 he appeared for England against Australia in four of the five Test matches, and in the contest at Manchester, securing eleven wickets for 76 runs, accomplished one of the greatest bowling performances ever witnessed. To begin with, the pitch proved so soft that not until the score reached 129 was Lockwood given a trial but still, in an innings of 299, he disposed of six batsmen for 48, the last five wickets falling for 43 runs. In Australia's second innings Lockwood got rid of Trumper, Hill and Duff while the score was reaching 10. Fred Tate, at deep square leg, missing Darling off Braund the fourth wicket, which should have gone down at 16, did not fall until 64. For all that Lockwood dominated the game, taking five wickets for 28 and the tourists were all out for 86. England had only 124 to make but a night's heavy rain placed batsmen at a big disadvantage and Australia, despite Lockwood's magnificent work, won by three runs.",
        " Lockwood took no such long run as his famous colleague, Tom Richardson, and did not appear quite so fast through the air, but when he was at the top of his form, no one ever came off the pitch much faster than he or--with his off-break also a distinguishing quality of his bowling--was more difficult to play under conditions favourable to batting. He had, too, at his command a slow ball which in his early days he sent down without any perceptible change of delivery. After he came back in 1898 he did not bowl this ball quite as well as before but it was still a very useful part of his equipment.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}