{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "4",
            "50": "0",
            "6s": "0",
            "Ave": "17.00",
            "Ct": "4",
            "HS": "19*",
            "Inns": "9",
            "Mat": "9",
            "NO": "6",
            "Runs": "51",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "4s": "",
            "50": "1",
            "6s": "",
            "Ave": "8.52",
            "Ct": "80",
            "HS": "63",
            "Inns": "145",
            "Mat": "152",
            "NO": "54",
            "Runs": "776",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "1",
            "5w": "1",
            "Ave": "17.87",
            "BBI": "5/51",
            "BBM": "7/45",
            "Balls": "1596",
            "Econ": "2.08",
            "Inns": "17",
            "Mat": "9",
            "Runs": "554",
            "SR": "51.4",
            "Wkts": "31"
        },
        {
            "": "First-class",
            "10": "17",
            "4w": "",
            "5w": "57",
            "Ave": "15.48",
            "BBI": "8/76",
            "BBM": "",
            "Balls": "29980",
            "Econ": "2.19",
            "Inns": "",
            "Mat": "152",
            "Runs": "10965",
            "SR": "42.3",
            "Wkts": "708"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/1046563.html",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/940809/we-re-such-jolly-good-fellows",
        "http://www.espncricinfo.com/england/content/story/851429.html",
        "http://www.espncricinfo.com/england/content/story/851407.html",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/837473/26-all-out",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=8554"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/122004/056861.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/122004/056861.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/122004/056861.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJune 27, 1924, Wibsey, Bradford, Yorkshire "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "March 17, 2015, Harrogate (aged 90 years 263 days) "
        ],
        "Full name": [
            "Robert Appleyard"
        ],
        "Major teams": [
            "England,",
            "Yorkshire"
        ]
    },
    "profile_info": [
        "\nThere are few tales as remarkable as that of Bob Appleyard's brief first-class career which did not start until he was 27. An offspinner who bowled at close to medium pace, with a deceptive dipping flight, and great accuracy, he was devasting on a wet wicket, and economical on batsman's pitches.  \n",
        "When he was seven his mother left home; when he was 13 he lost his younger sister Margaret to diphtheria and when he was 15 his father, stepmother and two little sisters were found gassed in the bathroom of their home.  The young Appleyard was taken in by his stepmother's parents who were devout Christians. He did not turn away from religion but embraced it and has worshipped regularly ever since.  The war years held back his development but when he decided to join the Bradford League and went for nets at Bowling Old Lane he immediately caught the eye of club president Ernest Holdsworth, a former captain of Yorkshire 2nds. ",
        "His Yorkshire debut came in 1950 when he played in three matches and took 11 wickets but there was little indication of what was to happen the following season when he took 200 wickets (the only man to do so in his first campaign).  ",
        "A deep-thinking cricketer, Appleyard could already bowl pace or off-spin but the addition of leg-cutters and off-cutters made him as lethal as he was unique.  In the middle of that season he fell ill for a short while and was treated for pleurisy but the following spring, after only one match, he was diagnosed with tuberculosis. He was not expected to live, let alone play cricket, but he bounced with 154 wickets in 1954 and an England call-up. He took 5 for 51 on debut, and 31 wickets at 17.87 in his nine Tests. A change in the lbw law and a chronic shoulder injury drastically reduced his effectiveness, and he quit in 1958, after only five full seasons.",
        "Appleyard became a successful business rep and he was working for the British Printing Corporation in 1981 when it was taken over by Robert Maxwell. Appleyard quickly saw Maxwell for the crook that he was and when Maxwell dismissed him on the strength of trumped up allegations, Appleyard battled for a fair settlement and won, shrewdly taking his money out of the BPC pension fund at the same time!  The death from leukaemia of his young son, Ian, and later the death of a grandson, John, from the same disease, have kept grief a regular visitor to Appleyard's door but always he has battled on, fighting to bring Yorkshire back to Bradford Park Avenue for a while and being largely responsible for setting up the Yorkshire Academy on the ground as well. ",
        null
    ],
    "recent_matches": [
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}