{
    "batting_averages": [
        {
            "": "Tests",
            "100": "2",
            "50": "12",
            "6s": "6",
            "Ave": "31.70",
            "Ct": "16",
            "HS": "149",
            "Inns": "64",
            "Mat": "40",
            "NO": "6",
            "Runs": "1839",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "85",
            "50": "207",
            "6s": "",
            "Ave": "40.04",
            "Ct": "416",
            "HS": "232",
            "Inns": "1141",
            "Mat": "739",
            "NO": "157",
            "Runs": "39405",
            "St": "1"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "35.66",
            "BBI": "3/4",
            "BBM": "3/35",
            "Balls": "1395",
            "Econ": "2.76",
            "Inns": "36",
            "Mat": "40",
            "Runs": "642",
            "SR": "77.5",
            "Wkts": "18"
        },
        {
            "": "First-class",
            "10": "2",
            "4w": "",
            "5w": "31",
            "Ave": "32.84",
            "BBI": "7/43",
            "BBM": "",
            "Balls": "59265",
            "Econ": "2.99",
            "Inns": "",
            "Mat": "739",
            "Runs": "29597",
            "SR": "65.7",
            "Wkts": "901"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/888219/seven-in-the-shallows",
        "http://www.espncricinfo.com/magazine/content/story/321928.html",
        "http://www.espncricinfo.com/bodyline/content/story/316843.html",
        "http://www.espncricinfo.com/bodyline/content/story/316838.html",
        "http://www.espncricinfo.com/ci/content/story/316652.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=22545"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/210300/210357.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/210300/210357.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/210300/210357.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMay 2, 1901, Milford Heath House, Surrey "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "April 20, 1995, Truro, Cornwall (aged 93 years 353 days) "
        ],
        "Education": [
            "King Henry VIII School, Coventry"
        ],
        "Full name": [
            "Robert Elliott Storey Wyatt"
        ],
        "Major teams": [
            "England,",
            "Warwickshire,",
            "Worcestershire"
        ]
    },
    "profile_info": [
        "\nHe was a serious man, renowned for his bravery and for his devotion to theory. He never courted popularity, but revered loyalty. And in the end he became famous all over again for being very old. \n",
        "When Bob Wyatt died on April 20, he was 93, England's senior Test player. The mantle passes to little Derbyshire legspinner Tommy Mitchell (born Sept 4, 1902), which in itself is a somewhat amusing irony, for Wyatt's handling of him in the Ashes series of 1934 prompted Mitchell to explode, `You couldn't captain a box of lead soldiers!'",
        " Wyatt was never going to be as `popular' with his players as a Percy Chapman, whom he succeeded as England captain for the final Test against Australia at The Oval in 1930. His substitution for the flamboyant Kent left-hander set him up as the unwitting target of some caustic Press reaction and poison-pen letters, even death threats. He went in at No. 7 to face the wily Grimmett, his side 197 for 5, and made a doughty 64 in England's eventual 405. But Bradman then scored 232, Ponsford 110, and Australia made 695 and went on to win by an innings.",
        "It was the first of 16 Tests in which Wyatt led his country. Three were won, eight drawn, and five lost, but two of the successes were conspicuous: the innings victory over Australia in 1934, in which Hedley Verity's 15 for 104 on a damp pitch was instrumental, remains the only win at Lord's this century against the Oldest Enemy, while the bizarre victory over West Indies at Bridgetown in conditions almost impossible for batting was to be the last inflicted there on the home side for 59 years.",
        " Robert Elliott Storey Wyatt was born in Milford, Surrey on may 2, 1901 and educated at King Henry VIII School, Coventry. An amateur cricketer throughout, he gained employment variously in insurance, engineering and with Warwickshire CCC, a club for which he made his debut in 1923. Working his way up the batting order, and bowling medium-pace, he was to make almost 22,000 runs for Warwickshire (51 centuries) and take over 650 wickets by the time of his last match for the county, in 1939. He had succeeded Freddie Calthorpe as captain in 1930 and weathered a conspiracy or two before being ousted after the 1937 season, Peter Cranmer being installed. A man of firm ideas, Wyatt had become embroiled in personal conflicts in dressing-room as well as committee-room.",
        "It so happened that in 1937, his last in charge at Edgbaston, he recorded his two double-centuries, both at that ground: 232 against Derbyshire, when he had a stand of 253 with Tom Dollery, and 201 not out, which also took about seven hours, against Lancashire, the Wyatt/ Dollery partnership this time stretching to 319. Both innings came in the month of July, his career of 40 Tests having closed at Melbourne earlier that year.",
        null,
        " Bob Wyatt's strength of character was never in question, and nor was his bravery. Time and again he sustained serious injury and was back before the doctors wanted or expected. He played against Australia in 1934 with a metal shield on his broken right thumb, and missed the first half of the 1936-37 tour of Australia after his forearm was fractured. Most renowned of his accidents, however, was the broken jaw at Sabina Park, Jamaica in March 1935.",
        "A month earlier, having endured a severe blow over the heart of Ken Farnes during net practice and then gone down with influenza, Wyatt was given a tiny model of a coffin by a local `fan'. In it was an exquisitely-carved corpse with a photo of Wyatt pasted on the head. `This is what Martindale do to you!' said the `cricket-lover'. It was eerily prophetic.",
        "Martindale's bouncer broke Wyatt's jaw in four places, the impact noisy, the result messy. But as soon as he regained consciousness on a stretcher in the dressing-room, Wyatt signalled for a pencil and wrote out an amended batting order. From hospital he sent a note to the West Indian bowler clearing him of all blame.",
        "Was his nerve affected? Hardly: six weeks later he scored a century against Surrey (rampant Alf Gover and all) in his first match back - though he had to survive first a colliding lorry in Earls Court - and made another against Gloucestershire. He was ready to continue captaining England against South Africa.",
        "As a batsman he was inevitably classified as `dour', and was unquestionably an `academic', constantly thinking cricket, exploring and discussing theory. But when responsibility slackened, such as in the festival matches at Scarborough, he could be a joy to watch. Even at 50 the strength was there, as when a six was needed off the final ball of a Championship match at Taunton, and Wyatt duly drove Bertie Buse high into the pavilion.",
        "`There's a nonsensical doctrine today,' he once said, `that you're only attacking if you're on the front foot. But look at the runs Bradman and Hammond scored off the back foot. You can't pretend they weren't attacking batsmen.' And for 60 years he deplored the amendment to the lbw law that allowed batsmen to be given out to balls pitching outside off stump. This diminished back-foot play as batsmen became wary of the much-increased deployment of offspin and inswing bowling. Wyatt always insisted that a widening of the wicket would have been sufficient to restore balance between bat and ball, and he also believed in leaving the pitch uncovered. Nor did he ever pretend to be tolerant of limited-overs cricket, with all its artificiality.",
        "He toured the world: India, Burma and Ceylon with MCC in 1926-27 (claiming a hat-trick and a century in one match in Ceylon); South Africa (twice), where his first Test innings, on matting at the old Wanderers ground, Johannesburg, lasted one ball; West Indies (twice), where his first tour, 1929-30, was marked by a partnership of 148 with Andy Sandham which helped the Surrey batsman on his way, at Sabina Park, to the first triple-century in Test history; Australia and New Zealand (twice); South America, with Sir Theodore Brinckman's team in 1937-38; Egypt (twice) with Martineau's team: and he would have gone to India again in 1939-40 had the outbreak of war not rendered the tour impossible.",
        "His mark in Test cricket will probably be most prominent in respect of England's 1932-33 tour of Australia, when he was vice-captain to Douglas Jardine. The bouncer attack on the line of the body (`Bodyline') of the Australian batsmen by Harold Larwood and Bill Voce caused lasting bitterness between the two nations and many of the central figures, but Wyatt saw his skipper as a `kind' man of `tremendous charm', conceding only that after having taken such a dislike to Australians on the previous tour ( 1928-29), it might have been unwise for Jardine to have returned.",
        "In fact, Wyatt was the first to set the concentrated leg-side field. With Jardine on fishing holiday in Tasmania, he led MCC against An Australian XI at the MCG, and set what he saw purely as a ` leg-theory' field for Larwood once the ball had lost its shine. The rest is history, with no scarcity of documentation.",
        "One morsel of amusement, though, did reveal Wyatt's sense of mischief and humour. After Bradman played on to Bowes first ball at Melbourne in the Second Test, Wyatt reacted to the Australian barrackers quite differently to Jardine. As wickets continued to fall, he turned to them at intervals and asked, in that clipped tone of his, `When's your Don coming in then?'",
        "Over 60 years later, in his tribute to Bob Wyatt, Sir Donald could not be faulted in his verdict: that he was `a very good batsman, pedestrian rather than exciting; he lived by the rulebook.'",
        "In his 40 Tests, Wyatt scored 1839 runs at 31.71, his two centuries coming against South Africa, 113 at Old Trafford in 1929 in his maiden home Test, when he and Frank Woolley put on 245 in 165 minutes, and 149 at Trent Bridge in 1935, a drawn match preceding the historic Lord's Test when Wyatt led England to their first defeat by South Africa on English soil.",
        "He took 18 Test wickets at 35.67 and held 16 catches.",
        "In all first-class cricket he ranks No. 19 with 39,405 runs from his 1141 innings, his average a highly respectable 40.05. Of his 85 centuries, 11 tellingly came off the taxing Yorkshire bowling. Seventeen times, and once abroad, he reached 1000 runs in a season, five times passing 2000, with 2630 (53.67) in 1929 as his most prolific summer. His stand of 228 with Arthur Croom at Dudley in 1925 remains a Warwickshire eighth-wicket record.",
        "His medium-pace and offspin brought him 901 wickets at 32.85, his best figures coming at Lord's, 7 for 43 against Middlesex, in 1926, the year he came closest to the double (1485 runs/92 wickets). He held 415 catches and once made a stumping.",
        " Wyatt played in 23 matches for the Gentlemen against the Players between 1926 and 1947, and in 1934 he struck 104 not out at Lord's, once hitting Verity for six, as his Gentlemen XI raced to victory, launched by an opening stand of 160 in 90 minutes by Wyatt and the stylish Cyril Walters.",
        null,
        "He never lost touch with the game. In 1989, the year his 1929-30 MCC tour blazer was discovered on a rubbish tip and returned to him, he defied the pain and inconvenience of hip disability to journey to South Africa for the Test centenary celebrations.",
        null,
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}