{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "3",
            "6s": "0",
            "Ave": "14.72",
            "Ct": "17",
            "HS": "83",
            "Inns": "33",
            "Mat": "20",
            "NO": "4",
            "Runs": "427",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "7",
            "50": "49",
            "6s": "",
            "Ave": "19.44",
            "Ct": "214",
            "HS": "210*",
            "Inns": "693",
            "Mat": "436",
            "NO": "66",
            "Runs": "12191",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "1",
            "4w": "8",
            "5w": "5",
            "Ave": "16.98",
            "BBI": "7/31",
            "BBM": "11/68",
            "Balls": "5216",
            "Econ": "1.97",
            "Inns": "35",
            "Mat": "20",
            "Runs": "1715",
            "SR": "51.6",
            "Wkts": "101"
        },
        {
            "": "First-class",
            "10": "33",
            "4w": "",
            "5w": "123",
            "Ave": "16.20",
            "BBI": "9/22",
            "BBM": "",
            "Balls": "88683",
            "Econ": "1.94",
            "Inns": "",
            "Mat": "436",
            "Runs": "28758",
            "SR": "49.9",
            "Wkts": "1775"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/blogs/content/story/909033.html",
        "http://www.espncricinfo.com/magazine/content/story/271450.html",
        "http://www.espncricinfo.com/magazine/content/story/242365.html",
        "http://www.espncricinfo.com/engvaus/content/story/215631.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155680.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=18489"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/219800/219877.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/219800/219877.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/219800/219877.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nFebruary 12, 1857, Churwell, Leeds, Yorkshire "
        ],
        "Bowling style": [
            "Slow left-arm orthodox"
        ],
        "Died": [
            "August 12, 1941, Morley, Leeds, Yorkshire (aged 84 years 181 days) "
        ],
        "Full name": [
            "Robert Peel"
        ],
        "Major teams": [
            "England,",
            "Yorkshire"
        ]
    },
    "profile_info": [
        null,
        "He did some remarkable things in Test matches with Australia, against whom he played for England twenty times. At Sydney in  1894, Australia set to get 177, hit off 113 of the runs for the loss of two wickets before stumps were drawn on the fifth day. The result then appeared a foregone conclusion, but strong sunshine followed heavy rain during the night.  Peel slept through the storm. Astounded when he saw the drying pitch, he said to the English captain, Mr. Stoddart, gie me t' ball, and with Johnny Briggs, the Lancashire left-hander, also at his best, the remaining eight batsmen were disposed of for 53 runs. So England gained an extraordinary win by 10 runs after facing a total of 586, then a record for these Tests, the previous being Australia's 551 at The Oval in 1884. Peel's analysis in the fourth innings was six for 67. Peel also enjoyed a large share in winning the rubber match of that tour. He took seven wickets, scored 73 in a stand for 152 with A. C. MacLaren, and following a grand partnership for 210 by Albert Ward, of Lancashire, and J. T. Brown, of Yorkshire, the two best scorers of England's first innings hit off the runs, the victorious total being 298 for four wickets. In 1896 at Kennington Oval, with conditions very difficult for batsmen, he and J. T. Hearne got rid of Australia for 44. Peel's share in the victory by 66 runs was eight wickets for 53 runs, and his last innings analysis six wickets in 12 overs for 23 runs -- some revenge for getting a pair. Hearne's figures showed ten wickets for 60. That was the last match in which W. G. Grace led England to success over Australia.",
        "Besides his great achievements as a bowler, Peel scored over 11,000 runs for Yorkshire, hitting two centuries. His highest innings was 226 not out against Leicestershire in 1892, and four years later he obtained 210 not out in a Yorkshire score of 887 against Warwickshire at Edgbaston, a total which remains a county match record. Peel and Lord Hawke, who added 292 for the eighth wicket, F. S. Jackson and E. Wainwright all reached three figures in that innings -- then a record, four centuries in an innings. In 1889, the year in which the over was increased from four balls to five,  Peel put together 158 in the Yorkshire second innings at  Lord's, but yet was on the losing side, a brilliant 100 not out in eighty minutes by T. C. O'Brien taking Middlesex to victory by four wickets with ten minutes to spare. Yielding 1,295 runs for thirty-six wickets, the game produced a record aggregate for a match in England at the time.",
        " Peel went four times to Australia, in 1884-85, 1887-88, 1891-92 and 1894-95, and in Test matches with Australia he took 102 wickets for less than 17 runs each. He also figured in Players teams against the Gentlemen from 1887 to 1897, taking in those games 48 wickets at a cost of 16 runs apiece.",
        null,
        null
    ],
    "recent_matches": [
        {},
        {}
    ]
}