{
    "batting_averages": [
        {
            "": "Tests",
            "100": "2",
            "50": "2",
            "6s": "0",
            "Ave": "37.20",
            "Ct": "13",
            "HS": "132*",
            "Inns": "22",
            "Mat": "13",
            "NO": "2",
            "Runs": "744",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "74",
            "50": "145",
            "6s": "",
            "Ave": "35.46",
            "Ct": "587",
            "HS": "357*",
            "Inns": "1007",
            "Mat": "627",
            "NO": "73",
            "Runs": "33128",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "13",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "3",
            "Ave": "24.00",
            "BBI": "6/15",
            "BBM": "",
            "Balls": "14408",
            "Econ": "2.62",
            "Inns": "",
            "Mat": "627",
            "Runs": "6314",
            "SR": "54.7",
            "Wkts": "263"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155663.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154820.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/062004/052787.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/062004/052787.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nNovember 30, 1857, Rotherhithe, Surrey "
        ],
        "Bowling style": [
            "Right-arm offbreak"
        ],
        "Died": [
            "December 10, 1936, Stockwell, London (aged 79 years 10 days) "
        ],
        "Full name": [
            "Robert Abel"
        ],
        "Major teams": [
            "England,",
            "Surrey"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nThe \"Guv'nor\" was a great crowd favourite for many years at the\nOval, where he was the one reliable bat in a strong Surrey side.\nOf small stature (5'4\"), and serious demeanour, he had an\nunconventional technique, with a bent for cross batted\nshots. \"He gathers runs like blackberries everywhere he goes\"\nsaid CB Fry.\nHe possessed great patience, but generally scored quickly, driving and\ncutting well, but particularly adept at forcing the ball off his legs.\nAn excellent slip fielder, he also bowled off-spin with considerable skill,\nbut was rarely used in a strong Surrey attack. \n",
        null,
        "ABEL, ROBERT, the old Surrey and England cricketer, died at his home near Kennington Oval on December 10, in his eightieth year. A great favourite at the Oval, Bobby Abel, popularly known as The Guv'nor, began his career with Surrey in 1881, and played his last match for the county in 1904, failing eyesight causing him to drop out of the eleven earlier than otherwise he need have done. Born on November 30, 1857, he was 23 when first appearing for his county. Found in club cricket in Southwark Park, he took some time to accustom himself to new surroundings and his early efforts in first-class cricket gave no idea of the skill which he steadily attained. Very keen, he overcame the handicap of being short and, while maturing his form with the bat, he attracted attention by smart fielding, especially at slip.",
        "In his third season with Surrey he advanced rapidly as a batsman and in 1886 against the Australians at the Oval he played a remarkable innings of 144. In 1888--one of the wettest summers ever experienced--he came out first among the professional batsmen of the year, scoring in first-class matches 1,323 runs with an average of 31. Thenceforward his successful career was interrupted only in 1893 when a serious infection of the eyes interfered with his play. If late in reaching his best, he was right at the top of the tree from 1895 to 1902, scoring over 2,000 runs in first-class matches in eight successive seasons. His highest aggregate of runs, 3,309, was obtained in 1901 and his average in these eight years of conspicuous ability ranged from 56 to 41. In 1903 his eyes troubled him again, and though playing in glasses helped him to some extent next year his first-class career then closed.",
        "His highest innings was 357 not out against Somerset at the Oval in May, 1899; it remains a Surrey record and is second best for any County, A. C. MacLaren's 424, also off Somerset bowlers, at Taunton in 1895, still being unapproached. Besides this great score, Abel played eight innings of more than 200, and nine times in first-class matches he carried his bat through an innings. Among Surrey batsmen he ranks with Hobbs, Hayward, W. W.Read and Harry Jupp.",
        "Extraordinarily successful in Gentlemen and Players matches at the Oval, he scored 168 not out in 1894, 195 in 1899, 153 not out in 1900, and 247 in 1901. This 247 was the biggest score ever obtained in a Gentlemen and Players match until 1925, when Hobbs made 266 at Scarborough. For Players against Gentlemen at Lord's, his highest score was 98 in a memorable match in 1900. Playing first for England against Australia in 1888, he took part in eight Test matches in this country, his best score being 94 at Lord's in 1896.",
        "In the winter of 1887-88 when, owing to what may have been a misunderstanding between Sydney and Melbourne, but at the time was generally regarded as rivalry between the cricket authorities, two English teams visited Australia. Abel went with G. F. Vernon's side and scored 320 runs in eleven-a-side matches, average 24. He was not chosen when the two bands joined forces on the occasion when Peel and Lohmann disposed of Australia for totals of 42 and 82. Abel went to Australia again in 1891-92 when W. G. Grace captained Lord Sheffield's side, and he averaged 38 for the eleven-a-side games. At Sydney, in the second of the three Test matches, he accomplished the remarkable performance of carrying his bat through the first innings for 132 but Australia won the contest in which Alex Bannerman, who batted seven hours and a half for 91, received 204 balls from Attewell and scored off only five. Abel visited South Africa with Major Wharton's team in 1888-89 and scored 1,075, average 48--more than twice aggregate and average of any other member of the side.",
        "A batsman of great resource and patience, he rarely if ever carried caution to an extreme and for a man of his small stature he was quite a punishing player. Once at the Oval he performed the rare feat of scoring a hundred runs between twelve o'clock and lunch-time. He and Brockwell enjoyed many big partnerships together for the Surrey first wicket, and against Hampshire at the Oval in August 1897, scored 379--a record for an opening stand at that time--265 against Warwickshire at the Oval in September, 1898, 231 against Sussex at the Oval in May, 1897 and 270 (unbroken) against Kent at the Oval in 1900. Other great first-wicket stands in which he shared were 364 with D. L. A. Jephson against Derbyshire at the Oval in 1900, 246 with Tom Hayward against Sussex at Hastings in 1902, and 226 with W. G. Grace for South against North at Scarborough in 1889. The biggest partnership of all in which he participated was one of 448 with Hayward for Surrey's fourth wicket against Yorkshire at the Oval in 1899, Abel scoring 193 and Hayward 273. This is the world's record for the fourth wicket.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}