{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "5",
            "Ave": "11.44",
            "Ct": "28",
            "HS": "38",
            "Inns": "87",
            "Mat": "70",
            "NO": "28",
            "Runs": "675",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "5",
            "6s": "",
            "Ave": "10.80",
            "Ct": "230",
            "HS": "62",
            "Inns": "647",
            "Mat": "559",
            "NO": "145",
            "Runs": "5424",
            "St": "0"
        },
        {
            "": "List A",
            "100": "0",
            "50": "0",
            "6s": "",
            "Ave": "14.40",
            "Ct": "4",
            "HS": "36",
            "Inns": "11",
            "Mat": "15",
            "NO": "6",
            "Runs": "72",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "1",
            "4w": "9",
            "5w": "9",
            "Ave": "24.84",
            "BBI": "7/39",
            "BBM": "11/97",
            "Balls": "16056",
            "Econ": "2.33",
            "Inns": "129",
            "Mat": "70",
            "Runs": "6261",
            "SR": "63.7",
            "Wkts": "252"
        },
        {
            "": "First-class",
            "10": "11",
            "4w": "",
            "5w": "123",
            "Ave": "16.37",
            "BBI": "8/34",
            "BBM": "",
            "Balls": "100955",
            "Econ": "2.19",
            "Inns": "",
            "Mat": "559",
            "Runs": "36999",
            "SR": "44.6",
            "Wkts": "2260"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "0",
            "5w": "1",
            "Ave": "21.09",
            "BBI": "5/28",
            "BBM": "5/28",
            "Balls": "991",
            "Econ": "2.80",
            "Inns": "",
            "Mat": "15",
            "Runs": "464",
            "SR": "45.0",
            "Wkts": "22"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/837473/26-all-out",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/631181/-i-wanted-to-stop-batsmen-from-getting-on-to-the-front-foot",
        "http://www.espncricinfo.com/magazine/content/story/600342.html",
        "http://www.espncricinfo.com/ci-icc/content/story/422782.html",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/340316/-take-it-one-ball-at-a-time",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=20341"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/107600/107673.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/107600/107673.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/107600/107673.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nJune 17, 1930, Gorton, Manchester, Lancashire "
        ],
        "Bowling style": [
            "Right-arm fast-medium"
        ],
        "Died": [
            "June 10, 2000, Stockport, Cheshire (aged 69 years 359 days) "
        ],
        "Full name": [
            "John Brian Statham"
        ],
        "Major teams": [
            "England,",
            "Lancashire"
        ]
    },
    "profile_info": [
        "\nJohn Brian Statham, CBE, died from leukaemia on June 10, 2000, aged 69. Brian Statham was one of the best of all English fast bowlers, and beyond question the best-liked. A gentle man who had to be persuaded to bowl a bouncer, he was a mainstay of the England team in its vintage period between 1951 and 1963: he took 252 wickets in 70 Tests. His name will forever be coupled with that of Freddie Trueman, though they actually played together in only half his Tests. Statham's name always came second because he was the foil to Trueman's sabre - and the more reticent man. In cricketing folklore he is remembered primarily for his accuracy: \"If they miss, I hit,\" he would say. This diminishes his astonishing skill. He was indeed accurate; so are many fast-medium bowlers. Statham kept his line and length at a very high pace indeed, comparable with all but the very fastest of Test match bowlers. A batsman hit by Statham - even on the foot, which was more likely than the head - knew all about it. In Statham's case the area around off stump was more a corridor of certainty than uncertainty, but if the ball hit the seam it jagged back in very sharply. The results were always formidable, and occasionally devasting. \n",
        "Statham came from Gorton, in Manchester. There was no silver spoon, but there was cricket in his background: three of his brothers appeared in local leagues. He played for Denton West and then Stockport, but Lancashire never noticed him. His corporal during national service in the RAF - a southerner - recommended him to MCC, however. He was told to write to Old Trafford, and Statham was offered a trial. In May 1950 he was on the ground staff; a month after reporting to the coach, Harry Makepeace, he was in the first team. It was his 20th birthday: \"He was a youngster who carried his flannels in a canvas bag,\" said Wisden, \"and his boots in a brown paper parcel.\" His reputation grew quietly until the Roses match at Old Trafford in August, when he shocked a huge and expectant crowd by immediately falling over in his run-up. He picked himself up, dusted himself down and later that over ripped out Frank Lowson's middle stump. In the same spell he also dismissed Ted Lester and Willie Watson; all three got ducks and Wisden said his bowling \"bordered on the sensational\". Five months later, along with his county colleague, Roy Tattersall, he was flown out to Australia to join Freddie Brown's injury-stricken party. Both Cyril Washbrook and Len Hutton, who had seen him at close quarters in the Roses match, argued for him, though many in the party had never seen him. Coming straight from a hard English winter, Statham played his first first-class game for MCC on a day of extreme midsummer heat at Adelaide. It might have broken some young players but, with his easy-going, beer-and-fags style, Statham was soon just \"George\" to everyone and fitted in beautifully. It was the New Zealand leg of the tour before he made his mark on the field, with figures of four for 17 in more Mancunian conditions against Otago. Then in Christchurch, ten months after his arrival at Old Trafford, he became a Test cricketer.",
        "It took a while for him to make the impact in Tests that he had in county cricket, and he made only occasional appearances for England over the next three seasons. None the less, he continued to improve - 97 wickets at just 15.11 in 1951, 110 at 18.08 in 1952, 101 at 16.33 in 1953. Even more significantly, he quickened up to the point of being a genuine fast bowler rather than a sharp fast-medium, and on the difficult West Indies tour of 1953-54 he came into his own. At Sabina Park, he opened the bowling with Trueman for the first time for England and, in the Third Test at Georgetown, turned the series with a devastating new-ball spell, sending back Worrell, Stollmeyer and Walcott for ten runs. Alex Bannister of the Daily Mail reported that Stollmeyer had received the best fast ball bowled for England since Alec Bedser bowled Bradman for a duck at Adelaide seven years earlier.",
        "Statham was England's leading wicket-taker in Tests in the West Indies, and the following winter he reached his peak. The name in the headlines was Frank Tyson, whose ferocious bursts at Sydney and Melbourne gave England the Ashes. But the quiet man made it possible: while Tyson raced with the wind at Sydney, Statham battled into it; he took five for 60 to restrict Australia's lead in the first innings at Melbourne, and gave the batsmen no respite in the second, when Tyson took seven for 27. By now, with Bedser fading, Statham was England's most reliable bowler. And sometimes he was more than that. At Lord's in 1955, he bowled unchanged in the second innings as South Africa were dismissed for 111 to lose a match they had been dominating. His figures were 29-12-39-7: it was a feat of endurance even allowing for a lunch break extended to two hours by bad light.",
        "All this time, he was - year after year - Lancashire's leading bowler. And lacking anyone to give him the support he himself provided so unstintingly for England, until the emergence of Ken Higgs in 1958, he sometimes had to do all the work himself. At Coventry in 1957, he bowled Lancashire to an innings win with match figures of 15 for 89. Though he dipped in and out of the England team, through injuries and the whims of selection, his form remained constant, whether or not it was reflected in the statistics. A half-volley remained a major event. On the unhappy Ashes tour of 1958-59, he took seven for 57 on the way to defeat at Melbourne, and reports suggested he often bowled just as well for less reward. He had a few final hurrahs for England in the early 1960s, but on his fourth Ashes tour, in 1962-63, his pace had declined; the following summer he appeared to fade out of Test cricket. Yet he was recalled two years later and, together with Higgs, bowled out South Africa for 208 at The Oval. He was 35 but still took 137 wickets that season at 12.52 and could apparently have gone on a fifth Ashes tour had he wanted. By now, he was Lancashire captain, a job he held for three years. His performances never wavered and Lancashire's were reasonable, although by the end, Wisden said, his decisions \"often puzzled\". It was a happy ship, though: \"Fewer jollier bands have ever laughed and sung their way through the shires,\" said Derek Hodgson, who travelled with them for the Daily Express. In 1967 Statham passed Johnny Briggs to become Lancashire's leading wicket-taker, and he added 69 more in his last season, 1968. In all first-class cricket, he took 2,260 wickets, putting him 19th on the all-time list. But his average of 16.37 is the best of the top 20 wicket-takers and beaten only by Briggs - who bowled on the primitive pitches of the 19th century - among the top 30.",
        "His methods remain a matter of some debate. His action was certainly too chest-on to be accepted as classical. He swung the ball only rarely, and perhaps never by design. Part of the secret seems to have been that Statham was not merely supple but double-jointed. \"He could put his right arm round his face and touch his right ear and do the same with his left arm and his left ear at the same time,\" said an admiring Geoff Pullar. He was certainly an impressive athlete: a beautiful outfielder and an occasionally effective left-handed tailender. His bowling quality was never in dispute. Nor was his character: he had an enchantingly easy-going temperament. \"I only saw him lose his rag twice,\" said Pullar, his Lancashire and England team-mate. \"Both times he was certain they had gloved a catch. One was Easton McMorris in the West Indies - he hit him on the chest and made him spit blood. The other was `Pom-Pom' Fellows-Smith, and he knocked his cap off.\" Even the accuracy seems to have been a reflection of his temperament: \"I'm not going to run in 30 yards and watch a batsman shoulder arms,\" Statham once said. \"It's a waste of energy.\"",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}