{
    "batting_averages": [
        {
            "": "Tests",
            "100": "2",
            "50": "1",
            "6s": "3",
            "Ave": "64.85",
            "Ct": "2",
            "HS": "136",
            "Inns": "9",
            "Mat": "7",
            "NO": "2",
            "Runs": "454",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "35",
            "50": "90",
            "6s": "",
            "Ave": "30.15",
            "Ct": "289",
            "HS": "242",
            "Inns": "645",
            "Mat": "399",
            "NO": "38",
            "Runs": "18306",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "7",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "41.66",
            "BBI": "3/58",
            "BBM": "",
            "Balls": "1933",
            "Econ": "3.49",
            "Inns": "",
            "Mat": "399",
            "Runs": "1125",
            "SR": "71.5",
            "Wkts": "27"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155419.html",
        "http://www.espncricinfo.com/southafrica/content/story/392658.html",
        "http://www.espncricinfo.com/southafrica/content/story/392634.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/85600/85681.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/85600/85681.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/85600/85681.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJanuary 17, 1908, Blackheath, Kent "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "February 2, 1983, Otford, Kent (aged 75 years 16 days) "
        ],
        "Education": [
            "Repton School"
        ],
        "Full name": [
            "Bryan Herbert Valentine"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Kent"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        "Valentine, Bryan Herbert, MC, who died on February 2, 1983, aged 75, was a gifted athlete to whom most games came naturally. At Repton he won the public schools lawn tennis with the great H. W. Austin; at Cambridge he got a soccer Blue as a brilliant forward and later he became a scratch golfer. But, happily, it was to cricket that he really devoted himself and he never made the mistake, which so many talented players have made, of being satisfied with what he could achieve without study and effort. He was three years in the Repton XI, but after a splendid season in 1925, his last was spoilt by illness and injury. After a year spent in duels with the examiners, he made 114 (retired) in 75 minutes in the Freshmen's Match at Cambridge in 1928, but it was not until 1929 that he got a Blue and even then his place was in doubt until the last match at Fenner's, when, against an unusually strong Free Foresters bowling side, which included M. J. C. Allom, R. J. O. Meyer, C. S. Marriott, M. Falcon and A. G. Doggart, he scored 101 in 85 minutes. Meanwhile he had been playing for Kent since 1927, but with only moderate success, and it was not until 1931 that he made his place secure. At this period he was just a promising county cricketer with beautiful strokes, capable of playing a brilliant innings and stronger on the leg than most of his type, but distinctly suspect in defence. By the mid-thirties he had become far sounder, had learned to watch the turning ball and was a potential England player, and this without curbing his instinct to attack. His average rate of scoring throughout his career is said to have been some 50 runs an hour. He was particularly adept at on-driving, with a full swing of the bat, the numerous off-spinners and in-swingers encouraged by the new lbw law. However, English batting was strong at this time and his Test cricket was confined to the tours of India in 1933-34 and South Africa in 1938-39. In India he came third in the batting, and at Bombay in the first Test made 136 in under three hours. In South Africa consistent batting brought him an average of 45.38 and in the second Test, at Cape Town, he made 112 in two hours, 40 minutes. In the previous summer he had made the highest score of his career, 242 for Kent against Leicestershire at Oakham.",
        "After serving in the war, winning the MC and being severely wounded, he returned to captain the county from 1946 to 1948, when he retired from first-class cricket. He had already captained frequently in the absence of A. P. F. Chapman and in 1937 had shared the captaincy with R. T. Bryan. A post-war England captain, who played under Valentine, whom he had not previously met, for an MCC side years after his retirement, said regretfully, What fun county cricket must have been when men like that were captain! And of course he was right. Valentine took his cricket seriously enough, as the story of his career shows, and was as keen as anyone to win, but he never forgot that cricket is a game and as such he enjoyed it himself and did all he could to see that others enjoyed it too, including the spectators. In a friendship of over 50 years I myself never saw him anything but cheerful and usually laughing. His own account of his mild away-swingers is typical. He used to say that Chapman had occasionally given him the new ball because no-one else ever gets the shine off so quickly for `Tich'. As a fieldsman he was in the top class, equally good on the boundary or close to the wicket. President of Kent in 1967 and for many years on the Committee, he remained in close touch with the county and will be widely missed. In all first-class cricket he scored 18,306 runs with an average of 30.15 and made 35 centuries.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}