{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "1",
            "6s": "0",
            "Ave": "49.50",
            "Ct": "0",
            "HS": "80",
            "Inns": "2",
            "Mat": "1",
            "NO": "0",
            "Runs": "99",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "38",
            "50": "100",
            "6s": "",
            "Ave": "37.89",
            "Ct": "96",
            "HS": "168",
            "Inns": "521",
            "Mat": "332",
            "NO": "51",
            "Runs": "17811",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "1",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "60.50",
            "BBI": "1/0",
            "BBM": "",
            "Balls": "190",
            "Econ": "3.82",
            "Inns": "",
            "Mat": "332",
            "Runs": "121",
            "SR": "95.0",
            "Wkts": "2"
        }
    ],
    "latest_articles": [],
    "latest_photos": [],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMay 5, 1911, Dukinfield, Cheshire "
        ],
        "Died": [
            "April 19, 1996, Cleveleys, Blackpool, Lancashire (aged 84 years 350 days) "
        ],
        "Full name": [
            "Norman Oldfield"
        ],
        "Major teams": [
            "England,",
            "Lancashire,",
            "Northamptonshire"
        ],
        "Other": [
            "Umpire, Coach"
        ]
    },
    "profile_info": [
        null,
        "He died on April 19, just short of his 85th birthday, at home in Cleveleys, near Blackpool, believing that leaving Lancashire in 1946 had been a mistake. He had returned to county cricket in 1948 with another club, Northants, together with fellow Lancashire defector Albert Nutter, and was to raise his average during his seven seasons with his second club. It had begun so promisingly. Joining Lancashire's staff at 18, `Buddy' Oldfield had to wait six years before his first-class debut, but immediately caught the eye - not least that of Neville Cardus, who compared the diminutive strokeplayer with the great J. T. Tyldesley. Born in Dukinfield, Cheshire on May 5, 1911, Oldfield was particularly skilful off the back foot, and was clearly a class above most of his contemporaries. If he had a defect, it was that he suffered awful nervous tension. Breakfast was shunned, and when padded up he smoked ceaselessly, blinking a lot too. Mercifully, like Brian Close and Tony Greig, he colleted himself well once through the gate.",
        "In July 1937, when Eddie Paynter raced to 322 in five hours, Oldfield (92) helped raise the tempo in a third-wicket stand of 271 in 2¼ hours as Sussex were run ragged at Hove. A year later, at Southampton, Paynter (291) and Oldfield (135) again sparkled, their third-wicket stand raising 306, a Lancashire record until 1990, when Atherton and Fairbrother added 364 at The Oval.",
        "In his second career, with Northants, Oldfield took part in an even bigger stand, 361 for the first wicket, against Scotland, with Vince Broderick, at Peterborough, in 1953, in which year he and Nutter shared a testimonial which fetched £2728.",
        "It was for Northants that he scored the most satisfying of his 38 centuries. Refused entry to Old Trafford after his 1946 dispute, he had to be admitted when Northants played there. And he scored 100 in four hours. Further hundreds against Lancashire at Northampton in 1952 and 1953 were equally relished, though, soothingly, Oldfield was to return to Old Trafford as coach for five seasons from 1968.",
        "He went on two minor tours: to New Zealand in 1938-39 with Sir Julian Cahn's side and to India in 1949-50 with a Commonwealth team. There he covered himself in glory with centuries in the first three unofficial Tests against the full Indian attack.",
        " Oldfield reached 1000 runs in 11 seasons, and 2000 once ( 1949), and in all first-class cricket he made 17,811 runs at 37.90. He later joined the first-class umpires' list, without particularly enjoying the activity, though he did stand in two Tests: Old Trafford, 1960, and Lord's, 1962.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}