{
    "batting_averages": [
        {
            "": "Tests",
            "100": "2",
            "50": "7",
            "6s": "0",
            "Ave": "32.18",
            "Ct": "17",
            "HS": "144",
            "Inns": "41",
            "Mat": "26",
            "NO": "3",
            "Runs": "1223",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "94",
            "50": "124",
            "6s": "",
            "Ave": "50.22",
            "Ct": "239",
            "HS": "258*",
            "Inns": "658",
            "Mat": "394",
            "NO": "43",
            "Runs": "30886",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "10",
            "Econ": "1.80",
            "Inns": "1",
            "Mat": "26",
            "Runs": "3",
            "SR": "-",
            "Wkts": "0"
        },
        {
            "": "First-class",
            "10": "2",
            "4w": "",
            "5w": "9",
            "Ave": "29.34",
            "BBI": "6/78",
            "BBM": "",
            "Balls": "9036",
            "Econ": "3.23",
            "Inns": "",
            "Mat": "394",
            "Runs": "4872",
            "SR": "54.4",
            "Wkts": "166"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/blogs/content/story/622154.html",
        "http://www.espncricinfo.com/magazine/content/story/519379.html",
        "http://www.espncricinfo.com/magazine/content/story/410649.html",
        "http://www.espncricinfo.com/magazine/content/story/253554.html",
        "http://www.espncricinfo.com/magazine/content/story/248796.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=12930"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/042004/051943.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042004/051943.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042004/051943.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nApril 25, 1872, West Croydon, Surrey "
        ],
        "Bowling style": [
            "Right-arm fast-medium"
        ],
        "Died": [
            "September 7, 1956, Child's Hill, Hampstead, London (aged 84 years 135 days) "
        ],
        "Education": [
            "Repton"
        ],
        "Full name": [
            "Charles Burgess Fry"
        ],
        "Major teams": [
            "England,",
            "Europeans (India),",
            "Hampshire,",
            "London County,",
            "Oxford University,",
            "Sussex"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nCaptain Charles Burgess Fry, who died at his home at Hampstead, London, on September 7, 1956, aged 84, was probably the greatest allrounder of his or any generation. He was a brilliant scholar and an accomplished performer in almost every branch of outdoor sport. Fry was the perfect amateur; he played games because he loved them and never for personal gain. He captained England in Test Matches, and the Mother Country never lost under his captaincy.  \n",
        "He played Association Football for England against Ireland in 1901; he was at full-back for Southampton in the FA Cup Final of 1902. The long jump was another speciality for this remarkable all-round sportsman: he broke the British record in 1892 and the following year equalled the world record. But it was at cricket that his outstanding personality found its fullest expression. ",
        null,
        "Charles Fry was born into a Sussex family on April 25, 1872, at Croydon, and was known first as an England cricketer and footballer, also as a great allround athlete who for a while held the long-jump record, a hunter and a fisher, and as an inexhaustible virtuoso at the best of all indoor games, conversation.",
        "He was at Repton when a boy, where at cricket he joined the remarkable and enduring roll of superb young players emanating from the school -- Fry, Palairet, Ford, JN Crawford, to name a few. At Oxford he won first-class honours in Classical Moderations at Wadham, and it is a tribute to his calibre as a scholar and personal force that most of the obituary articles written after the death of Viscount Simon named Fry in a Wadham trinity with Birkenhead. Not the least doughty and idealistic of his many-sided achievements was as a Liberal candidate for Brighton, where he actually polled 20,000 votes long after he had ceased to live in Sussex and dominate the cricket field.",
        null,
        "Fry must be counted among the most fully developed and representative Englishmen of his period; and the question arises whether, had fortune allowed him to concentrate on the things of the mind, not distracted by the lure of cricket, a lure intensified by his increasing mastery over the game, he would not have reached a high altitude in politics or critical literature. But he belonged -- and it was his glory -- to an age not obsessed by specialism; he was one of the last of the English tradition of the amateur, the connoisseur, and, in the most delightful sense of the word, the dilettante.",
        "As a batsman, of course, he was thoroughly grounded in first principles. He added to his stature, in fact, by taking much thought. As a youth he did not use a bat with much natural freedom, and even in his period of pomp he was never playing as handsomely as his magnificent physical appearance seemed to suggest and deserve. He was, of course, seen often in contrast with Ranjitsinhji, who would have made all batsmen of the present day, Hutton included, look like so many plebeians toiling under the sun. Yet in his prime Fry was a noble straight-driver. He once said to me: \"I had only one stroke maybe; but it went to ten different parts of the field.\" But in 1905, when the Australians decided that Fry could make runs only in front of the wicket, mainly to the on, and set the field for him accordingly, he scored 144 in an innings sparkling with cuts.",
        "In his career as a cricketer, he scored some 30,000 runs, averaging 50, in an era of natural wickets, mainly against bowlers of great speed or of varied and subtle spin and accuracy. From Yorkshire bowling alone he scored nearly 2,500 runs in all his matches against the county during its most powerful days, averaging 70, in the teeth of the attack of Hirst, Rhodes, Haigh, Wainwright, and, occasionally, F. S. Jackson. In 1903 he made 234 against Yorkshire at Bradford. Next summer he made 177 against Yorkshire at Sheffield, and 229 at Brighton, in successive innings. Ranjitsinhji's performances against Yorkshire were almost as remarkable as Fry's; for he scored well over 1,500 runs against them, averaging more than sixty an innings. In 1901 Fry scored six centuries in six consecutive innings, an achievement equalled by Bradman, but on Australian wickets and spread over a season. Fry's six hundreds, two of them on bowler's wickets, came one on top of the other within little more than a fortnight.",
        "The conjunction at the creases of CB Fry and KS Ranjitsinhji was a sight and an appeal to the imagination not likely ever to be repeated; Fry, nineteenth-century rationalist, batting according to first principles with a sort of moral grandeur, observing patience and abstinence. At the other end of the wicket, Ranji turned a cricket bat into a wand of conjuration. Fry was of the Occident, Ranji told of the Orient.",
        "Cricket can scarcely hope again to witness two styles as fascinatingly contrasted and as racially representative as Fry's and Ranjitsinhji's. Between them they evolved a doctrine that caused a fundamental change in the tactics of batsmanship. Play back or drive. Watch the ball well, then make a stroke at the ball itself and not at a point in space where you hope the ball will presently be. At the time that Fry was making a name in cricket most batsmen played forward almost automatically on good fast pitches, frequently lunging out at full stretch. If a ball can be reached only by excessive elongation of arms and body, obviously the pitch of it has been badly gauged. Fry and Ranjitsinhji, following after Arthur Shrewsbury, developed mobile footwork.",
        "It is a pungent comment on the strength of the reserves of English cricket half a century ago that Fry and Ranji were both dropped from the England team at the height of their fame. In 1901 Fry scored 3,147 runs, average 78.67; in 1903 he scored 2,683 runs, average 81.30. In 1900 Ranjitsinhji scored 3,065, average 87.57. Yet because of one or two lapses in 1902, both these great players were asked to stand down and give way to other aspirants to Test cricket.",
        "As we consider Fry's enormous aggregates of runs summer by summer, we should not forget that he took part, during all the extent of his career, in only one Test match lasting more than three days, and that he never visited Australia as a cricketer. For one reason and another Fry appeared not more than eighteen times against Australia in forty-three Test matches played between 1899, when he began the England innings with W. G. Grace, and 1912, in which wet season he was England's captain against Australia and South Africa in the ill-fated triangular tournament. By that time he had severed his illustrious connection with Sussex and was opening the innings for Hampshire. The general notion is that Fry was not successful as an England batsman; and it is true that in Test matches he did not remain on his habitual peaks. None the less, his batting average for Test cricket is much the same as that of Victor Trumper, M. A. Noble, and J. T. Tyldesley. The currency had not been debased yet.",
        "Until he was no-balled for throwing by Phillips -- who also called Mold at Old Trafford -- Fry was a good fast bowler who took six wickets for 78 in the University match, opened the Gentlemen's bowling against the Players at The Oval, and took five wickets. Twice he performed the hat-trick at Lord's.",
        "He played Association football for his university, for the Corinthians, Southampton, and for England.",
        "In his retirement he changed his methods as a writer on cricket and indulged a brisk impressionistic columnist style, to suit the running commentary needed by an evening paper: \"Ah, here comes the Don. Walking slowly to the wicket. Deliberately. Menacingly. I don't like the look of him. He has begun with a savage hook. He is evidently in form. Dangerously so. Ah, but he is out...\" Essentially he was an analyst by mind, if rather at the mercy of an impulsive, highly strung temperament. He sometimes, in his heyday, got on the wrong side of the crowd by his complete absorption in himself, which was mistaken for posing or egoism. He would stand classically poised after making an on-drive, contemplating the direction and grandeur of it. The cricket field has seen no sight more Grecian than the one presented by C. B. Fry in the pride and handsomeness of his young manhood.",
        "After he had passed his seventieth birthday, he one day entered his club, saw his friend Denzil Batchelor, and said he had done most things but was now sighing for a new world to conquer, and proposed to interest himself in racing, attach himself to a stable, and then set up on his own. And Batchelor summed up his genius in a flash of wit: \"What as, Charles? Trainer, jockey, or horse?\"",
        null,
        "Mr. Hubert Preston writes: Charles Fry secured a place in the Repton XI in 1888 and retained it for the next three years, being captain in 1890 and 1891. In his last season at school his average reached nearly 50.",
        "When he went up to Oxford, Fry was captain of the cricket and Association football XIs and president of the athletic club, acting as first string in the 100 yards and the long-jump.",
        "He also played a good deal of Rugby football, and his friends insisted that but for an unfortunate injury he would have added a Rugger Blue to his other honours. Charles Fry was also a fine boxer, a passable golfer, swimmer, sculler, tennis player and javelin thrower. But it was on the cricket field that he achieved his greatest triumphs. He represented three counties -- Sussex, Hampshire and Surrey -- scoring altogether 30,886 runs in first-class matches, average 50.22. His total of centuries reached 94 and five times he scored two separate hundreds in a match.",
        "Fry's best season was 1901 when his aggregate reached 3,147, average 78.67. In that summer he scored 13 hundreds and made six in successive innings -- a feat equalled only by Sir Donald Bradman. In 1899, 1901, and 1903, Charles Fry hit a century for the Gentlemen against the Players at Lord's, his 232 not out in 1903 remaining the highest individual score for the Gentlemen at Headquarters.",
        "His one three-figure Test innings against Australia was 144 at The Oval in 1905, when the rubber had already been decided. Two years later he made his only other hundred for England, 129 against the South Africans, also at The Oval. Fry shared with Vine (J.) in thirty-three opening partnerships of 100 for Sussex.",
        "Considering the very high rank he attained among batsmen, Fry, at the outset, was a stiff ungainly performer and was still somewhat laboured in stroke-production when he went up to Oxford. But from the time he began playing for Sussex with \"Ranji\" his game improved. He was a natural on-side batsman with a powerful straight drive and many useful leg-side strokes.",
        "The records contain very few details of Fry's achievements as a bowler. Yet he figured in a somewhat heated controversy in the 'nineties about \"unfair deliveries.\" Cricket writers generally regarded him as a thrower. Fry was equally insistent that all his deliveries were scrupulously fair.",
        "In his writings, Fry recalled how Jim Phillips, an Australian heavyweight slow bowler turned umpire, was sent to Hove specially to \"no-ball\" him.",
        "\"A bright move,\" commented Fry, \"because, of course, I rolled up my sleeve above my elbow and bowled with my arm as rigidly straight as a poker. The great Jim, sighting himself as a strong umpire, was not deterred. Large as an elephant, he bluffly no-balled me nine times running. It was a farce and the Sussex authorities and players were angry.",
        "\"However, I bowled often afterwards unscathed, even in Gentlemen v. Players' at Lord's and in a Test Match.\"",
        null,
        null,
        "The Albanians sent a delegation and appointed a Bishop, who bore a striking resemblance to W. G. Grace, to find an English country gentlemen with £10,000 a year for their King. Fry had the first qualification but not the second; but Ranji certainly could have provided the money. \"If I had really pressed Ranji to promote me,\" said Fry, \"it is quite on the cards that I should have been King of Albania yesterday, if not today.\"",
        null,
        "Other tributes included:",
        null,
        "Sir John Hobbs: \"I played with `C.B.' in my first Test against Australia in this country. The year was 1909 and we both got blobs in the first innings. `C.B.' persuaded Archie MacLaren, our captain, to let him go in first with me in the second innings, and we knocked off the 105 runs wanted for victory. Later he was my skipper and we always got on well together. He was a great raconteur, and my wife and I have spent many happy hours just listening to him. I saw him at Lord's this season.\"",
        "Sir Leonard Hutton: \"He was a fine judge of a cricketer and he always took the keenest interest in the progress of young players. I had a number of letters from him when I was still in the game. They were kindly, encouraging letters which contained much sound advice which I greatly appreciated.\"",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}