{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "11.00",
            "Ct": "0",
            "HS": "22",
            "Inns": "2",
            "Mat": "1",
            "NO": "0",
            "Runs": "22",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "33",
            "50": "98",
            "6s": "",
            "Ave": "31.74",
            "Ct": "147",
            "HS": "201",
            "Inns": "588",
            "Mat": "336",
            "NO": "38",
            "Runs": "17458",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "30",
            "Econ": "3.00",
            "Inns": "1",
            "Mat": "1",
            "Runs": "15",
            "SR": "-",
            "Wkts": "0"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "5",
            "Ave": "25.15",
            "BBI": "8/7",
            "BBM": "",
            "Balls": "26621",
            "Econ": "2.06",
            "Inns": "",
            "Mat": "336",
            "Runs": "9183",
            "SR": "72.9",
            "Wkts": "365"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/143733.html",
        "http://www.espncricinfo.com/england/content/story/143720.html",
        "http://www.espncricinfo.com/wcm/content/story/139867.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/042005/059315.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042005/059315.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMay 15, 1919, Old Hill, Staffordshire "
        ],
        "Bowling style": [
            "Right-arm medium, Right-arm offbreak"
        ],
        "Died": [
            "March 31, 2005 (aged 85 years 320 days) "
        ],
        "Full name": [
            "Charles Henry Palmer"
        ],
        "Major teams": [
            "England,",
            "Europeans (India),",
            "Leicestershire,",
            "Worcestershire"
        ],
        "Other": [
            "Administrator"
        ]
    },
    "profile_info": [
        null,
        "PALMER, CHARLES HENRY, CBE, who died on March 31, 2005, aged 85, was a small (5ft 7in), bespectacled and slightly eccentric amateur cricketer who played for England and later became one of the most durable administrators of his era. Palmer looked, in a phrase attributed to Trevor Bailey, \"like a hen-pecked bank clerk in a farce\". But he had a classical batting method, strong wrists, and a sense of timing, both in a technical sense and in his ability to conjure moments of serendipity on the field. He began his career, in 1938, at Worcestershire and, as a 20-year-old in 1939, scored three centuries and got talked about. He spent most of the next six years manning an anti-aircraft battery in Sussex. After the war, Palmer became a teacher at Bromsgrove School, playing occasionally, most notably in 1948 when he became the first (and almost only) county batsman to impress the Australians, with a forceful 85. Unlike most amateurs, Palmer was from grammar school and Birmingham University, not public school and Oxbridge. But MCC were anxious to promote amateurs in general, and sent him on the winter tour of South Africa, where he had a wonderful time but never made the Test team. A year later, Palmer was appointed secretary and captain of Leicestershire, then without a serviceable ground, never mind team. Palmer threw himself into the job, starting a football pool and attending chicken-salad dinners all winter to raise money. In the summer, he kept making runs - 2,071 in 1952 including a much-praised century for the Gentlemen at Lord's - and an increasing number of wickets with briskish swing and cut. Late in August 1953, Leicestershire were on top of the Championship for the first time ever and, though they faded to third, Palmer's feats were again being noticed: \"A leader without flourish,\" the Playfair annual called him, \"but indeed a leader.\" At 34, Palmer was chosen for the 1953-54 tour to West Indies - as playermanager, a notion apparently driven by the West Indian board's refusal to pay for a 16th player. He was thrilled, and envisaged a jolly that would match the South African trip. However, racial and political tensions were increasing; Len Hutton, the captain, was more interested in victory than diplomacy; and it was a tour of riots, umpiring controversy and general ill-feeling. There was a sense, articulated most forcefully by E. W. Swanton, that Palmer was out of his depth; Swanton called the tour \"a diplomatic and sporting disaster of the first magnitude which, I am sure, could have been averted by the right man.\" In contrast, Alex Bannister, in Cricket Cauldron, thought Palmer \"tackled a terribly difficult job with a quiet effectiveness\". While there, he did play his only Test. Palmer's fellow-selectors sent him out of the room and asked him to play in Barbados (Hutton did not think much of the alternative, Ken Suttle) even though he had not picked up a bat in three weeks. Palmer made 22 and 0, and England were well beaten. At home, he continued as an effective run-getter and an intermittently astonishing bowler. In 1955, against mighty Surrey, he brought himself on for an over so his spinners could change ends. \"Go easy on me,\" he said to Peter May, who was looking ominously well-set. \"I haven't bowled this year.\" Palmer found a wet spot, and the ball kept skidding off it on to the stumps. Seven batsmen were bowled and Palmer found himself with figures of 11-11-0-8. It took a few swipes from Jim Laker to save his own figures of eight for two from eclipse, and Palmer finished with eight for seven. But even this caused less surprise than his party trick of bowling donkey-drops. \"They were uncanny,\" recalls Mike Turner. \"He ran up normally but then the ball went as high as the roof of a house - I'm not joking - and the length was such that it literally fell on the stumps. Jock Livingston of Northamptonshire saw one coming. And I can see him now, leaning over the stumps looking to slog it. It ran down the face of the bat. Caught at slip.\" At the end of the 1950s, Palmer slipped away to go into the steel industry. And, after a brief interregnum, Turner took over as secretary, establishing from 1964 a 25-year partnership with Palmer as chairman, during which time Leicestershire became the model of a small but well-run cricket club. Palmer was also president of MCC in 1978-79 and chairman of the Test and County Cricket Board from 1983 to 1985. He chaired a committee that in December 1985 recommended fourday county cricket (which later became the norm) and uncovered pitches (which did not). His genial style of chairmanship was always popular, though it was arguable - as in West Indies - that it was insufficiently forthright to cope with the mounting problems the game faced. Little Palmer's confrontation with the hulking Kerry Packer was the ultimate catchweight contest. Nonetheless, it is to the credit of cricket that such an all-round good egg should succeed at it so well.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}