{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "3",
            "50": "0",
            "6s": "0",
            "Ave": "9.75",
            "BF": "198",
            "Ct": "1",
            "HS": "35",
            "Inns": "4",
            "Mat": "2",
            "NO": "0",
            "Runs": "39",
            "SR": "19.69",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "32",
            "4s": "",
            "50": "103",
            "6s": "",
            "Ave": "34.11",
            "BF": "",
            "Ct": "210",
            "HS": "181*",
            "Inns": "619",
            "Mat": "390",
            "NO": "61",
            "Runs": "19034",
            "SR": "",
            "St": "0"
        },
        {
            "": "List A",
            "100": "5",
            "4s": "",
            "50": "32",
            "6s": "",
            "Ave": "31.46",
            "BF": "",
            "Ct": "77",
            "HS": "119*",
            "Inns": "217",
            "Mat": "238",
            "NO": "37",
            "Runs": "5664",
            "SR": "",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "80.00",
            "BBI": "1/80",
            "BBM": "1/80",
            "Balls": "96",
            "Econ": "5.00",
            "Inns": "1",
            "Mat": "2",
            "Runs": "80",
            "SR": "96.0",
            "Wkts": "1"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "5",
            "Ave": "26.32",
            "BBI": "6/25",
            "BBM": "",
            "Balls": "19224",
            "Econ": "2.54",
            "Inns": "",
            "Mat": "390",
            "Runs": "8160",
            "SR": "62.0",
            "Wkts": "310"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "1",
            "5w": "0",
            "Ave": "20.53",
            "BBI": "4/33",
            "BBM": "4/33",
            "Balls": "819",
            "Econ": "4.21",
            "Inns": "",
            "Mat": "238",
            "Runs": "575",
            "SR": "29.2",
            "Wkts": "28"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/131897.html",
        "http://www.espncricinfo.com/england/content/story/90396.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/225300/225388.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/225300/225388.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/225300/225388.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nNovember 16, 1940, Longwood, Huddersfield, Yorkshire "
        ],
        "Bowling style": [
            "Slow left-arm orthodox"
        ],
        "Died": [
            "March 6, 2000, Carlisle, Cumberland (aged 59 years 111 days) "
        ],
        "Education": [
            "Paddock County School, Huddersfield"
        ],
        "Full name": [
            "John Christopher Balderstone"
        ],
        "Height": [
            "\n6 ft 1 in "
        ],
        "Major teams": [
            "England,",
            "Leicestershire,",
            "Yorkshire"
        ],
        "Nickname": [
            "Baldy"
        ],
        "Other": [
            "Umpire"
        ]
    },
    "profile_info": [
        "\nJohn Christopher Balderstone, one of the few men to have played cricket and\nfootball at the highest level, died suddenly at his home in Carlisle on March 6 at the age of 59. He had been suffering from cancer. Most success came on the cricket field where he  played a major role in Leicestershire winning\ntheir first Championship title in 1975, following eight years at Yorkshire, and he won two Test caps against the all-conquering West Indies side of 1976. \n",
        "His soccer career started at Huddersfield Town but after 117 appearances as a\nscheming inside-forward he moved to Carlisle United where, during his 369 appearances in which he scored 68 goals, he was a member of the side which gained promotion to the First Division for just one season, 1974-75, and\nwhich was briefly on top of the table.",
        "Born in Longwood, he played in Paddock's side in the Huddersfield League before\nhis 15th birthday and in 1961 made his Yorkshire debut against Glamorgan at\nHeadingley, making 23 in his only innings that summer. But after scoring 1,332\nruns in eight seasons he moved to Leicestershire where his career blossomed.",
        "He took a good deal of satisfaction in winning the Man of the Match award when Leicestershire, under the leadership of Ray Illingworth, beat Yorkshire in the 1972 Benson and Hedges Cup Final, and his maiden first-class century came\nthe following year against Lancashire at Liverpool, the first of 32, of which the highest was an unbeaten 181 against Gloucestershire at Grace Road in 1984.",
        "A member of the first-class umpires' list since 1988, he stood in two limited-overs internationals against South Africa and had the minor distinction to be the first Third Umpire used. He was highly respected and Barrie\nLeadbeater, the umpires' chairman and a close friend, said: 'He was a fine, positive player who won a lot of friends by his approach. He was a gentleman in everything he did on and off the field and his death came as a tremendous\nshock. He will be sadly missed. There was a refreshing honesty about everything he did and he was a true sportsman of the like we don't see today.'",
        "Balderstone made a further 17,627 runs at 36.95 for the Foxes, and took 310 wickets in his career at 26.32, with his tossed up, left-arm spin. His best performance with the ball was 6 for 25 against Hampshire at Southampton in\n1978, and he did the hat-trick against Sussex at Eastbourne in 1976. He still shares the second-wicket partnership record of an unbroken 289 with David Gower, against Essex at Grace Road in 1981.",
        "David Collier, the Leicestershire chief executive, said: 'Chris was one of the\noutstanding sportsmen of his era, and a great asset and true friend to the county. He was an important part of the side that won our first Championship and really put the county on the cricket map.'",
        "Chris Balderstone was also an outstanding fielder but would ruefully recall the time he dropped Viv Richards, then on 151, at The Oval in the Fifth Test of 1976 off Derek Underwood. 'I don't think Deadly ever forgave me,' he said. 'To make matters worse I bagged a pair.' He would always forget to mention that he also held a remarkable catch at cover to dismiss Roy Fredericks in the same game or\nthat he batted for nearly three and a half hours at Headingley against that ferocious West Indies attack.",
        "Towards the end of his football career he made a piece of history by playing for\nLeicestershire against Derbyshire at Chesterfield in September, 1975 and, 51 not\nout at the close of play, dashed to Doncaster where he turned out for Rovers against Brentford in a league match, returning to the crease the next day to finish with 116.",
        "But football and cricket were already coming into conflict and in August, 1973 he was suspended by Carlisle United and relieved of the captaincy having decided to finish the summer with Leicestershire and thus miss pre-season training. He is remembered fondly at Brunton Park, where he moved from Huddersfield Town for £7,000, for scoring the penalty which took them, albeit briefly, to the top of the First Division and remained very much a local hero, moving back to\nCumbria early last summer.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}