{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "12",
            "50": "0",
            "6s": "0",
            "Ave": "10.27",
            "BF": "299",
            "Ct": "4",
            "HS": "25*",
            "Inns": "15",
            "Mat": "12",
            "NO": "4",
            "Runs": "113",
            "SR": "37.79",
            "St": "0"
        },
        {
            "": "ODIs",
            "100": "0",
            "4s": "2",
            "50": "0",
            "6s": "2",
            "Ave": "7.14",
            "BF": "89",
            "Ct": "4",
            "HS": "19*",
            "Inns": "11",
            "Mat": "15",
            "NO": "4",
            "Runs": "50",
            "SR": "56.17",
            "St": "0"
        },
        {
            "": "T20Is",
            "100": "-",
            "4s": "-",
            "50": "-",
            "6s": "-",
            "Ave": "-",
            "BF": "-",
            "Ct": "0",
            "HS": "-",
            "Inns": "-",
            "Mat": "1",
            "NO": "-",
            "Runs": "-",
            "SR": "-",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "4s": "",
            "50": "10",
            "6s": "",
            "Ave": "17.84",
            "BF": "",
            "Ct": "38",
            "HS": "90",
            "Inns": "183",
            "Mat": "146",
            "NO": "45",
            "Runs": "2462",
            "SR": "",
            "St": "0"
        },
        {
            "": "List A",
            "100": "0",
            "4s": "",
            "50": "0",
            "6s": "",
            "Ave": "10.05",
            "BF": "",
            "Ct": "27",
            "HS": "38*",
            "Inns": "83",
            "Mat": "133",
            "NO": "27",
            "Runs": "563",
            "SR": "",
            "St": "0"
        },
        {
            "": "T20s",
            "100": "0",
            "4s": "4",
            "50": "0",
            "6s": "3",
            "Ave": "9.09",
            "BF": "95",
            "Ct": "5",
            "HS": "13",
            "Inns": "22",
            "Mat": "59",
            "NO": "11",
            "Runs": "100",
            "SR": "105.26",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "2",
            "5w": "2",
            "Ave": "27.00",
            "BBI": "6/48",
            "BBM": "8/150",
            "Balls": "2902",
            "Econ": "2.95",
            "Inns": "23",
            "Mat": "12",
            "Runs": "1431",
            "SR": "54.7",
            "Wkts": "53"
        },
        {
            "": "ODIs",
            "10": "0",
            "4w": "1",
            "5w": "0",
            "Ave": "47.00",
            "BBI": "4/32",
            "BBM": "4/32",
            "Balls": "784",
            "Econ": "5.39",
            "Inns": "15",
            "Mat": "15",
            "Runs": "705",
            "SR": "52.2",
            "Wkts": "15"
        },
        {
            "": "T20Is",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "22.50",
            "BBI": "2/45",
            "BBM": "2/45",
            "Balls": "24",
            "Econ": "11.25",
            "Inns": "1",
            "Mat": "1",
            "Runs": "45",
            "SR": "12.0",
            "Wkts": "2"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "13",
            "Ave": "28.66",
            "BBI": "8/96",
            "BBM": "",
            "Balls": "25154",
            "Econ": "3.13",
            "Inns": "",
            "Mat": "146",
            "Runs": "13158",
            "SR": "54.8",
            "Wkts": "459"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "6",
            "5w": "0",
            "Ave": "27.78",
            "BBI": "4/25",
            "BBM": "4/25",
            "Balls": "6129",
            "Econ": "4.89",
            "Inns": "",
            "Mat": "133",
            "Runs": "5002",
            "SR": "34.0",
            "Wkts": "180"
        },
        {
            "": "T20s",
            "10": "0",
            "4w": "2",
            "5w": "0",
            "Ave": "19.36",
            "BBI": "4/16",
            "BBM": "4/16",
            "Balls": "1187",
            "Econ": "7.33",
            "Inns": "59",
            "Mat": "59",
            "Runs": "1452",
            "SR": "15.8",
            "Wkts": "75"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/england-v-south-africa-2017/content/story/1113300.html",
        "http://www.espncricinfo.com/magazine/content/story/1078576.html",
        "http://www.espncricinfo.com/england/content/story/911899.html",
        "http://www.espncricinfo.com/england/content/story/731055.html",
        "http://www.espncricinfo.com/the-ashes-2013-14/content/story/712309.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=21650"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/269400/269434.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/269400/269434.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/269400/269434.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nSeptember 2, 1981, Southampton, Hampshire "
        ],
        "Bowling style": [
            "Right-arm medium-fast"
        ],
        "Current age": [
            "36 years 350 days"
        ],
        "Education": [
            "Taunton's College, Southampton"
        ],
        "Full name": [
            "Christopher Timothy Tremlett"
        ],
        "Height": [
            "\n6 ft 7 in "
        ],
        "Major teams": [
            "England,",
            "ECB National Academy,",
            "England Lions,",
            "Hampshire,",
            "Hampshire Cricket Board,",
            "Surrey"
        ],
        "Nickname": [
            "Twiggy"
        ],
        "Playing role": [
            "Bowler"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nWith a 6ft 7in frame that looked cut from stone, Chris Tremlett was a hulking quick bowler of immense ability. His body gave him all the ingredients - pace, bounce and accuracy - to be a world-class fast bowler apart from one: a lack of resilience which curtailed what might have been an outstanding Test career. Instead, England will be primarily grateful for memories of the 2010-11 Ashes series when he was a key part of their series victory in Australia. \n",
        "It was apt that Tremlett announced his retirement in 2015 after conceding that his body could not stand the rigours of professional cricket any longer. He cut a gentle, passive figure for a fast bowler, which made him an easy target as the injuries mounted and his impact could never be relied upon, with some suspecting that he wilted under pressure, but a lesser figurer would also have abandoned hope much earlier. ",
        "Tremlett played 12 Tests, 15 ODIs and one T20 for England. He made his Test debut against India, at Lord's, in 2007 and bowled impressively in his first series but the twin devils of injury and inconsistency ensured he did not play another Test until the tour of Australia in 2010-11.",
        "His recall in Perth marked the beginning of his most successful spell as an international bowler as he collected 17 wickets in three matches to help England win down under for the first time in 24 years. He took 17 wickets at 23.35, which included the Ashes-winning wicket and fleetingly became part of a strong pack of fast bowlers that led England to the top of the world rankings, following his Ashes success with 15 wickets in three Tests against Sri Lanka. That series led to comparisons with Joel Garner but, having broken into the top ten rankings, injury struck. ",
        "Although he played a Test in UAE against Pakistan the following winter he was not fully fit and had surgery to remedy his back problems soon after. Many believed that would be the end of his international career but he returned to play three more Tests over the subsequent three years - one apiece against India, Sri Lanka and his final appearance against Australia, at Brisbane, in late 2013. The latter was the first Test of England's unhappy Ashes tour in 2013-14, when he passed 50 Test wickets more than six years after his debut. He was a bad, theoretical pick - England's desire for a physically threatening pace attack, and respect for his Ashes record on the previous tour of Australia, flying in the face of his mediocre county form for Surrey. England, oddly, were reported to be shocked by his pace which rarely touched 80mph - 10mph or so down on his previous trip to Australia.",
        "His ODI debut had come two years before his Test bow and he claimed four wickets in his first appearance against Bangladesh in 2005. However, another 14 matches spread over seven years brought just 11 further scalps.",
        "Across a 146-match first-class career for Hampshire and Surrey, he claimed 459 wickets at 28.66 with a career-best of 8 for 96. He also took 180 List A wickets and 75 in T20.",
        "Tremlett came from an esteemed cricketing family: son of Tim Tremlett, the former Hampshire seamer, and the grandson of Maurice, who played for Somerset and England in the 1940s and 50s. He took a wicket with his first ball of first-class cricket, against New Zealand A in 2000 and after impressing for Hampshire made the England Under-19 tour of India in 2000-01, and a place in the first batch of Rod Marsh's academy intakes in 2001-02.",
        "An impressive start to the 2004 season with Hampshire earned him a call up to England's preliminary squad for the ICC Champions Trophy, and the following year he was named in England's new 25-man development squad, ahead of the 2005 Ashes. He made his one-day debut during the 2005 NatWest Series - and was denied a hat-trick against Bangladesh only because the ball bounced off middle stump without dislodging the bails. Despite his domestic performances tailing off in the second half of the 2005 season and a suspicion that he tended to lose rhythm under pressure, Tremlett earned a call-up to the England squad for Pakistan before a hamstring injury ruled him out. It set the precedent for his international career. ",
        "After much injury disruption, he was handed his Test debut against India at Lord's. Troubling the much-vaunted Indian batting line-up with uncomfortable bounce and lively pace, he looked set to be a key man as England looked to forge a new attack after the 2005 generation. Instead injury struck once more.",
        "After missing the 2007-08 winter tours he was included in England's ODI squad to face Scotland but a heel injury ended his hopes. After a frustrating 2009 season, where he played seven Championship matches, he left Hampshire for Surrey. It was a move that worked wonders - Surrey's large squad meant he did not have to play every game - and, after taking 48 Championship wickets, he earned a recall for the Ashes tour that established his reputation as a high-class quick.",
        "There were still a few moments to remind everybody of his talent: five wickets in seven overs to inspire a turnaround victory against Gloucestershire in May 2014. His batting was also much improved as he came within ten runs of a maiden first-class hundred against Leicestershire, playing with a maturity and calmness his batting had previously lacked. His last first-class appearance came for Surrey against Glamorgan at Guildford in 2015 after which he took specialist advice to call time on his career. He was 34, a good age, but it was hard to escape the conclusion, however, that his retirement was clouded with thoughts of what might have been.",
        null
    ],
    "recent_matches": [
        {
            "Bat & Bowl": "9, 0/9",
            "Ground": "Cheam",
            "Match Date": "4 Aug 2015",
            "Opposition": "v Glouc 2nd XI",
            "Scorecard": "Other",
            "Team": "Surr 2nd XI"
        },
        {
            "Bat & Bowl": "29, 2/50, 1*, 0/20",
            "Ground": "Guildford",
            "Match Date": "15 Jun 2015",
            "Opposition": "v Glamorgan",
            "Scorecard": "FC",
            "Team": "Surrey"
        },
        {
            "Bat & Bowl": "6, 1/69, 19, 1/27",
            "Ground": "Leicester",
            "Match Date": "7 Jun 2015",
            "Opposition": "v Leics",
            "Scorecard": "FC",
            "Team": "Surrey"
        },
        {
            "Bat & Bowl": "4/58, 1, 18",
            "Ground": "Wimbledon",
            "Match Date": "1 Jun 2015",
            "Opposition": "v Hants 2nd XI",
            "Scorecard": "Other",
            "Team": "Surr 2nd XI"
        },
        {
            "Bat & Bowl": "2/38, 30, 0/15",
            "Ground": "The Oval",
            "Match Date": "10 May 2015",
            "Opposition": "v Leics",
            "Scorecard": "FC",
            "Team": "Surrey"
        },
        {
            "Bat & Bowl": "19*, 5/30",
            "Ground": "Oxford",
            "Match Date": "12 Apr 2015",
            "Opposition": "v Oxford MCCU",
            "Scorecard": "Other",
            "Team": "Surrey"
        },
        {
            "Bat & Bowl": "22, 3/105, 5*, 0/15",
            "Ground": "Leicester",
            "Match Date": "15 Aug 2014",
            "Opposition": "v Leics",
            "Scorecard": "FC",
            "Team": "Surrey"
        },
        {
            "Bat & Bowl": "1/45, 1",
            "Ground": "Birmingham",
            "Match Date": "12 Aug 2014",
            "Opposition": "v Warwickshire",
            "Scorecard": "LA",
            "Team": "Surrey"
        },
        {
            "Bat & Bowl": "4/38, 12",
            "Ground": "The Oval",
            "Match Date": "5 Aug 2014",
            "Opposition": "v Kent",
            "Scorecard": "LA",
            "Team": "Surrey"
        },
        {
            "Bat & Bowl": "1/13, 11*",
            "Ground": "The Oval",
            "Match Date": "16 Jul 2014",
            "Opposition": "v Somerset",
            "Scorecard": "T20",
            "Team": "Surrey"
        }
    ]
}