{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "1",
            "6s": "2",
            "Ave": "28.33",
            "Ct": "2",
            "HS": "51*",
            "Inns": "11",
            "Mat": "8",
            "NO": "5",
            "Runs": "170",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "1",
            "50": "15",
            "6s": "",
            "Ave": "17.35",
            "Ct": "135",
            "HS": "124*",
            "Inns": "510",
            "Mat": "374",
            "NO": "148",
            "Runs": "6283",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "38.06",
            "BBI": "3/21",
            "BBM": "3/36",
            "Balls": "2129",
            "Econ": "1.60",
            "Inns": "15",
            "Mat": "8",
            "Runs": "571",
            "SR": "141.9",
            "Wkts": "15"
        },
        {
            "": "First-class",
            "10": "18",
            "4w": "",
            "5w": "101",
            "Ave": "18.30",
            "BBI": "9/41",
            "BBM": "",
            "Balls": "81296",
            "Econ": "2.23",
            "Inns": "",
            "Mat": "374",
            "Runs": "30265",
            "SR": "49.1",
            "Wkts": "1653"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/151485.html"
    ],
    "latest_photos": [],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nApril 3, 1916, Doe Lea, Derbyshire "
        ],
        "Bowling style": [
            "Right-arm fast-medium"
        ],
        "Died": [
            "April 9, 1988, Chesterfield, Derbyshire (aged 72 years 6 days) "
        ],
        "Full name": [
            "Clifford Gladwin"
        ],
        "Major teams": [
            "England,",
            "Derbyshire"
        ]
    },
    "profile_info": [
        "\nCliff Gladwin, who died in Chesterfield on April 10, 1988, aged 72 played in one match for Derbyshire in 1939. After the war, in thirteen consecutive seasons until his retirement in 1958, he proved to be among the most consistent of bowlers, a medium-fast in-swinger, who with his friend, Leslie Jackson, made up the best opening attack possessed by any of the counties in the decade after 1947. Gladwin, whose father had appeared in a few games for Derbyshire, was determined not to allow the interruption of the war to interfere with his development. He joined the ranks of the Bradford League, whose policy was to attract the best players from all parts of the country, and by 1945 he had taken plenty of wickets in the League's main competition. An analysis of eight for 41 against Yorkshire in a two-day match at Chesterfield was further evidence of his progress, and 1946 found him better prepared than most for a full Championship season. His return of 109 wickets for an average of 18.36 soon attracted the attention of the selectors, and his chance came in the Third Test of 1947 against South Africa at Old Trafford, where he had to contend with much obdurate and defensive batting. In the tourists' first innings he conceded a mere 58 runs in 50 overs, a considerable feat of stamina in a high wind which was strong enough to overturn one of the sightscreens. He was picked for the final Test at The Oval, a match played in scorching weather and in front of large crowds sitting round the ring in the lightest permissible summer attire. In these unfamiliar surroundings, the big man from the Peak District obliged with 51 not out in England's first innings, but in 32 overs he did not take a wicket. Doubts were cast about his ability to break through at the highest level. In the meantime, he helped to reduce the Gentlemen to 25 for five in their second innings at Lord's in conditions much more to his liking. \n",
        "Such bowlers as Pollard and Coxon were preferred to him in the 1948 series against Australia, but his good form in the Championship won him a place on MCC's winter tour of South Africa under F. G. Mann. By Christmas he had become a national hero, but not for his bowling. In the First Test at Durban, in the tightest finishes, he had negotiated the leg-bye which gave England a one-wicket victory off the last ball. Eye-witnesses recall that he and his partner, Bedser, indulged in a jubilation one-step as they left the field. The tour was made, but Gladwin could manage only thirteen wickets in the five Tests at an average of 31.45. His last Test was against New Zealand at Lord's in 1949, when he came up against Martin Donnelly at his brilliant best.",
        "No longer distracted by the calls of Test cricket, Gladwin settled down to building his county career. For a time he flirted with batsmanship, narrowly missing the double in 1949 and scoring his only century, an unbeaten 124 against Nottinghamshire at Trent Bridge; but more he concentrated on developing a mean and miserly approach to his bowling, which he quickly brought to a fine art. The away match with Derbyshire was an experience which few opposing batsmen would contemplate with relish. On a green wicket, in a poor light and amid the paraphernalia of sawdust and towels, they would find themselves hemmed in by a ring of short legs, facing sharpish in-swing pitched just short of a length and on a testing line. Gladwin was apparently able to maintain his almost metronomic consistency by virtue of a short run-up, a lightness of step and a general economy in his action. He attacked from the full width of the crease and could make the occasional ball hold its line as a variant. He always gave of his best and he demanded the best from his fielders, whose occasional lapses led to a degree of intolerance which was understood and forgiven because he was such a trier.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}