{
    "batting_averages": [
        {
            "": "Tests",
            "100": "2",
            "4s": "91",
            "50": "2",
            "6s": "11",
            "Ave": "46.71",
            "Ct": "7",
            "HS": "139",
            "Inns": "16",
            "Mat": "9",
            "NO": "2",
            "Runs": "654",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "23",
            "4s": "",
            "50": "75",
            "6s": "",
            "Ave": "33.07",
            "Ct": "224",
            "HS": "243",
            "Inns": "435",
            "Mat": "255",
            "NO": "34",
            "Runs": "13262",
            "St": "0"
        },
        {
            "": "List A",
            "100": "0",
            "4s": "",
            "50": "3",
            "6s": "",
            "Ave": "15.25",
            "Ct": "11",
            "HS": "84",
            "Inns": "42",
            "Mat": "45",
            "NO": "2",
            "Runs": "610",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "9",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "1",
            "Ave": "32.03",
            "BBI": "6/59",
            "BBM": "",
            "Balls": "7033",
            "Econ": "2.70",
            "Inns": "",
            "Mat": "255",
            "Runs": "3171",
            "SR": "71.0",
            "Wkts": "99"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "2",
            "5w": "0",
            "Ave": "22.82",
            "BBI": "4/34",
            "BBM": "4/34",
            "Balls": "1351",
            "Econ": "4.15",
            "Inns": "",
            "Mat": "45",
            "Runs": "936",
            "SR": "32.9",
            "Wkts": "41"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/1065785.html",
        "http://www.espncricinfo.com/england/content/story/1044213.html",
        "http://www.espncricinfo.com/magazine/content/story/1012843.html",
        "http://www.espncricinfo.com/blogs/content/story/684257.html",
        "http://www.espncricinfo.com/magazine/content/story/281064.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=17018"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/78600/78689.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/78600/78689.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/78600/78689.icon.jpg"
    ],
    "personal_info": {
        "Also known as": [
            "Ollie"
        ],
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nOctober 23, 1941, Burnopfield, Co Durham "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "February 28, 1990, Aycliffe Village, Co Durham (aged 48 years 128 days) "
        ],
        "Full name": [
            "Colin Milburn"
        ],
        "Major teams": [
            "England,",
            "Northamptonshire,",
            "Western Australia"
        ]
    },
    "profile_info": [
        null,
        null,
        null,
        " Milburn was a heavyweight. One winter, after a rigorous course of dieting, he turned the scales at sixteen stones; he normally hovered around the eighteen-stone mark. He was the largest man to play first-class cricket in England since Warwick Armstrong in 1921, but like many large men he was light on his feet, and he never had any difficulty in positioning himself for the shot he wanted to play. Born at Burnofield, a mining village near Durham, he inherited his large frame and cricketing ability from his father, who was a big hitter in local cricket. By 1953, eleven-year-old Colin was playing in the Burnofield second team, and two years later he was batting and bowling for the senior side and representing Durham Schoolboys. By 1959, impatient to measure himself against stronger opposition, he moved to Chester-le-street, where he was a sensation: a string of spectacular performances earned him selection for Durham county against the touring Indians, and he seized on the occasion to make an impressive hundred. Warwickshire and Northamptonshire were soon competing for his services, but Ken Turner, the secretary at Northampton, with an eye for talent, was the one to snap him up. The season of 1960 was spent qualifying and learning his craft. He was encouraged to develop his natural attacking instincts by the county captain, Keith Andrew, and, going in first, he made 1,153 runs for the Second Eleven for an average of 33.91, playing a big part in their carrying off the championship. At this stage of his career, he was also a promising fast-medium bowler with a refreshingly short approach. In 1961 he was given a run in the Championship side, but needed more time for adjustment, especially against off-spinners. Back in the second team, he again passed 1,000 runs for an improved average of 43.34. A year later, however, he granted a regular place in the senior side, and his maiden hundred came at Northampton against Cambridge University. His 129 contained two sixes and nineteen fours, and with Mike Norman he put on 227 in 170 minutes for the first wicket. Such was his weight of stroke that almost 70 per cent of his runs had come in boundaries, a proportion typical of his larger innings. His other century was made on an awkward pitch at Buxton: coming in with the scoreboard reading 23 for four, he hit eighteen fours in his 102 and with Norman (58) put on 152 for the fifth wicket. The other nine batsmen scraped 13 runs between them. In 1963 he made satisfactory progress with more than 1,500 runs. Against Yorkshire at Northampton he hit 48 and,with seven sixes and fourteen fours, 123 in 113 minutes. His 100 and 88 (one six, fourteen fours) against Worrell's West Indians were both magnificent innings and helped to put the county in a winning position before rain interrupted proceedings. Later that year he went on MCC's tour of East Africa under M. J. K. Smith, enjoying himself hugely with five scores of more than 50.",
        null,
        "That winter came a new departure: he was engaged to play for Western Australia in the 1966-67 Sheffield Shield competition. The enterprise proved an enormous success both on and off the field. Milburn's jovial manner and love of his fellow human beings made him immensely popular in the dressing-room and beyond the boundary. The Australians acclaimed him. He made 571 runs in the Shield for and average of 40.79, and spectators who saw it have not forgotten his hundred in only 77 minutes at Adelaide. The following winter he went to the West Indies with Cowdrey's side, but in 1968-69, omitted from the team to Ceylon and Pakistan, he was able to play once again in Australia. This time he made a royal progress through the states, and at Brisbane he played the most extraordinary innings seen there in Shield matches. On the first day he made 243, and before he was out in the first over after tea, having scored 181 between lunch and tea, he had hit four sixes and 38 fours. He was fifth in the Australian averages that season with 940 runs at 62.66, and when England were in trouble on their riot-torn tour of Pakistan, Milburn was summoned to help out. The players formed a guard of honour as he descended from the plane. Coming into the side for the Third Test at Karachi, he gave England a marvellous start with 139, his hundred arriving off 163 balls. But it was to be his last Test innings. On the third day the match was abandoned because of the civil disturbance, and the team flew home to England. Two months later, in Northamptonshire's first match of the season, he made his final hundred, 158 against Leicestershire, just a day or two before his injury.",
        "A player who always wanted to attack, as he did, was sure to have downs as well as ups. In 1967-68 he failed to win a place in the Test side against West Indies, a setback which did not prevent him from being the liveliest member of the party. But at Lord's in 1968, against Australia, he hit a wonderful 83, one superb pull off Cowper landing high up in the Grand Stand. There were those who liked to say that he was a mere slogger. Nothing could have been further from the truth. He was fundamentally an orthodox player with a sound defence. He could drive well, but his shots square on either side of the wicket were his special hallmark. He could cut and pull with brutal power and would literally batter an attack into submission. He was only 28 when he lost his eye and there is no knowing what heights he might have reached. He and Botham, who was, appropriately, a pall-bearer at his funeral, might even have joined forces for England.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}