{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "9.63",
            "Ct": "6",
            "HS": "27",
            "Inns": "31",
            "Mat": "19",
            "NO": "12",
            "Runs": "183",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "5",
            "6s": "",
            "Ave": "9.87",
            "Ct": "206",
            "HS": "82*",
            "Inns": "587",
            "Mat": "439",
            "NO": "137",
            "Runs": "4443",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "4",
            "4w": "2",
            "5w": "9",
            "Ave": "18.63",
            "BBI": "8/59",
            "BBM": "15/99",
            "Balls": "4546",
            "Econ": "2.45",
            "Inns": "37",
            "Mat": "19",
            "Runs": "1863",
            "SR": "45.4",
            "Wkts": "100"
        },
        {
            "": "First-class",
            "10": "71",
            "4w": "",
            "5w": "218",
            "Ave": "16.81",
            "BBI": "10/30",
            "BBM": "",
            "Balls": "103546",
            "Econ": "2.43",
            "Inns": "",
            "Mat": "439",
            "Runs": "42094",
            "SR": "41.3",
            "Wkts": "2503"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/766605.html",
        "http://www.espncricinfo.com/england/content/story/306109.html",
        "http://www.espncricinfo.com/magazine/content/story/255236.html",
        "http://www.espncricinfo.com/magazine/content/story/252260.html",
        "http://www.espncricinfo.com/magazine/content/story/236531.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=9134"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/51800/51881.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/51800/51881.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/51800/51881.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMay 30, 1879, Deptford, Kent "
        ],
        "Bowling style": [
            "Slow left-arm orthodox"
        ],
        "Died": [
            "November 8, 1917, on the Forest Hall to Pimmern military railway line near Passchendaele, Belgium (aged 38 years 162 days) "
        ],
        "Full name": [
            "Colin Blythe"
        ],
        "Major teams": [
            "England,",
            "Kent"
        ]
    },
    "profile_info": [
        "\nA great slow left-armer, possessing a classical delivery and looping flight. His action was elegant and smooth, a few strides leading into a perfect upright sideways-on delivery. He pitched the ball up to encourage the drive into a strong off-side field, and with sufficient spin to trap any batsman unwise enough to try and hit against it. He varied his pace well, and was deceptive through the air, with more pace than most batsmen realised until too late. \n",
        "On the uncovered wickets before World War One, he was almost unplayable after rain, or when the pitch started to crumble. He relished the challenge of bowling to hard-hitting batsman, bringing to his art the virtue of considerable imagination - he seemed always to have something more up his sleeve. He debuted for Kent when 20 years old, and took over 100 wickets in his second season. ",
        null,
        null,
        "Blythe had all the good gifts that pertain to the first-rate slow bowler, and a certain imaginative quality that was peculiarly his own. Very rarely did he get to the end of his resources. To see him bowl to a brilliant hitter was a sheer delight. So far from being disturbed by a drive to the ring he would, instead of shortening his length to escape punishment, send up the next ball to be hit, striving of course to put on, if possible, a little extra spin. In this respect he reminded me of David Buchanan in the Gentlemen and Players matches of long ago. Blythe's spin was something quite out of the ordinary. On a sticky wicket or on a dry pitch ever so little crumbled he came off the ground in a way that beat the strongest defence. He had, too, far more pace than most people supposed. The ball that went with his arm often approached the speed of a fast bowler and had of course the advantage of being unsuspected. On this point Fred Huish, the wicket-keeper, can be very illuminating.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}