{
    "batting_averages": [
        {
            "": "Tests",
            "100": "1",
            "50": "7",
            "6s": "0",
            "Ave": "52.26",
            "Ct": "6",
            "HS": "102",
            "Inns": "18",
            "Mat": "11",
            "NO": "3",
            "Runs": "784",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "21",
            "50": "55",
            "6s": "",
            "Ave": "30.74",
            "Ct": "102",
            "HS": "226",
            "Inns": "427",
            "Mat": "245",
            "NO": "32",
            "Runs": "12145",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "11",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "76.00",
            "BBI": "2/22",
            "BBM": "",
            "Balls": "424",
            "Econ": "5.37",
            "Inns": "",
            "Mat": "245",
            "Runs": "380",
            "SR": "84.8",
            "Wkts": "5"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdencricketer/content/story/213861.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154672.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/210300/210357.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/210300/210357.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nAugust 28, 1905, Bedlinog, Glamorgan, Wales "
        ],
        "Died": [
            "December 23, 1992, Neath, Glamorgan, Wales (aged 87 years 117 days) "
        ],
        "Full name": [
            "Cyril Frederick Walters"
        ],
        "Major teams": [
            "England,",
            "Glamorgan,",
            "Wales,",
            "Worcestershire"
        ]
    },
    "profile_info": [
        "\nCyril Walters, who died in Neath on Dec 23, at the age of 87, was a model of elegance at the crease, wrists well oiled, forearms brisk as a fencer's, feet nimble. In the 1930s there was no finer sight among batsmen; and his home ground was the aptly beautiful greensward of Worcester. \n",
        "He was Welsh-born, in Bedlinog, on Aug 28, 1905, and attracted early attention as a schoolboy at cricket around Neath and as a Swansea rugby player. His first-class debut for Glamorgan came in 1923, when he was only 17, but progress was slow. By 1928 he was averaging no more than 17, with two hundreds to his credit, and the announcement of his early retirement for `business reasons' was read with sadness.",
        "Immediately, however, he reappeared at Worcester as club secretary and amateur batsman, adopting a more natural style, and aspiring to the captaincy in 1931. That winter he toured Jamaica with Tennyson's side, and by 1933 he was ready for Test cricket.",
        null,
        "At the end of the season he went with Jardine's side to India, enchanting the crowds with his graceful strokeplay and finishing second to his captain in the overall averages. At Bombay's Gymkhana Ground he scored 78 and 14 not out as England won the opening Test; at Eden Gardens, Calcutta, again opening with Yorkshire's Arthur Mitchell, he made 29 and 2 not out in a drawn match; and in the final Test, at Madras, he crowned his tour with 59 and 102, opening with Bakewell and contributing much towards an England victory sealed by the spin of Verity and Langridge.",
        "It was no surprise when he was chosen to play for England against Australia as the 1934 rubber began, but a little unexpected that he should find himself as captain in this maiden Ashes Test, R. E. S. Wyatt having sustained a broken thumb. Walters scored 17 and 46 in a losing cause, but held his place for Lord's, when Wyatt resumed the captaincy. Again starting England's innings with Sutcliffe, the slender Walters made a handsome 82 (some film of which survives) before O'Reilly's googly forced a catch at leg. Verity- and rain - cured an innings victory for England their last against Australia at Lord's to date) after centuries by Leyland and Ames.",
        " ",
        " Walters continued to make it a memorable series by stroking 52 and 50 not out in the drawn Manchester Test and 44 and 45 at Leeds. A 64 followed at The Oval, where England were crushed by 562 runs in the Ashes decider, Ponsford and Bradman putting on 451 for Australia's second wicket. Walters was bowled by McCabe for 1 in England's anti-climactic final innings, to finish with 401 runs at 50.13, this against two of the most testing bowlers of all time, Grimmett and O'Reilly. It also happened to mark the end of Walters' Test career. In his 11 matches for England he had cut and driven and glided 784 runs at a highly creditable 52.27, 12 of his 18 innings passing 40. By comparison, his overall first-class average was no more than 30.75.",
        "It was a great loss to the game when, at 30, he announced a final retirement. He had been Worcestershire's secretary from 1928 to 1935 and captain 1931-35. Now, health grounds and marriage contributed to the departure of Cyril Frederick Walters from the game he had adorned.",
        "A quiet, gently, courteous man, he continued unobtrusively to watch cricket over the years, latterly exuding an attractive vagueness which lifted when he concentrated his mind to such subjects as Douglas Jardine: `I never understood the fellow.' As he reflected on the 1933-34 Indian tour, he recalled that Jardine, during the tour, `seemed always to have a large book tucked under his arm'. He recalled how his captain had walked into a reception in which an uncle was lined up with the Indian officials: `He had the same huge nose as Douglas. Douglas just walked straight past him.'",
        " Cyril Walters had great respect for Indian fast bowler Amar Singh, to whom he mainly played back: ` Douglas lunged forward and got out second ball, saying afterwards that he was sick of watching me play back all the time.' It is a lovely little story, except that there seems no record of Jardine ever having been bowled by Amar Singh while batting with Walters.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}