{
    "batting_averages": [
        {
            "": "Tests",
            "100": "6",
            "50": "12",
            "6s": "8",
            "Ave": "42.81",
            "Ct": "12",
            "HS": "195",
            "Inns": "66",
            "Mat": "37",
            "NO": "6",
            "Runs": "2569",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "76",
            "50": "176",
            "6s": "",
            "Ave": "42.67",
            "Ct": "212",
            "HS": "251*",
            "Inns": "906",
            "Mat": "592",
            "NO": "107",
            "Runs": "34101",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "33.00",
            "BBI": "1/25",
            "BBM": "1/25",
            "Balls": "36",
            "Econ": "5.50",
            "Inns": "2",
            "Mat": "37",
            "Runs": "33",
            "SR": "36.0",
            "Wkts": "1"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "44.14",
            "BBI": "2/8",
            "BBM": "",
            "Balls": "474",
            "Econ": "3.91",
            "Inns": "",
            "Mat": "592",
            "Runs": "309",
            "SR": "67.7",
            "Wkts": "7"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/1015323/the-roles-they-played",
        "http://www.espncricinfo.com/wisdencricketer/content/story/266566.html",
        "http://www.espncricinfo.com/wisdencricketer/content/story/238586.html",
        "http://www.espncricinfo.com/ci/content/story/133363.html",
        "http://www.espncricinfo.com/newzealand/content/story/124914.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=22322"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/042004/051590.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042004/051590.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042004/051590.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nDecember 6, 1914, Barrow, Clitheroe, Lancashire "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "April 27, 1999, Sale, Cheshire (aged 84 years 142 days) "
        ],
        "Full name": [
            "Cyril Washbrook"
        ],
        "Major teams": [
            "England,",
            "Lancashire"
        ]
    },
    "profile_info": [
        "\nCyril Washbrook, who died on April 27, 1999, aged 84, was an always staunch and sometimes brilliant opening batsman for  Lancashire and  England. He flourished either side of the Second World War, and his name will for ever be paired in history with that of  Len Hutton, with whom he opened for  England 51 times. Their average partnership was 60, which from this distance seems like unparalleled riches, although they played in often perilous times for  England. In the popular imagination, he is remembered for two other things. One was his comeback in 1956 when, as a selector, he made a dramatic return to the Test team, aged 41. The other was the jaunty angle of his cap which hinted at a carefree nature. In fact, he was a diffident man, and he masked this by acquiring a rather forbidding exterior as he gained authority. \n",
        null,
        " Washbrook was born in Barrow, near Clitheroe, but his family moved to Shropshire. From Bridgnorth Grammar School, he might have gone to either Warwickshire or Worcestershire or, since he had many gifts, Wolves or West Bromwich Albion. But when he arrived at  Old Trafford, the old opener Harry Makepeace, now coach, took him under his wing as his protégé and successor. After his brilliant start, however,  Washbrook fell back somewhat and it was 1935 before he finally established himself in the side, hitting 1,724 runs and coming fifth in the national averages. He was still dropped once from the side in 1936, to Cardus's disgust. A year later he made his  England debut, alongside  Denis Compton, at  The Oval against  New Zealand in  1937. But he made only nine and eight not out, and missed the opportunity for the then infinitely greater honour of a Test against  Australia the following year.",
        "In the war,  Washbrook was a PT instructor in the RAF, and he was 30 before he was at last able to fulfil his destiny. In  Australia in  1946-47, he and  Hutton had three successive century stands, and  Washbrook emerged as one of the recognisable cricketers of a heroic cricketing age:  the chin, always square and thrust out a little, wrote Cardus,  the square shoulders, the pouting chest, the cock of cricket cap, his easy loose movement, his wonderful swoop at cover and the deadly velocity of his throw in. The tensing of his shoulders as he prepared to face the bowling, the preliminary champing of his feet - every sign of determined awareness, every sign of combined attack and defence, his mind ready to signal swiftly either to infantry, cavalry, or for cover behind the sand bags.",
        null,
        null
    ],
    "recent_matches": [
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}