{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "17",
            "50": "1",
            "6s": "0",
            "Ave": "20.83",
            "BF": "269",
            "Ct": "12",
            "HS": "59",
            "Inns": "7",
            "Mat": "4",
            "NO": "1",
            "Runs": "125",
            "SR": "46.46",
            "St": "1"
        },
        {
            "": "ODIs",
            "100": "0",
            "4s": "12",
            "50": "0",
            "6s": "1",
            "Ave": "14.71",
            "BF": "390",
            "Ct": "17",
            "HS": "23*",
            "Inns": "20",
            "Mat": "21",
            "NO": "6",
            "Runs": "206",
            "SR": "52.82",
            "St": "4"
        },
        {
            "": "First-class",
            "100": "10",
            "4s": "",
            "50": "73",
            "6s": "",
            "Ave": "26.44",
            "BF": "",
            "Ct": "961",
            "HS": "145",
            "Inns": "647",
            "Mat": "459",
            "NO": "119",
            "Runs": "13961",
            "SR": "",
            "St": "138"
        },
        {
            "": "List A",
            "100": "1",
            "4s": "",
            "50": "19",
            "6s": "",
            "Ave": "20.68",
            "BF": "",
            "Ct": "411",
            "HS": "103*",
            "Inns": "341",
            "Mat": "429",
            "NO": "78",
            "Runs": "5439",
            "SR": "",
            "St": "36"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "4",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "ODIs",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "21",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "34.22",
            "BBI": "3/25",
            "BBM": "",
            "Balls": "582",
            "Econ": "3.17",
            "Inns": "",
            "Mat": "459",
            "Runs": "308",
            "SR": "64.6",
            "Wkts": "9"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "18",
            "Econ": "5.66",
            "Inns": "",
            "Mat": "429",
            "Runs": "17",
            "SR": "-",
            "Wkts": "0"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/australia-v-england-2017/content/story/1128452.html",
        "http://www.espncricinfo.com/magazine/content/story/1124909.html",
        "http://www.espncricinfo.com/magazine/content/story/1073364.html",
        "http://www.espncricinfo.com/magazine/content/story/941145.html",
        "http://www.espncricinfo.com/england/content/story/374355.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=8954"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/227000/227033.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/227000/227033.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/227000/227033.icon.jpg"
    ],
    "personal_info": {
        "Also known as": [
            "Bluey"
        ],
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nSeptember 1, 1951, Horton, Bradford, Yorkshire "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "January 5, 1998, Marton-cum-Grafton, Yorkshire (aged 46 years 126 days) "
        ],
        "Education": [
            "Hanson Grammar School, Bradford"
        ],
        "Fielding position": [
            "Wicketkeeper"
        ],
        "Full name": [
            "David Leslie Bairstow"
        ],
        "Major teams": [
            "England,",
            "Griqualand West,",
            "Yorkshire"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nDavid Bairstow was found hanged at his home on January 5, 1998. He was 46. Reports said he had been suffering from depression: his wife was ill, he had financial troubles, he faced a drink-driving charge and was in pain from his own injuries. The news stunned cricket, especially as Bairstow had always seemed the most indomitable and least introspective of men, and led to much comment on the problems faced by retired sportsmen. \n",
        "David \"Bluey\" Bairstow was not merely the Yorkshire wicketkeeper but almost the embodiment of the country's cricket throughout the 1970s and 1980s. He arrived in county cricket amid a blaze of publicity when he was drafted from grammar school in Bradford into the Yorkshire side as an 18-year-old on the day he sat an English Literature A-level. He was allowed to sit the exam at 7am, then went out and caught five Gloucestershire batsmen over the next three days. From then on, he was a regular, and while Yorkshire's affairs swirled turbulently around him, Bairstow was always there: loud, combative, combustile. \"He wasn't a great wicketkeeper and he wasn't a great batsman,\" said his team-mate Phil Carrick, \"but he was a great cricketer.\"",
        "His fighting qualities overrode any technical deficiencies, and he did equal a world record by taking 11 catches against Derbyshire at Scarborough in 1981. But he was at his best when batting in one-day games when victory was improbable but just short of impossible: in the Benson and Hedges Cup at Derby in 1981, he was joined by Mark Johnson, the No. 11 and a debutant, with Yorkshire 80 short of victory. Bairstow hit nine sixes in an innings that left everyone on the ground aghast; Yorkshire won with Bairstow on 103, and Johnson 4. He was picked for the Oval Test against India in 1979, made a brisk 59 in the second innings, and went to Australia for the post-Packer tour that winter. Though Bob Taylor played in the Tests, Bairstow was a regular in the one-day games, and played a succession of small but vital innings. Most famously, Graham Stevenson walked out to join him at the SCG with 35 wanted from six overs. \"Evening, lad,\" said Bairstow. \"We can piss this.\" Which they duly did.",
        "He played two more Tests the following summer, and one on the 1980-81 tour of the West Indies, but he could not force his way into the team again. In 1984, he became captain of Yorkshire, after Geoff Boycott's supporters had seized control of the club. With the rest of Yorkshire torn asunder, depending on whether they worshipped Boycott or loathed him, Bairstow seemed the last man to believe he was still leading a normal cricket team. His three years of captaincy were, in Derek Hodgson's words, \"a series of uphill cavalry charges\". The attack was appallingly weak - his main tactic was to shout \"C'mon Arn\" at his weary spearhead Sidebottom - but Bairstow's sheer willpower saved Yorkshire from utter collapse; indeed, having been bottom of the Championship the year before he took over, they improved slightly in each of his seasons in charge.",
        "He was perhaps the only unequivocally popular man in Yorkshire. Bairstow believed he could intimidate the bowling simply by announcing that he was going to whack the ball back over the bowler's head, and often enough he kept his promise. His wicketkeeping, never beautiful but usually efficient, seemed to deteriorate at the same time, possibly because his insecurity kept him playing through injuries that should have been rested. When he was appointed, the committee had wanted him to play only as a batsman. But he refused, causing Steve Rhodes to move to Worcestershire.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}