{
    "batting_averages": [
        {
            "": "Tests",
            "100": "3",
            "50": "6",
            "6s": "1",
            "Ave": "37.80",
            "Ct": "12",
            "HS": "119",
            "Inns": "33",
            "Mat": "22",
            "NO": "2",
            "Runs": "1172",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "45",
            "50": "75",
            "6s": "",
            "Ave": "43.51",
            "Ct": "194",
            "HS": "239*",
            "Inns": "395",
            "Mat": "230",
            "NO": "31",
            "Runs": "15838",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "22",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "44.00",
            "BBI": "1/5",
            "BBM": "",
            "Balls": "120",
            "Econ": "4.40",
            "Inns": "",
            "Mat": "230",
            "Runs": "88",
            "SR": "60.0",
            "Wkts": "2"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/1073693/doth-protest-too-little",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/1062861/initial-fascination",
        "http://www.espncricinfo.com/blogs/content/story/968993.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/245246.html",
        "http://www.espncricinfo.com/wisdencricketer/content/story/208921.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=20159"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/91200/91287.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/91200/91287.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/91200/91287.icon.jpg"
    ],
    "personal_info": {
        "Also known as": [
            "The Right Reverend Lord David Sheppard"
        ],
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMarch 6, 1929, Reigate, Surrey "
        ],
        "Bowling style": [
            "Slow left-arm orthodox"
        ],
        "Died": [
            "March 5, 2005, England (aged 75 years 364 days) "
        ],
        "Full name": [
            "David Stuart Sheppard"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Sussex"
        ]
    },
    "profile_info": [
        "\nDavid Sheppard was an England batsman who became an ordained minister and rose to become the Bishop of Liverpool. A graceful driver, Sheppard came to the fore on Cyril Coote's pluperfect batting pitches at Fenner's. For the strong Cambridge University side of 1950 Sheppard (227) and John Dewes (183) shared an opening stand of 343 against the West Indian tourists - in response Everton Weekes hammered an unbeaten 304 out of 730 for 3 after Cambridge declared at 594 for 4. Later, in front of Sheppard's home-county crowd at Hove, he and Dewes (212) improved on that with a stand of 349 against Sussex. \n",
        "Such form won Sheppard a place in the 1950 Test Trial, a match rather ruined by Jim Laker, who found the Bradford pitch to his liking and bowled out The Rest for 27 before lunch on the first day, taking 8 for 2. Sheppard only made 4, but he did escape Laker's clutches (Trevor Bailey got him instead). But he was in the selectors' thoughts, and made his debut in the final Test of the summer, scoring 29 and 11 at The Oval as England lost again to go down 3-1 to West Indies. Sheppard toured Australia that winter, with Freddie Brown's young but outgunned side, and played in three of the Tests with little success. He fell out of favour for a time, but returned in 1952 with 119, his first Test century, in the final Test against India at The Oval. The following year he captained Sussex, and spirited them up to second in the table, equalling their best performance until that long-awaited first Championship triumph in 2003. He also led England in two Tests in 1954, but Len Hutton returned to take charge of the Ashes tour in Australia.",
        "It was two years before Sheppard, by now an ordained minister, returned to the Test side, scoring 113 in Laker's Match at Old Trafford. It was the middle one of an impressive hat-trick of hunches from the selectors - Cyril Washbrook (who actually was one of the selectors) was brought back for the third Test, his first for five years, and scored 98 after England had been 17 for 3; then in the final Test at The Oval Denis Compton made a comeback after a knee operation and made 94.",
        "Sheppard continued to make occasional appearances for Sussex, and in 1960 he refused to captain the Duke of Norfolk's XI against the touring South Africans in protest against the apartheid regime.  But his Test days appeared to be behind him - until 1962, when there was some debate about who should captain England on that winter's Ashes tour. Ted Dexter was the man in possession, but Colin Cowdrey captained in one Test against Pakistan that summer, and the waters were further muddied when Sheppard emerged from semi-retirement. He scored 112 for the Gentlemen against the Players at Lord's and then, in his next match, 83 in the fourth Test. He was heavily tipped for the captaincy in Australia - but in the end it went to Dexter.",
        "Sheppard did go to Australia for his second tour there, and scored 113 in the second Test at Melbourne, and 66 in the fifth at Sydney. In between, some fallible catching irked Fred Trueman, who reportedly advised him to keep his hands together a bit more often in the field. Another possibly apocryphal story has Sheppard eventually clinging on to a spectacular catch in the outfield, and showing the ball to the crowd who had been hooting his errors ... only for Fred Titmus to run over from his fielding position and ask for the ball back \"as it was a no-ball and they've already run five\".",
        "Sheppard wrapped up his first-class career with the three Tests that followed in New Zealand. He finished with 1172 runs (37.80) in 22 Tests, and 15,838 runs in all first-class cricket at the useful average of 43.51, with 45 centuries.",
        null,
        "He kept in touch with cricket over the years, being one of the main voices opposing the South African tour in the apartheid days of 1970 (and being disappointed that previous friendships were ruptured by his views), while in 1995 he gave an entertaining speech at the annual launch dinner of the Wisden Cricketers' Almanack.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}