{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "1",
            "6s": "0",
            "Ave": "32.00",
            "Ct": "1",
            "HS": "57",
            "Inns": "4",
            "Mat": "2",
            "NO": "0",
            "Runs": "128",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "32",
            "50": "116",
            "6s": "",
            "Ave": "31.65",
            "Ct": "382",
            "HS": "225",
            "Inns": "753",
            "Mat": "443",
            "NO": "63",
            "Runs": "21843",
            "St": "5"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "2",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "1",
            "Ave": "36.70",
            "BBI": "5/37",
            "BBM": "",
            "Balls": "1516",
            "Econ": "2.90",
            "Inns": "",
            "Mat": "443",
            "Runs": "734",
            "SR": "75.8",
            "Wkts": "20"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154664.html"
    ],
    "latest_photos": [],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nJanuary 24, 1907, Somercotes, Derbyshire "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "September 12, 1979, Derby (aged 72 years 231 days) "
        ],
        "Fielding position": [
            "Wicketkeeper"
        ],
        "Full name": [
            "Denis Smith"
        ],
        "Major teams": [
            "England,",
            "Derbyshire"
        ]
    },
    "profile_info": [
        null,
        "Denis Smith died suddenly at Derby on September 12, aged 72. Born at Somercotes on January 24, 1907, he played for Derbyshire from 1927 until 1951. He was then appointed county coach in succession to Harry Elliott, making a solitary appearance in 1952 in an emergency and finally ending his 44-year connection with the club in 1971, though he was quietly scouting until last year. By 1930 he had developed into a reliable left-handed batsman, scoring 83 and 105 in Payton's benefit match at Trent Bridge. In the next match, his 107 at The Oval was largely responsible for Derbyshire's first victory against Surrey for 26 years. At this time he was opening the innings, and although he dropped down the order at times over the years, he is best remembered as an opener. His ability in this direction was to bring something rare to Derbyshire- success. In four consecutive seasons, Derbyshire were twice third, runners-up in 1935 (which from a playing point of view was a better year than 1936) and champions in 1936.",
        null,
        "Following his 189 against Yorkshire at Chesterfield in the opening match of 1935, an innings he considered marked the turning point of his career, came his highest score of 225 versus Hampshire on the same ground, when he sustained a broken rib which caused his absence from the first Test that Year. In 1937 he made 202 not out at Trent Bridge. During the war, he played in the Bradford League and took up wicketkeeping, acting in this capacity for Derbyshire for part of 1946 and 1947 until the arrival of George Dawkes. His usual place in the field was first slip, and it was not unknown for him to bowl an over or two of right-arm medium pace. As county coach he was hard to please, and no doubt he chastened some with his blunt approach. But when words of praise did fall from his lips, the pupil knew they were truly earned.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}