{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "18.83",
            "Ct": "1",
            "HS": "42",
            "Inns": "13",
            "Mat": "7",
            "NO": "7",
            "Runs": "113",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "20",
            "6s": "",
            "Ave": "14.61",
            "Ct": "221",
            "HS": "87*",
            "Inns": "852",
            "Mat": "647",
            "NO": "197",
            "Runs": "9574",
            "St": "0"
        },
        {
            "": "List A",
            "100": "0",
            "50": "0",
            "6s": "",
            "Ave": "13.00",
            "Ct": "9",
            "HS": "22",
            "Inns": "17",
            "Mat": "37",
            "NO": "9",
            "Runs": "104",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "1",
            "5w": "0",
            "Ave": "42.66",
            "BBI": "4/72",
            "BBM": "7/165",
            "Balls": "2078",
            "Econ": "2.21",
            "Inns": "13",
            "Mat": "7",
            "Runs": "768",
            "SR": "115.4",
            "Wkts": "18"
        },
        {
            "": "First-class",
            "10": "38",
            "4w": "",
            "5w": "194",
            "Ave": "18.65",
            "BBI": "9/30",
            "BBM": "",
            "Balls": "159043",
            "Econ": "2.01",
            "Inns": "",
            "Mat": "647",
            "Runs": "53303",
            "SR": "55.6",
            "Wkts": "2857"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "1",
            "5w": "0",
            "Ave": "21.26",
            "BBI": "4/11",
            "BBM": "4/11",
            "Balls": "2070",
            "Econ": "2.52",
            "Inns": "",
            "Mat": "37",
            "Runs": "872",
            "SR": "50.4",
            "Wkts": "41"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/360696.html",
        "http://www.espncricinfo.com/england/content/story/312919.html",
        "http://www.espncricinfo.com/england/content/story/217240.html",
        "http://www.espncricinfo.com/ci/content/story/134424.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154582.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/072002/037688.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/072002/037688.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/072002/037688.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nAugust 12, 1924, Todmorden, Yorkshire "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "September 27, 2007 (aged 83 years 46 days) "
        ],
        "Full name": [
            "Derek Shackleton"
        ],
        "Major teams": [
            "England,",
            "Dorset,",
            "Hampshire"
        ],
        "Other": [
            "Umpire, Coach"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nA model of consistency, accuracy and endurance, Derek Shackleton plied his trade for Hampshire for 21 seasons - perhaps only Wilfred Rhodes and Fred Titmus bowled more ball in first-class cricket, and they were spinners. John Arlott described his bowling as \"shrewdly varied, and utterly accurate\u008a beating down\nas unremittingly as February rain\". He took more than 100 wickets in 20 consecutive summers, and his career average dropped season by season. One of the most respected bowlers of his generation, his domestic record was superb, 2857 wickets at an average of 18.65, conceding just over two runs per over. He was unfortunate to play only seven Tests, in two series separated by more than a\ndecade - perhaps the selectors were more impressed by the more spectacular bowling of those with more pace. It is fair to say, however,  that he appeared less effective in his Test appearances - his 18 wickets were  uncharacteristically expensive. He toured India in 1951-52, and despite being the top-wicket taker on tour, was not selected for the Tests. His best performance in Tests was at Lord's in 1963 where he took seven wickets - but his role in that thrilling match will be best remembered for his last-over run out that brought the injured Colin Cowdrey in to see out the draw. \n",
        "He bowled more balls and took more wickets for Hampshire than anyone else before or since. His best bowling of 9 for 30 was achieved against Warwickshire in 1960, and he took nine wickets in an innings three more times. In 1955 he took eight Somerset wickets for just four runs, his full figures being 11.1-7-4-8 (he took 6 for 25 in the second innings, giving him his best match figures of 14 for 29). Against Leicestershire in 1950 he produced the astonishing sequence w.w.ww..w - five wickets in nine balls (not including a hat-trick, one of the few bowling feats to elude him in his career).",
        "Born in Tormoden on the Lancashire-Yorkshire border, he came to the notice of Hampshire when playing Services cricket after the war. Recruited as a batsman who bowled occasional legspin, he was asked to try his hand at pace bowling as Hampshire desperately sought opening bowlers. He took 21 wickets in his\nfirst season, nearly did the double in his second (taking 100 wickets), and thereafter his bowling went from strength to strength as his batting declined. His method was text-book - a 12 step run led to a side-one effortless delivery with the arm high. He rarely strove for pace- although he was faster than he looked - and bowled straight, and to a good length. Scoring runs against\nhim involved risk -  if the ball was missed, it was more than likely to hit the stumps. He originally bowled mostly in-swing, but soon developed an out-swinger; both deliveries swung late, and moved just enough to catch the edge. Added to movement in the air was the ability to make the ball deviate off the seam, a leg\ncutter, a clever yorker, and a slower ball that was spun like an off-break. A tireless worker, he was devastating in conditions that suited him, but would bowl all day without giving away a thing on batsman's wickets.",
        "After retirement from active cricket he went to Canford School in Dorset as coach and groundsman,retiring in 1990. He had a brief spell as a first-class umpire in 1979.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}