{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "2",
            "6s": "0",
            "Ave": "22.73",
            "Ct": "14",
            "HS": "62",
            "Inns": "30",
            "Mat": "17",
            "NO": "4",
            "Runs": "591",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "4",
            "50": "39",
            "6s": "",
            "Ave": "20.61",
            "Ct": "268",
            "HS": "117",
            "Inns": "608",
            "Mat": "351",
            "NO": "64",
            "Runs": "11217",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "3",
            "Ave": "22.55",
            "BBI": "7/40",
            "BBM": "8/63",
            "Balls": "2456",
            "Econ": "1.87",
            "Inns": "26",
            "Mat": "17",
            "Runs": "767",
            "SR": "72.2",
            "Wkts": "34"
        },
        {
            "": "First-class",
            "10": "14",
            "4w": "",
            "5w": "66",
            "Ave": "14.52",
            "BBI": "9/39",
            "BBM": "",
            "Balls": "43468",
            "Econ": "1.90",
            "Inns": "",
            "Mat": "351",
            "Runs": "13799",
            "SR": "45.7",
            "Wkts": "950"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155609.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/072004/053294.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMay 28, 1851, Barrow Bridge, Bolton, Lancashire "
        ],
        "Bowling style": [
            "Left-arm medium"
        ],
        "Died": [
            "July 31, 1919, Stanley Park, Blackpool, Lancashire (aged 68 years 64 days) "
        ],
        "Full name": [
            "Richard Gorton Barlow"
        ],
        "Major teams": [
            "England,",
            "Lancashire"
        ],
        "Other": [
            "Umpire"
        ]
    },
    "profile_info": [
        "\nDick Barlow was a dour and resolute opening batsman who was the first to really use forward play defensively, and was so passionate about the game that he continued playing club cricket well into his sixties as well as being a capable umpire who stood in one Test in 1899.  Hard to dismiss, Barlow is remembered for his association with fellow Lancashire opener Albert Hornby, who was his antithesis with the bat, and they were immortalised in one of the game's most famous  poems by Francis Thompson: \n",
        null,
        "He also developed into a very good slow-medium left-armer with \nimmaculate length, clever variation, and a good eye for batsmen's weaknesses. He took a wicket with his first ball in first-class cricket and took four first-class hat-tricks.  He carried his bat 11 times, including a two-hour innings of 5 not out (made out of 69) against Nottinghamshire in 1882.  ",
        "Barlow toured Australia three times, playing in every match on each occasion,\nand he also played against Australia seven times at home. Although\nhis highest Test score was only 62, Barlow played several valuable\ndefensive innings in difficult circumstances. As a bowler he was more successful; his 7 for 44 at Manchester in 1886 was a match-winning performance. Playing for North of England against the Australian tourists in 1884 he took 10 wickets in the match, and then made a superb hundred (one of only four first-class centuries in his career) against Spofforth at his best. For the Players in the same year he captured a remarkable hat-trick of Gentlemen - WG, Shuter and Read falling to successive deliveries. ",
        null,
        null
    ],
    "recent_matches": [
        {},
        {}
    ]
}