{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "1",
            "6s": "0",
            "Ave": "12.80",
            "Ct": "5",
            "HS": "87",
            "Inns": "15",
            "Mat": "8",
            "NO": "0",
            "Runs": "192",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "74",
            "50": "180",
            "6s": "",
            "Ave": "33.63",
            "Ct": "326",
            "HS": "259",
            "Inns": "1159",
            "Mat": "643",
            "NO": "59",
            "Runs": "37002",
            "St": "0"
        },
        {
            "": "List A",
            "100": "0",
            "50": "0",
            "6s": "",
            "Ave": "11.80",
            "Ct": "1",
            "HS": "42",
            "Inns": "10",
            "Mat": "10",
            "NO": "0",
            "Runs": "118",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "8",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "187.00",
            "BBI": "1/8",
            "BBM": "",
            "Balls": "206",
            "Econ": "5.44",
            "Inns": "",
            "Mat": "643",
            "Runs": "187",
            "SR": "206.0",
            "Wkts": "1"
        },
        {
            "": "List A",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "10",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/358080.html",
        "http://www.espncricinfo.com/ci/content/story/131324.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154561.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/052004/052537.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/052004/052537.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/052004/052537.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMay 15, 1924, Wordsley, Staffordshire "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "November 12, 1996, Worcester (aged 72 years 181 days) "
        ],
        "Full name": [
            "Donald Kenyon"
        ],
        "Major teams": [
            "England,",
            "Worcestershire"
        ]
    },
    "profile_info": [
        null,
        " Kenyon was a professional, but he assumed the captaincy without difficulty at a time (1959) when amateurs still were preferred. He was not only a shrewd and observant cricketer, but he never felt compromised by too close an intimacy with his fellow wage-earning players. Authoritative and, where necessary, enterprising, he later said, `I did not need to crack the whip. I was a determined sort of chap and if I said something they knew I would stick to it.'",
        "Born in Wordsley, Staffs on May 15, 1924, he was educated at Audnam Senior School, and played for Worcestershire Club & Ground as a teenager while with Stourbridge in the Birmingham League. Having served as a fitter in the RAF during the war, he later moved from the motor trade into the steel stockholding business, the job security probably helping him to maintain his willingness to play strokes. His cover-drive was never bettered for power and placement, while his leg-side play was noted for its sweetness of timing. The dark-haired youngster, ruddy of complexion, learned much from watching the footwork of the veteran Bob Wyatt and Len Hutton.",
        "Having made a pair against Worcestershire for the RAF in 1946, and then a century for Combined Services, Kenyon was engaged by the county and never looked back. Nineteen times he passed 1000 runs in a season, seven times passing 2000, with 2636 (51.68) in 1954 his best. That year he and Laddie Outschoorn put in 277 for the first wicket against Kent at Gravesend.",
        "In 1956 he made the highest of his seven double-centuries, 259 at Kidderminster, which was the best score registered against Yorkshire this century. He had carried his bat for 103 not out against Hampshire at Bournemouth the previous summer, when he played in the last of his eight Test matches for England.",
        "His poor Test record is usually attributed to a failing of temperament at the demanding level. His 15 innings yielded only 192 runs at 12.80. Eleven times he failed to reach 10, and at Lord's his four Test innings produced only eight runs. He did, however have an 87 against South Africa at Trent Bridge in 1955 to treasure, when he and Tom Graveney launched England's only innings with a stand of 91. Kenyon, missed at 1 and 61, finished top scorer in the match.",
        "It was unlucky for him that in the next Test, at Lord's the pitch was green, and deemed by oldtimers to be the fastest since before the First World War. The first ball, from Heine to Kenyon, just short of a length, sailed well over his head, like the opening delivery from Ambrose in the notorious Edgbaston Test of 1995. Kenyon edged a ball from Adcock into his stumps when 1. The absence of a sightscreen at the pavilion end was conceivably a factor. Goddard had him lbw for 2 in the second innings. Twin failures in the Old Trafford Test marked the end of a very disappointing Test career.",
        "It had started on the 1951-52 MCC tour of India, Pakistan and Ceylon. Batting mainly in the middle order, Kenyon made 35 at Delhi on Test debut before being sunk by a Shinde googly, having put on 70 with Jack Robertson. But his other five innings were unproductive, and Phadkar bowled him for a duck at Calcutta to dispatch him from the series. A century in the match against Hyderabad was some consolation.",
        " ",
        "His greatest England opportunity came in Coronation Year, 1953, when England pressed Australia throughout the summer until Ashes victory came at The Oval. Kenyon, though, did not survive beyond the first two Tests. Opening with Len Hutton after a stylish and timely 122 for Worcestershire against the tourists, he was defeated three times in four innings by Ray Lindwall's pace and movement.",
        " Kenyon's county career remained prolific, and the progress made by his club culminated in the joyous Championship success of 1964. Flavell and Coldwell led the attack, backed by Standen, Carter and Brain, with Gifford, Horton and Slade providing the spin, with the competent Roy Booth behind the stumps. Graveney made 2375 runs in all Worcestershire's matches, and Ron Headley, Martin Horton, Kenyon and Dick Richardson easily passed 1000. A 32-year-old from South Africa, Basil D'Oliveira, had just been signed by the county and would help them retain the pennant next year, though Kenyon's own contribution with the bat was modest.",
        " Don Kenyon became an England selector in 1965, and ironically was involved in the shambles over the non-selection and second-thought selection of D'Oliveira for the South African tour that never happened in 1968-69. When he stepped down in 1972 he could look back on a period in which England won 22 Tests and lost only eight, and won and retained the Ashes.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}