{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "3",
            "50": "0",
            "6s": "0",
            "Ave": "13.50",
            "Ct": "1",
            "HS": "38",
            "Inns": "4",
            "Mat": "2",
            "NO": "0",
            "Runs": "54",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "13",
            "4s": "",
            "50": "30",
            "6s": "",
            "Ave": "30.84",
            "Ct": "74",
            "HS": "156*",
            "Inns": "215",
            "Mat": "139",
            "NO": "13",
            "Runs": "6231",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "2",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "8.33",
            "BBI": "2/0",
            "BBM": "",
            "Balls": "52",
            "Econ": "2.88",
            "Inns": "",
            "Mat": "139",
            "Runs": "25",
            "SR": "17.3",
            "Wkts": "3"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154736.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/100400/100473.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMay 12, 1894, Sutton, Surrey "
        ],
        "Died": [
            "January 5, 1960, Marylebone, London (aged 65 years 238 days) "
        ],
        "Full name": [
            "Donald John Knight"
        ],
        "Major teams": [
            "England,",
            "Oxford University,",
            "Surrey"
        ],
        "Other": [
            "Coach"
        ]
    },
    "profile_info": [
        "\nDonald John Knight, the former Surrey and England batsman, died in London on January 5 at the age of 65. He was generally regarded as one of the most accomplished amateurs of the period immediately following the first world war, his gracefulness at the crease marking him as a model amongst batsmen.\nHe was born on May 12, 1894, and while a schoolboy at Malvern attained a wide and deserved reputation as a prolific scorer with an especially mature defence. He was in the school XI as an opening batsman for the five years from 1909 to 1913, during which time he scored 2,860 runs at an average of 46.88, and captained the side in his last two years. He showed his early prowess by playing an innings of 211 against H. K. Foster's XI in 1911, and two years later scored 122 and 133 not out in the match against Old Malvernians, both wonderful feats for a boy still at school. He was barely 15 when he appeared for Surrey 11 (and scored 53) in 1909, and two seasons later made his debut for Surrey in first-class cricket. \n",
        "He gained his blue as a Freshman at Oxford in 1914, and played the highest and best innings of the University match that year. The war cut into his career at a time when he promised greatness, and even as a soldier he played wonderful cricket in minor matches, including a double-century at the Oval in 1916. It was the-return to first-class cricket in 1919 that saw Knight at his very best. In that golden summer, towards the end of which he assumed the captaincy of Surrey, he shared many fine opening stands with J. B. Hobbs, and scored as many as seven centuries. Two came in one match against Yorkshire at the Oval, and he immediately followed this with another hundred against Lancashire at Old Trafford. On his debut for the Gentlemen against Players he scored 71 and 124 at Lord's. He opened the innings for England in two of the Tests against Australia in 1921, but his great days in the first-class game were behind him, possibly due to a terrible blow he received on the bead while fielding at Hastings the year before.",
        "After 1924 he played little big cricket until he was persuaded to rejoin the Surrey side in 1937, when he was still good enough to reach a century in less than two hours against Hampshire at the Oval. Altogether in first-class cricket he scored 6,231 runs, including 13 centuries, at an average of 30.84, his highest score being 156 not out for Free Foresters against Oxford University at Oxford in 1925. In lesser cricket he performed wonderful feats for Oxford Harlequins, Old Malvernians and Sutton, and he holds the record for the highest score ever made on the present Wimbledon ground with 205 not out for Sutton in 1926. As far on as 1947, at the age of 53, he was able to score 111 for M.C.C. against Eton.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}