{
    "batting_averages": [
        {
            "": "Tests",
            "100": "1",
            "50": "10",
            "6s": "0",
            "Ave": "48.00",
            "Ct": "26",
            "HS": "127",
            "Inns": "33",
            "Mat": "22",
            "NO": "6",
            "Runs": "1296",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "35",
            "50": "72",
            "6s": "",
            "Ave": "46.83",
            "Ct": "188",
            "HS": "214",
            "Inns": "378",
            "Mat": "262",
            "NO": "61",
            "Runs": "14848",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "6",
            "Econ": "10.00",
            "Inns": "1",
            "Mat": "22",
            "Runs": "10",
            "SR": "-",
            "Wkts": "0"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "1",
            "Ave": "31.10",
            "BBI": "6/28",
            "BBM": "",
            "Balls": "2582",
            "Econ": "3.46",
            "Inns": "",
            "Mat": "262",
            "Runs": "1493",
            "SR": "53.7",
            "Wkts": "48"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/england/content/story/1153512.html",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/985953/captains--chronicles",
        "http://www.espncricinfo.com/magazine/content/story/754587.html",
        "http://www.espncricinfo.com/magazine/content/story/697733.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/564480.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=15481"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/213600/213673.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/213600/213673.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/213600/213673.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nOctober 23, 1900, Malabar Hill, Bombay (now Mumbai), Maharashtra, India "
        ],
        "Bowling style": [
            "Legbreak"
        ],
        "Died": [
            "June 18, 1958, Montreux, Switzerland (aged 57 years 238 days) "
        ],
        "Full name": [
            "Douglas Robert Jardine"
        ],
        "Major teams": [
            "England,",
            "Oxford University,",
            "Services,",
            "Surrey"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        "The son of MR Jardine, himself an Oxford Blue, Douglas Jardine was born at Bombay and educated at Winchester, where he was in the XI for three years, being captain in the last, 1919, when he headed the batting figures with 997 runs, average 66.46. Going up to New College, Oxford, he got his Blue as a Freshman and played against Cambridge in 1920, 1921 and  1923 without achieving anything out of the ordinary. He missed the 1922 University match because of a damaged knee. In 1923 he began to play for Surrey and in 1932 took over the captaincy from PGH Fender.",
        "He went to  Australia in 1928-29 with the MCC team under APF Chapman, taking part in all five Test matches. To England's success by 12 runs in the fourth Test he made a big contribution when scoring 98 and sharing with WR Hammond in a third-wicket partnership of 262. He also enjoyed the distinction of hitting three centuries in successive innings, against Western Australia, Victoria and New South Wales.",
        "Four years later he captained the MCC side in Australia in what was probably the most controversial tour in history. England won four of the five Tests, but it was the methods they employed rather than the results which caused so much discussion and acrimony. H. Larwood and W. Voce, the Nottinghamshire fast bowlers, exploited leg-theory, or what came to be known as body-line bowling to a packed leg-side field. The Australians and others considered this means of attack placed batsmen at a grave disadvantage because they had either to risk being struck on the head or body by persistently short-pitched balls or, if they attempted to play them, were virtually certain to be caught by the close-set field.",
        "Strongly-worded cables passed between the Australian Board of Control, who asserted that Bodyline bowling has assumed such proportions as to menace the best interests of the game, making protection of the body the main consideration, and the MCC. The Australians threatened to call off the projected tour of England in 1934. MCC at length agreed that a form of bowling which is obviously a direct attack by the bowler upon the batsman would be an offence against the spirit of the game. Jardine always defended his tactics and in a book he wrote about the tour described allegations that the England bowlers directed their attack with the intention of causing physical harm as stupid and patently untruthful.",
        "Finally in 1934 MCC issued a ruling:  That the type of bowling regarded as a direct attack by the bowler upon the batsman, and therefore unfair, consists in persistent and systematic bowling of fast and short-pitched balls at the batsman standing clear of his wicket. That was the end of body-line bowling.",
        "Meanwhile in 1933, however, fast leg-theory had been employed by both England and the West Indies in the second Test match at Old Trafford. Jardine, who always held that this type of attack could be successfully countered by a resolute batsman, set out to prove the accuracy of his contention. For nearly five hours he faced the hostile pace of LN Constantine and EA Martindale and he hit 127, his first and only century in a Test match. In the process, he took much physical punishment, but The Iron Duke, as he was sometimes called, had proved his point to his own satisfaction.",
        "Jardine captained the MCC team in India the following winter, but thereafter his appearances on the field became fewer till in 1937 he dropped out of first-class cricket altogether. At the same time he maintained his interest in the game, being President of the Oxford University CC from 1955 to 1957 and making occasional contributions to the Press. In 1953 he became the first President of the Association of Cricket Umpires.",
        "Six feet tall, he possessed a very strong defence and was specially skilful in on-side strokes. In 22 Test match appearances he hit 1296 runs, average 48, and held 26 catches. During his career his runs numbered 14,821, average 46.90, the highest of his 35 centuries being 214 not out against Tasmania in 1928-29. Extremely proud of his Oxford associations, he always wore a Harlequin cap.",
        "Tributes included:",
        null,
        null,
        null,
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}