{
    "batting_averages": [
        {
            "": "Tests",
            "100": "3",
            "50": "5",
            "6s": "1",
            "Ave": "58.52",
            "Ct": "10",
            "HS": "173",
            "Inns": "19",
            "Mat": "12",
            "NO": "2",
            "Runs": "995",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "50",
            "50": "64",
            "6s": "",
            "Ave": "49.95",
            "Ct": "256",
            "HS": "333",
            "Inns": "333",
            "Mat": "205",
            "NO": "23",
            "Runs": "15485",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "6",
            "Econ": "7.00",
            "Inns": "1",
            "Mat": "12",
            "Runs": "7",
            "SR": "-",
            "Wkts": "0"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "48.03",
            "BBI": "4/49",
            "BBM": "",
            "Balls": "1835",
            "Econ": "4.39",
            "Inns": "",
            "Mat": "205",
            "Runs": "1345",
            "SR": "65.5",
            "Wkts": "28"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/714423.html",
        "http://www.espncricinfo.com/blogs/content/story/644227.html",
        "http://www.espncricinfo.com/bodyline/content/story/316173.html",
        "http://www.espncricinfo.com/magazine/content/story/301425.html",
        "http://www.espncricinfo.com/ci/content/story/133777.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=11951"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/117000/117013.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/117000/117013.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/117000/117013.icon.jpg"
    ],
    "personal_info": {
        "Also known as": [
            "Jawansinhji Jadeja Duleepsinhji, Smith"
        ],
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJune 13, 1905, Sarodar, Kathiawar, India "
        ],
        "Bowling style": [
            "Legbreak"
        ],
        "Died": [
            "December 5, 1959, Bombay (now Mumbai), Maharashtra, India (aged 54 years 175 days) "
        ],
        "Full name": [
            "Kumar Shri Duleepsinhji"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Hindus,",
            "Sussex"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        "His career with Sussex, whom he captained in 1932, began in 1926 and he headed the county averages in every season until 1932, when doctors advised him not to take further part in cricket. In 1930 he hit 333 in five and a half hours against Northamptonshire at Hove, which still stands as the highest individual innings played for Sussex and the beat the biggest put together by his famous uncle, KS Ranjitsinhji -- 285 not out against Somerset at Taunton in 1901; three times he reached three figures in each innings of a match, 246 and 115 v. Kent at Hastings in 1929, 116 and 102 not out v. Middlesex and 125 and 103 not out for Gentlemen v. Players, both at Lord's the next summer; and in 1931 he registered 12 centuries, four of them in successive innings.",
        "He made 12 appearances for England and in his first against Australia in 1930 he obtained 173. Of this display a story is told that, when Prince Duleepsinhji was at last caught in the long field from a rash stroke, his uncle remarked: \"He always was a careless lad.\" His one tour abroad was with the MCC team in New Zealand and Australia in 1929-30, when he scored more runs than any other member of the side. A. H. H. Gilligan, the captain, rated him the best player of slow bowling on a wet pitch that he ever saw. \"Duleep\" had to withdraw from the team for DR Jardine's \"bodyline\" tour of 1932-33.",
        "He joined the Indian foreign service in 1949 and became High Commissioner for India in Australia and New Zealand. Upon returning to India in 1953 he was appointed chairman of the public service commission in the State of Saurashtra.",
        null,
        null,
        "Yet in the brief career that he was able to enjoy; he proved himself an artist with the bat, an enchanting batsman of impeccable technique, as elegant as he was successful, and revealing an innate quality of batsmanship to the most\nsearching connoisseur.",
        "Prince Duleepsinhji was born in India on June 13, 1905,and as a nephew of the famous Ranjitsinhji, it was as if he were destined from birth for greatness on the cricket field. He was sent for his education to England and made his mark as a player of distinction while still a boy at Cheltenham College, where he was in the XI from 1921 to 1923, being considered the best schoolboy batsman of the year in his final season when he was captain: he then played an innings of 108 for Lord's Schools against the Rest, and: his prowess, not unnaturally, so delighted his uncle that Ranji approached Sussex with a view that his nephew might appear for his former county. In the following year, 1924, Duleep made his debut in first-class cricket and played his first match for Sussex, thus beginning his brief but glorious career, in which his genuine charm as a man was as much a feature as his brilliant merits as a cricketer. He was universally popular throughout his playing days and was affectionately known as \"Smith,\" and for all the adulation that was heaped upon him he remained essentially modest and retiring, revelling much more in a well-played innings of 30 than in a centuryof easy acquisition.",
        "It was the word and reputation of his uncle that he revered in particular, and he considered his own batting-gifted as it was-a mere shadow of that of the great Ranji: Sussex, indeed, were fortunate in possessing both of these batsmen, each at the height of his power. Duleepsinhji played for Cambridge from 1925 until 1928, but it was during his university career that illness first struck at his cricket. Early in 1927 he scored the highest innings ever made for Cambridge  - 254 not out against Middlesex at Fenner's-following which he fell seriously ill and played no more that season. Suffering from a pulmonary disease, he was obliged to spend the winter in Switzerland. he returned to England, and with restored health was a more formidable batsman than ever.",
        "In each of the seasons from 1928 to 1931 he increased his aggregate, exceeding 2,500 runs in each of the last three years.      In 1929 he was chosen to play in the first of his 12 Test matches for England, and in the winter of that year visited Australia and New Zealand under his Sussex captain, A. H. H. Gilligan.    At Hastings in 1929 he performed one of the most outstanding feats in county cricket by taking 115 and 246 off the Kent attack, both innings being scored at well over a run a minute.",
        "In 1930, a golden year for him, his feats were memorable indeed. In his first innings that year at Hove, he established a ground record with a magnificent 333 scored in a single day against Northamptonshire - the biggest score ever made for Sussex, exceeding the record of his uncle. At Lord's in 1930 his performances were quite phenomenal. For Sussex against Middlesex he scored a century in each innings and in the following month repeated the feat for the Gentlemen against Players. He scored a memorable 173 in the Test match against Australia (this was his Test debut against Australia), while for M.C.C. in May he had hit the Australians for 92.",
        "In 1931, when he took over the captaincy of Sussex, he scored four centuries in successive innings, and in 1932 - which was to be his final season - he almost led Sussex to the top of the table. Illness struck again and cruelly ended\nhis career. For Sussex alone he scored 9,178 runs, including 35 centuries, at an average of 51.56. His supple wrists drove and cut brilliantly; his lithe figure, speed of foot and quick ness of eye made each of his innings a thing of beauty.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}