{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "4",
            "50": "0",
            "6s": "0",
            "Ave": "18.00",
            "BF": "96",
            "Ct": "1",
            "HS": "36",
            "Inns": "2",
            "Mat": "1",
            "NO": "0",
            "Runs": "36",
            "SR": "37.50",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "5",
            "4s": "",
            "50": "44",
            "6s": "",
            "Ave": "18.66",
            "BF": "",
            "Ct": "369",
            "HS": "192*",
            "Inns": "555",
            "Mat": "314",
            "NO": "18",
            "Runs": "10025",
            "SR": "",
            "St": "1"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "1",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "2",
            "4w": "",
            "5w": "17",
            "Ave": "20.37",
            "BBI": "10/69",
            "BBM": "",
            "Balls": "13441",
            "Econ": "2.77",
            "Inns": "",
            "Mat": "314",
            "Runs": "6213",
            "SR": "44.0",
            "Wkts": "305"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/887027.html",
        "http://www.espncricinfo.com/magazine/content/story/305408.html",
        "http://www.espncricinfo.com/magazine/content/story/210588.html",
        "http://www.espncricinfo.com/cricketer/content/story/139425.html",
        "http://www.espncricinfo.com/ci/content/story/75863.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=13420"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/122004/057079.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/122004/057079.icon.jpg"
    ],
    "personal_info": {
        "Also known as": [
            "The Coroner"
        ],
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nNovember 28, 1841, Downend, Bristol "
        ],
        "Died": [
            "May 20, 1911, Park House, Thornbury, Gloucestershire (aged 69 years 173 days) "
        ],
        "Full name": [
            "Edward Mills Grace"
        ],
        "Major teams": [
            "England,",
            "Gloucestershire"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nEdward Mills Grace died on May 20 after a long illness at his residence, Park House, Thornbury, Gloucestershire. But for the accident that his own brother proved greater than himself, E. M. Grace would have lived in cricket history as perhaps the most remarkable player the game has produced. Barring W.G., it would be hard indeed to name a man who was a stronger force on a side or a more remarkable match winner. Primarily, he was a batsman, but his value in an eleven went far beyond his power of getting runs. As a fieldsman at point--at a time when that position was far more important than it is in modern cricket--he never had an equal, and, though he did not pretend to be a first-rate bowler, he took during his career thousands of wickets. In his young days he bowled in the orthodox round-arm style, but his success in club cricket was gained by means of old-fashioned lobs. Fame came to him early in life. Born on November 28th, 1841, he made his first appearance at Lord's in 1861, and a year later he was beyond question the most dangerous bat in England. It was in the Canterbury Week in 1862 that, playing as an emergency for the M.C.C. against the Gentlemen of Kent, he scored 192 not out, and took all ten wickets in one innings. This was a 12 a-side and one man was absent in the second innings when he got the ten wickets. He reached his highest point as a batsman in 1863, scoring in all matches that year over 3,000 runs. \n",
        "After the season was over he went to Australia as a member of George Parr's famous team, but it cannot be said that in the Colonies he did all that was expected of him. He was handicapped by a bad hand, but, as he himself stated, there was another reason for his comparative lack of success. At the start of the tour he fell into rather a reckless style of batting, and, try as he would, he could not get back to his proper method. Still, he did some good things, scoring, for example, 106 not out in a single-wicket match. He had not been back in England more than two years before W.G., as a lad of eighteen, began to put him in the shade. The two brothers were in the Gentlemen's eleven together in 1865--W. G.'s first year in the representative match--and had a share in gaining for the Gentlemen their first victory at Lord's since 1853. While he was qualifying as a surgeon E. M. Grace to a certain extent dropped out of first-class cricket, but he came very much to the front again on the formation of the Gloucestershire County Club in 1871. He was secretary from the start, and held his post without a break till his resignation in 1909.",
        "In Gloucestershire's early days he renewed the successes of his youth, batting especially well in August 1872, when W.G. was away in Canada with the amateur eleven captained by the late R. A. Fitzgerald. It is matter of common knowledge that chiefly through the efforts of the three Graces--G. F. died in 1880-- Gloucestershire rose to the top of the tree, being champion county in 1876 and again in 1877. Not till the first Australian team played at Clifton in 1878 did the Gloucestershire eleven know what it was to be beaten at home. One of the greatest triumphs of E. M. Grace's career came in 1880, when, strictly on his merits, he was picked to play for England at the Oval in the First Test Match with Australia in this country. After an extraordinary game England won by five wickets, the task of getting 57 runs in the last innings against Palmer and Boyle costing the side five of their best batsmen. E. M. and W. G. opened England's first innings, and scored over 90 runs together. W. G. made 152, and in Australia's second innings W. L. Murdoch just beat him by scoring 153 not out. Never has a finer match been seen.",
        " E. M. Grace continued to play for Gloucestershire for many years, dropping out of the eleven after the season of 1894. Thenceforward his energies were devoted to club cricket, chiefly in connection with his own team at Thornbury. Lameness gradually robbed him of his old skill as a run-getter, but even in 1909, 119 wickets fell to his lobs. As a batsman E. M. Grace was unorthodox. Partly, it is thought, through using a full-sized bat while still a small boy, he never played with anything like W. G.'s perfect straightness, but his wonderful eye and no less wonderful nerve enabled him to rise superior to this grave disadvantage. He was perhaps the first right-handed batsman of any celebrity who habitually used the pull. In his young days batting was a very strict science, but he cared little for rules. If an open place in the field suggested runs the ball soon found its way in that direction. Personally, E. M. was the cheeriest of cricketers--the life and soul of the game wherever he played. It was a great misfortune that he could never be induced to write his recollections of the cricket field. His good stories could be numbered by the hundred, and in conversation he told them with immense vivacity.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}