{
    "batting_averages": [
        {
            "": "Tests",
            "100": "2",
            "4s": "77",
            "50": "3",
            "6s": "6",
            "Ave": "30.43",
            "BF": "1278",
            "Ct": "11",
            "HS": "130",
            "Inns": "24",
            "Mat": "16",
            "NO": "1",
            "Runs": "700",
            "SR": "54.77",
            "St": "0"
        },
        {
            "": "ODIs",
            "100": "11",
            "4s": "533",
            "50": "39",
            "6s": "166",
            "Ave": "37.64",
            "BF": "7163",
            "Ct": "76",
            "HS": "124*",
            "Inns": "195",
            "Mat": "208",
            "NO": "26",
            "Runs": "6362",
            "SR": "88.81",
            "St": "0"
        },
        {
            "": "T20Is",
            "100": "0",
            "4s": "127",
            "50": "9",
            "6s": "77",
            "Ave": "28.71",
            "BF": "1310",
            "Ct": "34",
            "HS": "85*",
            "Inns": "74",
            "Mat": "76",
            "NO": "14",
            "Runs": "1723",
            "SR": "131.52",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "11",
            "4s": "",
            "50": "23",
            "6s": "",
            "Ave": "34.81",
            "BF": "9501",
            "Ct": "72",
            "HS": "209*",
            "Inns": "156",
            "Mat": "95",
            "NO": "16",
            "Runs": "4874",
            "SR": "51.29",
            "St": "1"
        },
        {
            "": "List A",
            "100": "19",
            "4s": "",
            "50": "59",
            "6s": "",
            "Ave": "37.50",
            "BF": "11337",
            "Ct": "115",
            "HS": "161",
            "Inns": "310",
            "Mat": "335",
            "NO": "40",
            "Runs": "10125",
            "SR": "89.30",
            "St": "0"
        },
        {
            "": "T20s",
            "100": "0",
            "4s": "428",
            "50": "28",
            "6s": "233",
            "Ave": "25.85",
            "BF": "4306",
            "Ct": "125",
            "HS": "90",
            "Inns": "245",
            "Mat": "259",
            "NO": "32",
            "Runs": "5507",
            "SR": "127.89",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "16",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "ODIs",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "208",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "T20Is",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "76",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "45.00",
            "BBI": "2/24",
            "BBM": "2/24",
            "Balls": "102",
            "Econ": "5.29",
            "Inns": "",
            "Mat": "95",
            "Runs": "90",
            "SR": "51.0",
            "Wkts": "2"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "42",
            "Econ": "7.00",
            "Inns": "",
            "Mat": "335",
            "Runs": "49",
            "SR": "-",
            "Wkts": "0"
        },
        {
            "": "T20s",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "259",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/1154615.html",
        "http://www.espncricinfo.com/ci/content/story/1154157.html",
        "http://www.espncricinfo.com/ci/content/story/1153152.html",
        "http://www.espncricinfo.com/blogs/content/story/1152816.html",
        "http://www.espncricinfo.com/ci/content/story/1152395.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=24598"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/279300/279384.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/279300/279384.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/279300/279384.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nSeptember 10, 1986, Dublin "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Current age": [
            "31 years 342 days"
        ],
        "Education": [
            "Catholic University School"
        ],
        "Fielding position": [
            "Occasional wicketkeeper"
        ],
        "Full name": [
            "Eoin Joseph Gerard Morgan"
        ],
        "Height": [
            "\n5 ft 9 in "
        ],
        "Major teams": [
            "England,",
            "Ireland,",
            "Bangalore Royal Challengers,",
            "Barbados Tridents,",
            "England A,",
            "Ireland A,",
            "Ireland Under-19s,",
            "Karachi Kings,",
            "Kings XI Punjab,",
            "Kolkata Knight Riders,",
            "Middlesex,",
            "Middlesex 2nd XI,",
            "Peshawar Zalmi,",
            "Sir Paul Getty's XI,",
            "Sunrisers Hyderabad,",
            "Sydney Thunder"
        ],
        "Nickname": [
            "Moggie"
        ],
        "Playing role": [
            "Middle-order batsman"
        ]
    },
    "profile_info": [
        "\nEoin Morgan ascended to the England one-day captaincy in slightly chaotic circumstances less than two months out from the 2015 World Cup and was less than enamoured with an entirely inadequate campaign. What he observed convinced him more than ever that an entirely new approach was necessary in England's limited-overs cricket with a policy of No Fear (and for that matter No Retribution) at its heart. It required a man of strong will not just to say it, but to implement it, but Morgan did so, seeking to fashion a side that would play with courage and be impervious to pressure or criticism. \n",
        "Morgan's self-sufficiency and independent thought has caused him to tread a path that has not always been popular with English administrators. He wanted to reject county cricket for IPL long before it became officially sanctioned. Although he strove for a while to play for England in all three formats, he played the last of his 16 Tests against Pakistan in the UAE in 2012 and his interest in the longer format waned once he recognised he had little chance of a recall. A somewhat private man, with strong convictions, he is respected by his players for his inner strength, cool temperament and tactical nous but remains largely a closed book to those outside the dressing room.",
        "Once the selectors had decided to dispense with Alastair Cook, Morgan, the regular deputy, was the most obvious candidate.  Ironically, his elevation to the captaincy coincided with one of his worst periods of form since switching to England from Ireland. He had long been considered one of England's most bankable limited-overs performers without ever quite winning over worldwide opinion. A left-hander who quickly built a reputation for inventive and audacious strokeplay, Morgan also possessed the patience and power of shot to be a natural \"finisher\" - a role England struggled to fill for a decade. In some ways, he was a prototype, encouraging the English game to adopt a more inventive approach only subsequently to face up to the challenge that his own game might be overtaken by more highly-powered models.",
        "As a young man in Dublin, Morgan was immediately recognised as a cricketer of rare unorthodox talent, who plays the ball exceptionally late and is adroit both at sweeping and reverse sweeping. This has been attributed to Morgan playing hurling as a young boy, though the player has said it is the result of hours of hard work. Time at Dulwich College only hardened his desire as a teenager to play for England, which he never tried to hide back in Ireland.",
        "Morgan made his Ireland debut at the age of 16, making 99 against Scotland in Ayr, and was soon signed by Middlesex, who gave him his debut a week after his 19th birthday. He floundered in the 2007 World Cup: batting at No. 3, he made only 91 runs in nine games. He soon established himself in the Middlesex line up, especially in limited overs cricket, and his switch to England was long anticipated. After securing Ireland's qualification for the 2011 World Cup, in April 2009, he was immediately called up by England, thereby denying Ireland the chances to pick him in the World T20 and beyond. Having spent huge sums on developing Morgan as a young cricketer, Ireland had reason to feel aggrieved, but it was a reflection of the problems Ireland would face unless they were afforded Test status and regular ODIs against Full Members.",
        "Morgan wasted no time in endearing himself to his new cricketing country. At the age of 23, he shot to prominence on the back of two match-winning innings against South Africa. First was a 34-ball 67 in the Champions Trophy in September 2009, followed two months later with an unbeaten 45-ball 85 in the opening Twenty20 of England's tour of South Africa. His bold approach and crisp hitting evoked comparisons with arrival of another English import, Kevin Pietersen, in 2005.",
        "His growing stature was confirmed when he was the only England player to be awarded a new contract at the auction for the third season of the IPL in January 2010. He was signed for $220,000 by Bangalore, where he joined England team-mate Pietersen. With much expected he failed to make an impression and was soon left on the bench. But he returned to his best for England in the subsequent World Twenty20 in the Caribbean as his powerful shot-making and coolness under pressure helped him to 183 runs and helped England to their first triumph in global limited-overs events. With three ODI hundreds that year, his first for England coming against Bangladesh in Dhaka, his reputation was soaring.",
        "It was enough to prove he had the mettle to take his game a step higher and despite a modest first-class record he was rewarded with a surprise call-up to the Test side for England's first Test of the 2010 summer, against Bangladesh. Walking out to bat at 258 for 4, he could not have asked for a gentler introduction and showed enough confidence to pick up his first Test boundary with a reverse-sweep. With the retirement of Paul Collingwood, a permanent space opened up in England's Test side.",
        "Morgan pipped Ravi Bopara for selection for the first Test of the English summer in 2011, despite playing in the IPL while Bopara grafted in the County Championship (three years later, after England's tortured Ashes whitewash, Morgan made a similar sacrifice but was also overlooked). His preparation proved no hindrance as Morgan made 362 runs in 10 innings against Sri Lanka and India. But a disastrous tour of the UAE followed, with just 180 runs at 16.36 across three Tests, four ODIs and three T20s against Pakistan and he was dropped from England's touring party to Sri Lanka in March 2012.",
        "He remained an indispensable member of the one-day side, although from September 2012 he went a year and 17 innings without an ODI half-century, which included only averaging 21 in the Champions Trophy. The run ended when Morgan thumped a century against his old team-mates to deny Ireland victory over England. An outstanding ODI tour of Australia followed in 2013-14, including a century at Brisbane, but Morgan's form then tailed off again: by the time he was appointed captain, he had scored one fifty in 19 innings, with only the occasional sparkle in T20 to evoke former glories. He had developed a curious crouching stance in his anxiety to get underneath the ball for maximum leverage and had to eradicate it from his game.",
        "The captaincy, it was hoped, would revive him - and his average was in the 70s as Cook's stand-in - but his experience of leading Middlesex in 2014, when the county won five out of 22 limited-overs matches, did not encourage instant excitement. After England's failed 2015 World Cup campaign, he led a refashioned England one-day approach, advocating a braver, more attacking philosophy. It brought obvious benefits, but his international summer finished unhappily when he was concussed by the Australian fast bowler Mitchell Starc at Old Trafford. But he had become the face of a brasher England and when he made his 10th one-day hundred for England, against South Africa at Headingley in 2017, only Marcus Trescothick and Joe Root had made as many.",
        null
    ],
    "recent_matches": [
        {
            "Bat & Bowl": "16",
            "Ground": "Hove",
            "Match Date": "17 Aug 2018",
            "Opposition": "v Sussex",
            "Scorecard": "T20",
            "Team": "Middlesex"
        },
        {
            "Bat & Bowl": "77*",
            "Ground": "Lord's",
            "Match Date": "16 Aug 2018",
            "Opposition": "v Essex",
            "Scorecard": "T20",
            "Team": "Middlesex"
        },
        {
            "Bat & Bowl": "16",
            "Ground": "Beckenham",
            "Match Date": "12 Aug 2018",
            "Opposition": "v Kent",
            "Scorecard": "T20",
            "Team": "Middlesex"
        },
        {
            "Bat & Bowl": "36",
            "Ground": "Bristol",
            "Match Date": "9 Aug 2018",
            "Opposition": "v Gloucs",
            "Scorecard": "T20",
            "Team": "Middlesex"
        },
        {
            "Bat & Bowl": "1",
            "Ground": "Richmond",
            "Match Date": "5 Aug 2018",
            "Opposition": "v Glamorgan",
            "Scorecard": "T20",
            "Team": "Middlesex"
        },
        {
            "Bat & Bowl": "0",
            "Ground": "The Oval",
            "Match Date": "3 Aug 2018",
            "Opposition": "v Surrey",
            "Scorecard": "T20",
            "Team": "Middlesex"
        },
        {
            "Bat & Bowl": "90",
            "Ground": "Lord's",
            "Match Date": "2 Aug 2018",
            "Opposition": "v Sussex",
            "Scorecard": "T20",
            "Team": "Middlesex"
        },
        {
            "Bat & Bowl": "10",
            "Ground": "Taunton",
            "Match Date": "29 Jul 2018",
            "Opposition": "v Somerset",
            "Scorecard": "T20",
            "Team": "Middlesex"
        },
        {
            "Bat & Bowl": "2",
            "Ground": "Lord's",
            "Match Date": "26 Jul 2018",
            "Opposition": "v Hampshire",
            "Scorecard": "T20",
            "Team": "Middlesex"
        },
        {
            "Bat & Bowl": "4, 3",
            "Ground": "Lord's",
            "Match Date": "22 Jul 2018",
            "Opposition": "v Warwickshire",
            "Scorecard": "FC",
            "Team": "Middlesex"
        }
    ]
}