{
    "batting_averages": [
        {
            "": "Tests",
            "100": "3",
            "50": "6",
            "6s": "2",
            "Ave": "55.00",
            "Ct": "2",
            "HS": "122",
            "Inns": "20",
            "Mat": "14",
            "NO": "2",
            "Runs": "990",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "102",
            "50": "191",
            "6s": "",
            "Ave": "45.46",
            "Ct": "296",
            "HS": "256*",
            "Inns": "961",
            "Mat": "648",
            "NO": "106",
            "Runs": "38874",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "3",
            "Econ": "4.00",
            "Inns": "1",
            "Mat": "14",
            "Runs": "2",
            "SR": "-",
            "Wkts": "0"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "57.66",
            "BBI": "3/33",
            "BBM": "",
            "Balls": "421",
            "Econ": "4.93",
            "Inns": "",
            "Mat": "648",
            "Runs": "346",
            "SR": "70.1",
            "Wkts": "6"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/375242.html",
        "http://www.espncricinfo.com/wisdencricketer/content/story/347943.html",
        "http://www.espncricinfo.com/magazine/content/story/101949.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154734.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/062004/053045.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nFebruary 5, 1889, Roe Green, Worsley, Lancashire "
        ],
        "Died": [
            "May 5, 1962, Rhos-on-Sea, Denbighshire, Wales (aged 73 years 89 days) "
        ],
        "Full name": [
            "George Ernest Tyldesley"
        ],
        "Major teams": [
            "England,",
            "Lancashire"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nErnest Tyldesley, the former Lancashire and England batsman and a member of the well-known Lancashire cricketing family, died at his home at Rhos-on-Sea, North Wales, on May 5, at the age of 73. Though never one of the giants of the game and rarely aspiring to brilliance of style, he established himself - especially\nduring the 1920s-as one of the pillars of Lancashire cricket, so that his final total of runs and centuries in first-class cricket has remained unsurpassed by any Lancashire player. \n",
        "He was born at Roe Green, Lancashire, on February 5, 1889, and as a boy benefited from the guidance and tuition of his elder brother, the great J. T. Tyldesley. Although he eventually scored more runs than his brother-indeed, at a better average, too - Ernest suffered somewhat by comparison with \"J.T.\", who\nhad, of course, already performed heroically in the \"Golden Age\" before Ernest gained a regular place in county cricket. He made his debut for Lancashire\nin 1909 and progressed but modestly until the First World War, but on the resumption of cricket in 1919 he advanced to the head of the Lancashire averages\nand began to show that consistent reliability that was to characterise his many seasons in the game. Not always happy at the commencement of an innings, his\npatience and the soundness of his defence often brought their reward in big scores. Seven times he made a double-century for Lancashire and twice scored a\nhundred in each innings of a match. On six occasions - the last time in his forty-sixth year - he passed 2,000 runs in the season, and in 1928 he amassed 3,024 runs at an average of 79.57: that summer he hit ten centuries, which he had also done in 1926, no Lancastrian either before or since having twice achieved that target.",
        "He played in fourteen Tests for England, in this country and in Australia and South Africa, hitting centuries at Johannesburg, Durban and Lord's: in fact,\nit was not often that he failed in Tests, scoring in all 990 runs at an average of 55. He twice toured South Africa, in 1924-25 and in 1927-28, both visits proving highly successful for him, the matting wickets emphasising what a highly resourceful and accomplished batsman he was. Following his great summer in 1928,\nhe toured Australia with A. P. F. Chapman's talented side, but was chosen for only one Test. He also toured Jamaica with great success under the Hon. L. H.\nTennyson in the spring of 1927.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}