{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "1",
            "6s": "1",
            "Ave": "16.28",
            "Ct": "4",
            "HS": "85*",
            "Inns": "9",
            "Mat": "5",
            "NO": "2",
            "Runs": "114",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "24",
            "50": "67",
            "6s": "",
            "Ave": "32.84",
            "Ct": "192",
            "HS": "236",
            "Inns": "465",
            "Mat": "301",
            "NO": "51",
            "Runs": "13598",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "38.00",
            "BBI": "1/10",
            "BBM": "1/10",
            "Balls": "108",
            "Econ": "4.22",
            "Inns": "4",
            "Mat": "5",
            "Runs": "76",
            "SR": "54.0",
            "Wkts": "2"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "4",
            "Ave": "33.67",
            "BBI": "6/16",
            "BBM": "",
            "Balls": "18297",
            "Econ": "3.12",
            "Inns": "",
            "Mat": "301",
            "Runs": "9531",
            "SR": "64.6",
            "Wkts": "283"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/133912.html",
        "http://www.espncricinfo.com/ci/content/story/125048.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155480.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154663.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/57100/57159.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/57100/57159.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/57100/57159.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nAugust 21, 1905, Calcutta (now Kolkata), Bengal, India "
        ],
        "Died": [
            "August 16, 1960, Marylebone, London (aged 54 years 361 days) "
        ],
        "Full name": [
            "Errol Reginald Thorold Holmes"
        ],
        "Major teams": [
            "England,",
            "Oxford University,",
            "Surrey"
        ]
    },
    "profile_info": [
        null,
        "Born at Calcutta on August 21, 1905, Holmes soon showed an aptitude for cricket at Andrew's School, Eastbourne before becoming one of the greatest cricketers Malvern has produced. Coached by Charles Toppin, he was in the school eleven for four years, 1921-24, and at 16 had a batting average of 60 as well as heading the bowling averages. Definitely fast for a schoolboy, he took all ten wickets in an innings for 36 runs. The next year, when captain, a strain hampered him in bowling but his batting improved out of all knowledge and, scoring 730 runs, he averaged 60.83 per innings. After being captain of cricket for his last two years, he went up to Oxford, promptly gained his Blue and for three seasons was a prominent member of the side, being captain in his final year. He also gained his Association football Blue as a centre-forward and in due course captained the side.",
        "Although having one or two triumphs with his medium-fast bowling, it was by his batting that Holmes made such a fine impression on his introduction to first-class cricket. For Oxford, against the Army in 1925, he scored 238 runs for once out--a performance that had much to do with his season's aggregate of 553 runs, average 34.56 which placed him second in the batting to G. B. Legge, his Malvern captain of 1922 with whom during 1926 he was involved in a motor accident. This incapacitated Holmes for a time as a damaged foot handicapped him in batting and fielding. He finished his Oxfordcareer brilliantly in 1927 when he was captain. Against Cambridge he stood far above the rest of the team. They were set to make 379 in the fourth innings and the opening pair, A. M. Crawley and P. V. F. Cazalet, went for nothing, but Holmes and A. T. Barber put on 183 in just over two and a half hours, Holmes' share being 113. He hit all round the wicket in delightful style, timing his strokes admirably and while at first particularly strong on the leg-side, he afterwards excelled in clean driving. Altogether he hit seventeen 4's.",
        "That innings was typical of the way Holmes approached cricket all his life. He believed that everyone should enjoy the game. A marked characteristic about his batting was the ease and certainty of his strokes; a very strong forward player he drove really hard, especially to the off and so good was his footwork and power of wrist that he had no need to exploit the modern method of leg-side play, but even so he was no mean exponent of such strokes. With left shoulder forward and firm right knee, Holmes convinced one directly he went in that he was there to make runs. And never did he change his methods.",
        "For all his brilliance Holmes did not figure on the winning side against Cambridge. One of his three matches was drawn and the other two lost, but in those games he himself made 289 runs, average 48 and he took seven wickets. Holmes made his first-class debut in 1924 when in his only innings he failed to score for Surrey against Somerset at Taunton, but in the following year he took part in that historic match on the same ground when J. B. Hobbs hit two centuries and passed W. G. Grace's then world record of 126 centuries.",
        "On going down from Oxford, Holmes, due to business reasons, dropped out of first-class cricket for seven years, but the break did not harm his batting. He returned to Surrey ( 1934) at a time when the affairs of the club were unsettled. The long reign of Percy Fender had ended and his successor, Douglas Jardine, following the body-line controversy, had given up the leadership after only two seasons. The appearance of Holmes marked the beginning of a new era for Surrey. He entertained the idea that county cricket generally required some vitalising influence. Modern methods accounted for the loss of much of the real spirit of the game--life and enjoyment. There had crept in a tendency by many leading batsmen to play for keeps. Holmes, holding strongly to the opinion that county cricket would benefit from a touch of the country house spirit, applied himself to the task of installing these precepts into the minds and consequently the play of those under him. Although he had in Alf Gover one of the best fast bowlers in the country he set his face resolutely against the employment to any great extent of the short-pitched ball--not that Gover himself wished to do otherwise than bowl a full length.",
        " Holmes was always attractive to watch. He made the most of his height and hit strongly in front of the wicket. For a few seasons he was undoubtedly one of the best batsmen of his day. Scoring 1,925 runs he finished tenth in the country's batting in 1935 when he played in the second Test against South Africa at Lord's. He was vice-captain of the MCC team in West Indies in 1934-35 and the following winter he led the side to Australia and New Zealand on a good-will tour.",
        null,
        null,
        " \"Errol was a fine all-round cricketer. He had the ability and the right approach to the game. He followed in the steps of the real amateurs of my early days; men like Lord Dalmeny, Lord Tennyson, Ranjitsinhji, MacLaren, Spooner and later Greville Stevens and Nigel Haig. We used to enjoy our cricket. Though doughty opponents on and off the field, we laughed and joked about it.",
        " \"As a captain Holmes was always popular with the professionals, but he never shirked his duty. As a player he was a fine attacking batsman with an excellent style--a true Malverian. He was a keen opening bowler of the tearaway type and he set a fine personal example in the field. He played in only five Tests and it was a pity he could not find more time to play because I am sure he would have appeared more often for England.",
        " \"In recent years I saw a good deal of Errol Holmes. We were together on the Surrey Committee until the time of his death. As Chairman of the cricket committee he proved very efficient and I know he was a tower of strength on the MCC committee at Lord's. He had the pulse of cricket at his finger tips and he always led Surrey the right way. A purist, he would not tolerate anything shady or underhanded and being a God-fearing man he was against Sunday play in the big-match sense.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}