{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "2",
            "Ave": "18.66",
            "Ct": "5",
            "HS": "48",
            "Inns": "9",
            "Mat": "5",
            "NO": "0",
            "Runs": "168",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "14",
            "50": "30",
            "6s": "",
            "Ave": "27.05",
            "Ct": "131",
            "HS": "191",
            "Inns": "289",
            "Mat": "168",
            "NO": "17",
            "Runs": "7359",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "129.00",
            "BBI": "1/47",
            "BBM": "1/47",
            "Balls": "204",
            "Econ": "3.79",
            "Inns": "6",
            "Mat": "5",
            "Runs": "129",
            "SR": "204.0",
            "Wkts": "1"
        },
        {
            "": "First-class",
            "10": "1",
            "4w": "",
            "5w": "8",
            "Ave": "23.78",
            "BBI": "7/65",
            "BBM": "",
            "Balls": "10223",
            "Econ": "2.79",
            "Inns": "",
            "Mat": "168",
            "Runs": "4757",
            "SR": "51.1",
            "Wkts": "200"
        }
    ],
    "latest_articles": [],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/102004/055302.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nDecember 14, 1866, Paddington, London "
        ],
        "Bowling style": [
            "Slow left-arm orthodox"
        ],
        "Died": [
            "February 7, 1940, Burwash, Sussex (aged 73 years 55 days) "
        ],
        "Education": [
            "Repton; Cambridge University"
        ],
        "Full name": [
            "Francis Gilbertson Justice Ford"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Middlesex"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nFrancis Ford, the youngest of seven brothers, all good cricketers at Repton, and nephew of G. J. Ford, who played for Oxford at Lord's a hundred years ago, died on February 7, aged 73, at Burwash, Sussex. After four years in the Repton XI, being captain in the last two seasons, Francis Ford was the third of the brothers who played for Cambridge, receiving his Blue as a Freshman. In his first year Oxford won by seven wickets, the next match was drawn, and then he took part in two handsome victories. When captain, he led his side to a great triumph by an innings and 105 runs, and, playing again, he helped Cambridge to win by seven wickets, this being the sixth time in nine consecutive seasons on which that margin settled the trial of strength between the Universities at Lord's. \n",
        "Standing 6 feet 2½ inches, he used his height with such effect that despite spare physique he put exceptional force into his left-hand strokes. Elegant in style, standing upright, he made many good-length balls into half volleys, and when the bowler pitched shorter he forced the ball away at a great rate on either side of the wicket. He failed to show his best form in the University match except in 1890, when on a treacherous pitch ruined by rain he made the highest score, not out 32, which won the game. Under similar conditions he took Middlesex to victory over Yorkshire at Headingley in 1898. With Hirst, Rhodes and F. S. Jackson in their prime, 60 in the last innings meant a difficult task, but Ford, going in number four with the total 26, hit up 29, finishing the match by driving Haigh over the far away off boundary--as Sir Pelham Warner, the first batsman to fall, has described.",
        "Probably Francis Ford never gave a more brilliant display than in scoring 191 at Hove against Sussex in 1890. Gregor McGregor, the Cambridge captain, 131, and C. P. Foley, 117, also contributed centuries to the Cambridge second innings total of 703 for nine wickets--then a record score in English first-class cricket. Ford, going in when the bowling was mastered, scored almost as he pleased. His drives, either kept down or lifted over the bowler's head, were dazzling, and his cuts the perfection of timing. He revelled in these strokes when fast bowlers lost their length because of his punishment, and at Lord's the crowds grew enthusiastic over the way he scored from the best fast bowlers--Arthur Mold of Lancashire, Tom Richardson and Bill Lockwood of Surrey, suffered specially at his hands.",
        "In 1893 he was second to A. E. Stoddart in the Middlesex averages when scoring generally was moderate, and in the winter of 1894 was in the first team captained by Stoddart which won the test match at Sydney by 10 runs. He scored 48 when England followed-on in face of Australia's 586, so helping Albert Ward and J. T. Brown to pull the game round and set their rivals to get 177, a task which Peel and Briggs rendered impossible of achievement.",
        "He headed the first class batting in 1897, when he averaged 53 for an aggregate of 805. He excelled for the Gentlemen at Lord's, playing two grand not-out innings of 50 and 79. The second, on worn turf, was superb, only W. G. Grace and G. L. Jessop of the other batsmen doing much.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}