{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "2.50",
            "Ct": "0",
            "HS": "5",
            "Inns": "2",
            "Mat": "1",
            "NO": "0",
            "Runs": "5",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "2",
            "50": "7",
            "6s": "",
            "Ave": "15.71",
            "Ct": "38",
            "HS": "115",
            "Inns": "162",
            "Mat": "88",
            "NO": "15",
            "Runs": "2310",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "1",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "88",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/newzealand/content/story/433839.html",
        "http://www.espncricinfo.com/magazine/content/story/142092.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155710.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/36200/36290.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/36200/36290.icon.jpg"
    ],
    "personal_info": {
        "Also known as": [
            "The 35th MacKinnon of MacKinnon"
        ],
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nApril 9, 1848, Paddington, London "
        ],
        "Died": [
            "February 27, 1947, Drumduan, Forres, Morayshire, Scotland (aged 98 years 324 days) "
        ],
        "Full name": [
            "Francis Alexander MacKinnon"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Kent"
        ]
    },
    "profile_info": [
        null,
        "Born at Acryse Park, in Kent, he went to Harrow without getting into the eleven, but at Cambridge he played in the historic match of 1870 when Cobden did the hat-trick by dismissing the last three Oxford batsmen and gaining for the Light Blues a dramatic victory by two runs. He played ten years for Kent, and in 1884, going in first, he helped, with scores of 28 and 29, in the only victory gained by a county over the Australians. Of the winning side, Mr. Stanley Christopherson, President of M.C.C. during the war years, who finished the match by taking three wickets for 12 runs, Mr. M. C. Kemp, wicket-keeper, and Alec Hearne, seven wickets for 60, are three survivors of that eleven.",
        "During that year he scored 115 against Hampshire and 102 against Yorkshire, his average being 33, second to 41 by Lord Harris. He was President of the Kent County Club in 1889.",
        "In the winter of 1878 he went with Lord Harris to Australia. A strong batting side included only two professionals, George Ulyett and Tom Emmett, the Yorkshiremen. MacKinnon was a victim of F. R. Spofforth in a hat-trick in the only match with the full strength of Australia, who won by ten wickets.",
        "Born on April 9, 1848, three months before W. G. Grace, he married in 1888 the eldest daughter of Admiral, First Baron Hood, the Hon. Emily Hood, who died in 1934. There survive a son and a daughter, who accompanied her father on his cricket visits to the South.",
        "The oldest Harrovian, University Blue and Test cricketer, he was also the senior member of M.C.C., to which he was elected in 1870. Until the last he retained a keen interest in the game he loved so well by following the reports of the matches played by the England team in Australia.",
        "Although he gave up County cricket sixty-two years ago, he maintained to a remarkable extent a close touch with the game, as his memory and good physique gave evidence. Using two sticks, he walked firmly, and enjoyed meeting old friends on Kent grounds as well as at Lord's. During the Tunbridge Wells Cricket Week in 1946 he watched the cricket from the Band of Brothers' tent or from the pavilion. One afternoon, accompanied by his daughter and the Marchioness of Abergavenny, he visited Rose Hill School and examined the old desk where he used to sit as a pupil eighty-nine years before. He gave a talk to the whole school, besides inspecting the Sea Scout Troop.",
        "Several opportunities occurred for me to speak to the MacKinnon, and he related some of his experiences in the happiest way. He liked Canterbury better even than Lord's, his second love. An amusing tale was how, at The Oval when playing for Kent, Lord Harris put him to field at a particular spot-- `Mac, by that worm cast.' After some hits just out of reach, my captain said: `You have left cast.'`No, George, I haven't. That's another worm's cast.'",
        "Referring to Cobden's Match, he said with a smile, I really won the match, for I scored two (the margin of victory). That was his second innings, after a useful 17 not out at a time when runs were never more difficult to get than at Lord's on the big occasion.",
        "Among those who chatted with him in the Lord Harris Memorial garden, where he enjoyed a picnic lunch with his daughter during the University match, was the Rev. T. R. Hine Haycock, an Oxford Blue in 1883, who played for Kent when MacKinnon was finishing his active cricket career and is now 85 years old.",
        " MacKinnon wore an I. Zingari tie, and on his watch chain showed with pride a gold medallion bearing the insignia of crossed bats presented to all the team captained by Lord Harris in Australia. His wonderfully clear conversation and strong handshake revealed his hearty enjoyment in meeting any cricket acquaintance. Among the last active signs of his fondness for the game was the presentation to Canterbury of a picture of the Kent and Sussex match at Hove a hundred years ago, in which the players, among them Alfred Mynn, the Lion of Kent, and Fuller Pilch, are wearing tall hats.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}