{
    "batting_averages": [
        {
            "": "Tests",
            "100": "5",
            "50": "23",
            "6s": "15",
            "Ave": "36.07",
            "Ct": "64",
            "HS": "154",
            "Inns": "98",
            "Mat": "64",
            "NO": "7",
            "Runs": "3283",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "145",
            "50": "295",
            "6s": "",
            "Ave": "40.77",
            "Ct": "1018",
            "HS": "305*",
            "Inns": "1530",
            "Mat": "978",
            "NO": "84",
            "Runs": "58959",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "1",
            "4w": "1",
            "5w": "4",
            "Ave": "33.91",
            "BBI": "7/76",
            "BBM": "10/49",
            "Balls": "6495",
            "Econ": "2.60",
            "Inns": "87",
            "Mat": "64",
            "Runs": "2815",
            "SR": "78.2",
            "Wkts": "83"
        },
        {
            "": "First-class",
            "10": "28",
            "4w": "",
            "5w": "132",
            "Ave": "19.87",
            "BBI": "8/22",
            "BBM": "",
            "Balls": "94949",
            "Econ": "2.59",
            "Inns": "",
            "Mat": "978",
            "Runs": "41058",
            "SR": "45.9",
            "Wkts": "2066"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/1155197.html",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/1096099/triple-figures--double-quick",
        "http://www.espncricinfo.com/wisdencricketer/content/story/347943.html",
        "http://www.espncricinfo.com/magazine/content/story/337943.html",
        "http://www.espncricinfo.com/magazine/content/story/138159.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=22518"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/75500/75563.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/75500/75563.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/75500/75563.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nMay 27, 1887, Tonbridge, Kent "
        ],
        "Bowling style": [
            "Left-arm medium, Slow left-arm orthodox"
        ],
        "Died": [
            "October 18, 1978, Chester, Halifax, Nova Scotia, Canada (aged 91 years 144 days) "
        ],
        "Full name": [
            "Frank Edward Woolley"
        ],
        "Major teams": [
            "England,",
            "Kent"
        ]
    },
    "profile_info": [
        null,
        "Even more impressive than the number of runs Woolley amassed was the manner in which he made them. Standing well over six feet, he was a joy to watch. He played an eminently straight bat, employed his long reach to full advantage, and used his feet in a manner nowadays rarely seen. His timing of the ball approached perfection and he generally dealt surely with all types of bowling. Master of all the strokes, he was at his best driving, cutting, and turning the ball off his legs. He was described by Sydney Pardon as the cleanest driver since F. G. J. Ford, but he often started badly and there was something wanting in his defence. As a bowler he made good use of his height and bowled with a graceful easy swing.",
        "As a small boy he was always to be found on the Tonbridge Cricket Ground, and his natural ability as batsman and bowler attracted so much attention that, in 1903, he was engaged to take part in the morning practice and play in a match or two in the afternoon if required. In the following year he became a regular member of the Tonbridge Ground staff, which in those days was the official Kent nursery. When given his first chance in the  Kent XI in 1906, he was almost unknown to the public, and his all-round form in his third match, against Surrey at  The Oval, came as nothing less than a revelation. To begin with, he took three Surrey wickets, clean bowling Hayward, Hayes, and Goatly. He then made 72, and when Surrey batted again he took five wickets for 80 runs. Finally he scored 23 not out, helping to win a wonderful game for Kent by one wicket. The match established his reputation.",
        "When  Frank Woolley announced his retirement in 1938, I spent an afternoon with him at his home in Hildenborough where he talked about \"My happy cricket life.\" In his first season with Kent they won the County Championship for the first time, and altogether between 1906 and 1913 they were top four times. Now let Woolley speak for himself as he told his story to me.",
        "\"Those were the great days when plenty of amateurs could spare time for cricket. I do not believe there are so many good players in the game now as before the [First World] War. In the old days we were probably educated in cricket in a far more serious way than now. For the purpose of giving the younger people my idea of the difference, I will put up Walter Hammond, England's captain, as an example. Before 1914 there were something like 30 players up to his standard and he would have been in the England team only if at the top of his form. I make these remarks without casting the slightest reflection on  Hammond. He is a grand player and one of the greatest all-round cricketers since the War - in fact, the greatest.\"",
        "\"I doubt whether English cricket has really recovered from the effects of the War. You see, we missed half a generation and since then young men have found many other ways of occupying their leisure hours. Still, I believe it is only a passing phase and cricket will one day produce an abundance of great players.\"",
        "Unfortunately for cricket, within a year England was plunged into another war, and in my opinion the game in this country has only just shown signs of getting on its feet again with a stream of fine young players coming through, notably in the county of Kent. But to return to the Woolley interview as he saw the game 40 years ago.",
        "\"There is little wrong with the game itself. Just a question of the way it is played. It is amazing how the public steadfastly refuse to attend the third day of a match when so often the last day produces the best and most exciting cricket.\"",
        "\"Touching on a personal subject I have been asked if I can explain why I was dismissed so many times in the `nineties'. The statisticians inform me that I was out 35 times between 90 and 99 and I am also told that I am credited with 89 ducks. With regard to those `nineties', I can honestly say that with me it was never a case of the `nervous nineties'. Lots of times I was out through forcing the game. We were never allowed to play for averages in the Kent side or take half an hour or more to get the last ten runs under normal conditions. We always had to play the game and play for the team. It is a Kent tradition.\"",
        "\"As a matter of fact I consider the two finest innings I ever played were in the second Test against Australia in 1921 when I was out for 95 and 93. I don't think I ever worked harder at any match during my career to get runs as I did then, nor did I ever have to face in one game such consistently fast bowlers as the Australian pair, Gregory and McDonald. Square cuts which ordinarily would have flashed to the boundary earned only two, and I believe that those two innings would have been worth 150 apiece in a county match.\"",
        "\"I was not depressed when they got me out. I have always taken my dismissals as part of the game. In the first innings I was in the `eighties' when I was joined by the last man, Jack Durston. It was my own fault completely that I lost my wicket. Mailey bowled me a full toss to the off; I walked down the pitch, stepping to the on to face the ball past extra cover, I missed it, and that fine wicketkeeper, H. Carter, eagerly accepted the opportunity to stump me. I was rather unlucky in the second innings when again I fell to  Mailey. The ball stuck in his hand and dropped half-way on the leg side. I hit it pretty plumb between square leg and mid-on and just there was standing `Stalky' Hendry. As I made the shot he jumped in the air and up went his right hand. The ball hit him, I think, on the wrist, and he lost his balance. The ball went up ten feet and as he was lying on the ground it fell in his lap and he caught it. He was the only man on the leg side and I think the shot would have carried for six. It was a marvellous catch.\"",
        "\"It is often argued that left-handed batsmen have an advantage compared with the right-handers. I do not agree. When the turf is worn the right-hand leg-break bowlers and left-arm slow bowlers are able to pitch the ball into the footholes of the bowlers who have operated at the other end. Right-handed batsmen can let these balls hit their pads, but the left-handers must use their bats. Perhaps the new [1937] lbw rule has not helped us there, but the amended law does not worry me, though in my opinion it has not improved the game. As for further extending the lbw rule I think it would make a farce of the game.\"",
        "\"In many quarters surprise was expressed that at the age of 51 I went in number one. Until then I had never been in first regularly, though I had always preferred that place. Beginning as a bowler made Kent place me four or five in the order, and moreover the county were always rich in opening batsmen. Consequently my wish to start the innings was denied until 1938.\"",
        null,
        "\"I cannot let this opportunity pass without placing on record how much I have enjoyed my cricket with  Kent. If I was a youngster starting as a batsman I think I should like to play always at The Oval, but the Kent grounds, with their natural decorations of beautiful trees, members' tents flying their own colours and bedecked with flowers, lend the right tone to cricket.\"",
        "After his retirement from the field, Woolley was elected a life member of M.C.C. and Kent, and also to the county committee. He was quite active into his late 80s and in January 1971 flew to Australia to watch the last two Tests. Nine months later, in Canada, he married for a second time, his first wife having died ten years earlier. His second bride was Mrs Martha Morse, an American widow.",
        null,
        null,
        "This was made possible not only by his wonderful eye and sense of timing but by his range of strokes. He had every orthodox stroke at his command and no preference for one over another. Like W.G., he simply employed the one the occasion demanded. Each of these strokes could be commended to a young player as the perfect example of how to do it. In defence, too, his back stroke, certainly in his maturer years, was a model of soundness. All types of bowler came alike to him personally, but, if he saw his partner in trouble, he would make it his business to settle the bowler responsible.",
        "At Tunbridge Wells in 1924, he came in at 29 for two to join George Wood, who was in grievous difficulties with Tate, then at his best. As he passed  Wood, he said: \"Push a single, Mr Wood, and leave me to deal with Chubby.\" The single was duly obtained and Tate's next two balls were driven for four. Great trier though he was, Tate, always demonstrative, flung the ball down, exclaiming, \"I can't bowl to this chap.\" Wood, a useful though not great bat, went on to make 49, Woolley made 87, and together they put on 103 out of a total of 190. Though  Kent won by 200 runs, it is not fanciful to suggest that those two early fours had a considerable effect on the course of the match.",
        "At Folkestone in 1928, an  England XI required 286 to beat the West Indies. There was a bit of feeling in the air, and the three fast bowlers,  Francis, Constantine, and Griffith, set out to intimidate the batsmen. Lee and Hammond were quickly out and Wyatt, though struggling with typical determination, was acutely uncomfortable. Woolley, as if unconscious of any trouble, set about the bowlers from the start and hit them to every corner of that large ground. Never have I seen fast bowling so massacred. He scored 151 in three hours. Wyatt compiled a gallant 75, and against all the odds the England side won by four wickets. Years later Constantine said it was the worst hammering he ever received.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}