{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "1",
            "50": "0",
            "6s": "0",
            "Ave": "3.00",
            "BF": "22",
            "Ct": "2",
            "HS": "6",
            "Inns": "2",
            "Mat": "1",
            "NO": "0",
            "Runs": "6",
            "SR": "27.27",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "3",
            "4s": "",
            "50": "35",
            "6s": "",
            "Ave": "18.32",
            "BF": "",
            "Ct": "668",
            "HS": "111",
            "Inns": "590",
            "Mat": "402",
            "NO": "97",
            "Runs": "9035",
            "SR": "",
            "St": "323"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "1",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "402",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/888219/seven-in-the-shallows",
        "http://www.espncricinfo.com/magazine/content/story/375242.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155717.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/21600/21641.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nApril 25, 1902, Westminster, London "
        ],
        "Died": [
            "January 13, 1969, Hendon, Middlesex (aged 66 years 263 days) "
        ],
        "Fielding position": [
            "Wicketkeeper"
        ],
        "Full name": [
            "Wilfred Frederick Frank Price"
        ],
        "Major teams": [
            "England,",
            "Middlesex"
        ],
        "Other": [
            "Umpire"
        ]
    },
    "profile_info": [
        "\nFred Price, the former Middlesex and England wicket-keeper and Test match umpire, died in hospital on January 12, aged 66. A skilled performer behind the stumps, Fred Price held 648 catches and brought off 316 stumpings during a first-class career extending from 1926 to 1947. In 1937 he set up a record, since equalled but not surpassed, when he took seven catches in the Yorkshire first innings at Lord's.  \n",
        "After the match, a lady approached Price with congratulations upon his feat. \"I was so thrilled with your performance, Mr. Price,\" she said, \"that I nearly fell over the balcony.\" With, mock gravity, Price responded: \"If you had, madam, I would have caught you as well!\"\n \nFor so many years contemporary with Les Ames, Price appeared in only one Test match, against Australia at Headingley in 1938, making two catches in the first innings. Twice he toured abroad, with the Hon. F. S. G. Calthorpe's M.C.C. team in 1929-30, when he was sent to the West Indies as replacement for the injured Major R. T. Stanyforth, and with Sir Theodore Brinckman's side in South America in 1937-38. Price developed into a distinctly useful batsman and often opened the innings for his county. In all he scored 6,666 runs, average 17.35, three times reaching three figures. He narrowly failed to obtain two centuries in the game with Kent at Lord's in 1934, scoring 92 and 107. The previous summer, when he made his highest innings, 111 off the Worcestershire bowling at Dudley, he and Patsy Hendren (301 not out) engaged in a fifth-wicket partnership of 332. ",
        "Fearless as an Umpire from 1950 to 1967, Price created a sensation when he three times no-balled Tony Lock, the Surrey and England left-arm slow bowler, for throwing against VS Hazare's India touring team at The Oval. In the same season on the same ground when the Yorkshire batsmen, struggling to avoid defeat from Surrey, were being subjected to continuous barracking by the crowd, Price lay on the ground at square-leg till the noise subsided. \"I did so,\" he explained afterwards, \"because three times there were catcalls just as the batsman was about to play the ball. That is not my idea of British sportsmanship and under the Laws of 'fair and unfair play', I will not tolerate such things on any ground, Lord's included where I am umpiring.\" He officiated in eight Test matches. ",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}