{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "5",
            "6s": "5",
            "Ave": "25.31",
            "Ct": "22",
            "HS": "79",
            "Inns": "30",
            "Mat": "22",
            "NO": "1",
            "Runs": "734",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "22",
            "50": "56",
            "6s": "",
            "Ave": "27.36",
            "Ct": "212",
            "HS": "212",
            "Inns": "536",
            "Mat": "335",
            "NO": "49",
            "Runs": "13325",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "3",
            "5w": "1",
            "Ave": "31.06",
            "BBI": "5/49",
            "BBM": "6/81",
            "Balls": "3260",
            "Econ": "2.57",
            "Inns": "31",
            "Mat": "22",
            "Runs": "1398",
            "SR": "72.4",
            "Wkts": "45"
        },
        {
            "": "First-class",
            "10": "11",
            "4w": "",
            "5w": "62",
            "Ave": "26.21",
            "BBI": "8/34",
            "BBM": "",
            "Balls": "65967",
            "Econ": "2.91",
            "Inns": "",
            "Mat": "335",
            "Runs": "32007",
            "SR": "54.0",
            "Wkts": "1221"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/316652.html",
        "http://www.espncricinfo.com/bodyline/content/story/316500.html",
        "http://www.espncricinfo.com/bodyline/content/story/316173.html",
        "http://www.espncricinfo.com/bodyline/content/story/316605.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/235397.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=9255"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/210300/210357.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/210300/210357.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/210300/210357.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nDecember 16, 1910, Lima, Peru "
        ],
        "Bowling style": [
            "Right-arm medium, Legbreak googly"
        ],
        "Died": [
            "July 24, 1991, Ramsbury, Wiltshire (aged 80 years 220 days) "
        ],
        "Education": [
            "St Piran's, Maidenhead; The Leys; Cambridge University"
        ],
        "Full name": [
            "Frederick Richard Brown"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Northamptonshire,",
            "Surrey"
        ],
        "Other": [
            "Administrator"
        ],
        "Playing role": [
            "Allrounder"
        ]
    },
    "profile_info": [
        "\nFrederick Richard Brown, CBE, who died on July 24, 1991, aged 80, was all-rounder of exceptional skill and achievement who will always be remembered for the courage and determination of his leadership of England in the 1950-51 Test series in Australia. Few visiting captains have been received with so much acclaim by the crowds of Melbourne and Sydney. Although England lost the series by four matches to one, it was soon appreciated that the 40-year-old Brown had almost single-handedly, and against every forecast, done a huge amount to revitalise English cricket, which had been humbled in turn by Australian speed and West Indian spin. What is in many ways a romantic story started when Brown was offered the captaincy of Northamptonshire early in 1949. He called his new charges back for three weeks training before the season began and went on to lead them to sixth place in the Championship--after two years at the bottom of the table. In addition, he was invited to captain England in the last two Tests against New Zealand and, crucially, a year later, the Gentleman at Lord's. A sudden first-innings collapse, the presence of the selectors, and his sense of the occasion put Brown on his mettle. In a wonderful innings of 122, made in 110 minutes, he hit a six and sixteen fours, scoring all but 9 of the runs put on while he was at the wicket. The selectors had no need to look further for the man they wanted in Australia, and he was recalled to lead England at the Oval in the last Test against West Indies. \n",
        "Indifferent form against the states did little to suggest that England would make a fight of it in the Tests; but they defied the critics by bowling out Australia for 228 on the opening day of the First Test at Brisbane. Although torrential overnight rain subsequently turned a losing score into a winning one, it was generally felt that England were superbly led and had played the better cricket. At Melbourne England lost by 28 runs: Brown's 62 in the first innings and four for 26 in Australia's second helped to make him the most popular player of the series. And so to Sydney, two down. Injuries to Bailey and Wright on the second day ruined the match as a contest, but made it memorable by compelling the feat of Bedser, Brown (bowling mostly seamers) and Warr, who sent down 123 eight-ball overs in scorching heat between 3.30 p.m. on the Saturday and lunch on Tuesday. When Brown's innings of 79 is taken into account, his contribution assumes heroic proportions. It is better to draw a veil over Adelaide, apart from Hutton's 156 not out, and go on to Melbourne, with England four down and thoroughly dejected. The captain, however, sounded the rallying call and seized the initiative by taking five of Australia's first-innings wickets after the home team had won the toss on the first morning. After that, victory by eight wickets was left in the capable hands of Hutton and Simpson. The whole picture had changed and spirits were high once more. As a postscript to Brown's main achievement, there was an immediate victory over New Zealand in Wellington, a 3-1 series win against South Africa at home in 1951, and a solitary appearance at Lord's in 1953 against Australia, at the special request of his fellow-selectors. It should also be noted that the youthful Brown had played in five Tests against New Zealand in three separate series before the war and in one against India in 1932 at Lord's.",
        null,
        " Freddie Brown was born at Lima, Peru, where his father, no mean cricketer himself, was in business. The boy's left-handedness at everything met with paternal disapproval, and he was forced to change over, fortunately with no damage to his natural co-ordination. At his prep school, St Pirans, he made rapid strides under the tutorage of Aubrey Faulkner, who on the staff, so that when he moved on to The Leys, he had four years of unbroken success, with more than 2,000 runs and nearly 200 wickets for XI. Before his first season at Cambridge, he was advised by Faulkner to concentrate on leg-breaks and googlies as his main weapons in first-class cricket, keeping his medium-pace swingers up his sleeve as a variation. That he was able to carry this out is a tribute to his adaptability. In his two seasons at Cambridge, 1930 and 1931, he exceeded 1,000 runs in 25 matches and took exactly 100 wickets. In his first University Match he played two useful innings, and in 1931, when the Nawab of Pataudi made his record 238 not out for Oxford, he sustained and accurate and probing attack with five for 153 in 43.5 overs.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}