{
    "batting_averages": [
        {
            "": "Tests",
            "100": "1",
            "50": "3",
            "6s": "1",
            "Ave": "45.44",
            "Ct": "3",
            "HS": "107",
            "Inns": "9",
            "Mat": "6",
            "NO": "0",
            "Runs": "409",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "31",
            "50": "74",
            "6s": "",
            "Ave": "33.96",
            "Ct": "225",
            "HS": "257",
            "Inns": "453",
            "Mat": "250",
            "NO": "24",
            "Runs": "14570",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "18",
            "Econ": "2.66",
            "Inns": "1",
            "Mat": "6",
            "Runs": "8",
            "SR": "-",
            "Wkts": "0"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "57.77",
            "BBI": "2/17",
            "BBM": "",
            "Balls": "1601",
            "Econ": "4.76",
            "Inns": "",
            "Mat": "250",
            "Runs": "1271",
            "SR": "72.7",
            "Wkts": "22"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/882229.html",
        "http://www.espncricinfo.com/wisdencricketer/content/story/229623.html",
        "http://www.espncricinfo.com/ci/content/story/95463.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155368.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154671.html"
    ],
    "latest_photos": [],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nNovember 2, 1908, Walsall, Staffordshire "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "January 23, 1983, Westbourne, Dorset (aged 74 years 82 days) "
        ],
        "Full name": [
            "Alfred Harry Bakewell"
        ],
        "Major teams": [
            "England,",
            "Northamptonshire"
        ]
    },
    "profile_info": [
        "\nAlfred Harry \"Fred\" Bakewell, who died at Westbourne, Bournemouth, on January 23, 1983, aged 74, was, from the spectator's point of view, one of the most exciting batsmen of his generation and the car smash which ended his career was as disastrous as that which finished Milburn's years later. While, as the vicissitudes of some of our modern Test match batsmen demonstrate, it is impossible to exaggerate the importance of a sound orthodox method, it is salutary that just now and again a player emerges who can defy some of what are normally considered the cardinal principles and yet completely confound the critics. Bakewell's stance was one of the most two-eyed ever seen, with the right shoulder so far round that it seemed almost to be facing mid-on: it was not helped by a slight crouch and he gripped the bat throughout with one hand at the top and the other at the bottom of the handle. Seeing this for the first time, one would have diagnosed a dull and ugly player who would score, if at all, by nudges and deflections. Yet there was in him some natural genius which enabled him to be one of the most brilliant drivers and cutters in the world, nor did he have any difficulty in getting right down the pitch to hit the ball. Naturally he was also strong on the leg side and, if in his early years his defence was a trifle suspect, especially on his off stump, he soon improved it. \n",
        "If ever a batsman was a law unto himself, he was. In 1933 he scored 246 for Northamptonshire against Nottinghamshire at Northampton in just under six hours. In order to keep him quiet, Sam Staples, one of the most accurate off-spinners in England, bowled at the stumps with a packed leg side. To cut an off-break is generally a recipe for trouble: to cut an off-break on the middle stump is suicidal. Yet Bakewell, standing well clear of his leg stump, in the intervals of jumping out and driving him for 4 past the place where extra-cover might have been, constantly cut him. In 30 overs Staples conceded 177 runs. The innings was regarded by many as the finest they had ever seen on the ground and was a record for the county. It did not stay a record for long. In the next match Bakewell beat it with 257 against Glamorgan at Swansea. By contrast, opening for England against West Indies at The Oval later that summer, he was faced with a score-board reading 68 for four, Walters, Hammond, Wyatt and Turnbull all being out. His answer was to make 107 out of 194 in three hours, 50 minutes, a sensible, controlled innings which was just what the situation called for and which saved the side.",
        "Born at Walsall, Bakewell learned his cricket at St John's School, Tiffield, and later received further coaching in Oxford under the scheme organised by J. R. F. Turner. He made his first appearance for Northamptonshire in June, 1928, and immediately made his place secure not only with some useful innings, but by his brilliant fielding at short-leg. In 1929 he got his 1,000 runs and did so every season for the rest of his career. Having played his first innings of 200 in 1930, 204 against Somerset at Bath, he was picked in 1931 for the Players at Lord's and also to open the innings for England against New Zealand at Lord's and The Oval. At The Oval he made 40 and was batting well when he allowed himself to be run out rather than Sutcliffe. In 1933 his aggregate of 1,952 runs for the county was a record and in all matches he exceeded 2,000 runs, the first Northamptonshire man ever to do so. That winter he went to India with Jardine's side and was only moderately successful and in 1934, being doubtless stale, failed to get a place against the Australians. Back in form in 1935, he played in two Tests against South Africa without much success, but made 1,719 runs for the county, including a remarkable innings against Yorkshire at Harrogate. Those were the days when D. R. Jardine, if he wished to know how good a cricketer was, always asked, What has he done against Yorkshire? On this occasion someone remarked to Bakewell that he had never taken a hundred off Yorkshire: he replied, I will do so today. The Yorkshire bowling was opened by Smailes and off his first over Bakewell hit five 4s, followed by three more three overs later. In two hours he had reached 96 when Sellers just reached, one-handed at full stretch over his head at mid-off, a tremendous drive and held it. In 1936 Bakewell had another good season and ended it and his career with a great innings. At Chesterfield Northamptonshire were 65 runs down on the first innings to Derbyshire, the champions. Going in again Bakewell batted over six hours for 241 not out before his captain declared, leaving Derbyshire 347 to get. At the close they were 173 for seven. On the return journey the car in which R. P. Northway and Bakewell were travelling overturned. Northway was killed outright and Bakewell's right arm was so badlybroken that he could never play county cricket again.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}