{
    "batting_averages": [
        {
            "": "Tests",
            "100": "4",
            "4s": "195",
            "50": "7",
            "6s": "8",
            "Ave": "37.45",
            "BF": "3176",
            "Ct": "22",
            "HS": "156",
            "Inns": "42",
            "Mat": "23",
            "NO": "2",
            "Runs": "1498",
            "SR": "47.16",
            "St": "0"
        },
        {
            "": "ODIs",
            "100": "0",
            "4s": "21",
            "50": "2",
            "6s": "1",
            "Ave": "21.21",
            "BF": "443",
            "Ct": "8",
            "HS": "79",
            "Inns": "15",
            "Mat": "16",
            "NO": "1",
            "Runs": "297",
            "SR": "67.04",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "33",
            "4s": "1217",
            "50": "46",
            "6s": "63",
            "Ave": "47.39",
            "BF": "18920",
            "Ct": "114",
            "HS": "210",
            "Inns": "227",
            "Mat": "139",
            "NO": "22",
            "Runs": "9716",
            "SR": "51.35",
            "St": "0"
        },
        {
            "": "List A",
            "100": "7",
            "4s": "352",
            "50": "25",
            "6s": "72",
            "Ave": "49.58",
            "BF": "4569",
            "Ct": "41",
            "HS": "152*",
            "Inns": "96",
            "Mat": "103",
            "NO": "14",
            "Runs": "4066",
            "SR": "88.99",
            "St": "0"
        },
        {
            "": "T20s",
            "100": "0",
            "4s": "113",
            "50": "6",
            "6s": "67",
            "Ave": "24.10",
            "BF": "1292",
            "Ct": "43",
            "HS": "79",
            "Inns": "75",
            "Mat": "84",
            "NO": "9",
            "Runs": "1591",
            "SR": "123.14",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "12",
            "Econ": "2.50",
            "Inns": "2",
            "Mat": "23",
            "Runs": "5",
            "SR": "-",
            "Wkts": "0"
        },
        {
            "": "ODIs",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "16",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "162",
            "Econ": "5.70",
            "Inns": "9",
            "Mat": "139",
            "Runs": "154",
            "SR": "-",
            "Wkts": "0"
        },
        {
            "": "List A",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "103",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "T20s",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "84",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/1149857.html",
        "http://www.espncricinfo.com/ci/content/story/1147008.html",
        "http://www.espncricinfo.com/ci/content/story/1143945.html",
        "http://www.espncricinfo.com/australia-v-england-2017/content/story/1125375.html",
        "http://www.espncricinfo.com/england/content/story/1122263.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=232438"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/277400/277436.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/277400/277436.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/277400/277436.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nNovember 22, 1989, Zimbabwe "
        ],
        "Bowling style": [
            "Legbreak"
        ],
        "Current age": [
            "28 years 269 days"
        ],
        "Education": [
            "Peterhouse, Zimbabwe; Harrow School"
        ],
        "Full name": [
            "Gary Simon Ballance"
        ],
        "Major teams": [
            "England,",
            "Derbyshire,",
            "Derbyshire 2nd XI,",
            "England Lions,",
            "Mid West Rhinos,",
            "Yorkshire,",
            "Zimbabwe Under-19s"
        ],
        "Nickname": [
            "Gazza"
        ],
        "Playing role": [
            "Middle-order batsman"
        ]
    },
    "profile_info": [
        "\nThe belief that when one seemingly indispensable player retreats into the background another often rises to the challenge was exemplified by Gary Ballance as he took the England chance offered by Jonathan Trott's stress-related illness. In no time, Ballance's nuggety left-handed batting style was providing the backbone of England's line-up. There was nothing overly stylish about his approach, but his discipline and shrewdness was apparent and he could step up the tempo when necessary. Ballance, in the coach's parlance was a batman who Found A Way. \n",
        "Ballance's reputation began to blossom during a run-rich 2013 season for Yorkshire after which he was selected for England's tour of Australia. He made his Test debut in Sydney at the end of England's 5-0 whitewash and followed up an ODI debut in Dublin the previous summer with further limited-overs forays against Australia.",
        "But it was 2014, as England sought comfort after the loss of Trott, where England found a batsman to sustain them. A maiden Test hundred against Sri Lanka at Lord's was followed by two in successive Tests against India, at Lord's again and Southampton.  Only Trott and Andrew Strauss had previously made hundreds in their first two Tests at Lord's; 1,019 runs at 67.93 in his first 10 Tests ranked alongside the finest starts to an England career.  There was some low-key drunken notoriety as well as he stripped topless in a Nottingham night club to celebrate victory over India at Trent Bridge. ",
        "That sense of chubby, red-faced permanence ran aground in 2015 as firstly he lost his ODI place and then New Zealand and Australia, in turn, exposed a shuffling back-foot technique and, amid heavy criticism, he was dropped for the third Ashes Test with his team-mate Jonny Bairstow preferred. Few batsmen played so strikingly deep in the crease, but he insisted that he would remain true to the method that had brought him such success. Such faith did not bring immediate rewards: a return against Pakistan the following summer brought limited rewards before four single-figure scores in Bangladesh consigned him to inactivity on the subsequent five-Test tour of India.",
        "Such was the pessimism around his England chances that Yorkshire made him captain in the Championship and he responded with an early-season avalanche of runs, becoming only the second Yorkshire batsman (Younis Khan was the other) to hit a double century and century in the same match, to save the game against Hampshire at the Ageas Bowl. With England's top-order failings evident, he gained a reprieve for two Tests against South Africa, that once gilded average now well below 40, and found himself in the Ashes squad for the 2017/18 tour.",
        "Ballance's roots are Zimbabwean. Aged just 16, he appeared for Zimbabwe at the 2006 Under-19 World Cup, taking three wickets and top-scoring with the bat in a win over England, the country he had already settled on moving to in order to pursue a career. He took up a sports scholarship at Harrow the same year and his relationship to Dave Houghton (who is married to the cousin of Ballance's father), facilitated several appearances for Derbyshire as a schoolboy, including an innings of 73 in a Pro40 game while still aged 16.",
        "At the end of 2007, Ballance signed an academy contract with Yorkshire, allowing him to begin a university course at Leeds Metropolitan University - although he dropped out after a year. He made his Yorkshire debut in 2008, sharing digs for a time with his soon-to-be England colleague Joe Root, but only featured sporadically at first. In 2011, he was one of Yorkshire's better players as they were relegated in the Championship. He added 717 runs at 42.17 in the Championship and 331 runs at 55.16 in the Clydesdale Bank 40, and was rewarded with a two-year contract extension.",
        "During the winter off-seasons, he plied his trade for Mid West Rhinos in Zimbabwe and cracked the first double-hundred of his career for them in 2011-12. He passed 1000 first-class runs in only 14 innings during the season and captained Rhinos to the final of the 50-over Coca-Cola Cup competition.",
        "As Yorkshire regained their Division One status at the first attempt in 2012, Ballance was again a key figure. His 613 Championship runs included an unbeaten 121 as Yorkshire completed the second-biggest successful run chase in their history against Gloucestershire at Bristol in May, when they knocked off a target of 400 in 110 overs; Ballance clinched victory with a four followed by consecutive sixes. ",
        "Such performances led to his selection for the England Lions squad for a limited-overs tour of Australia in February 2013, where Ballance made three half-centuries despite the team losing every game. Centuries for the Lions against Australia and Bangladesh A during the 2013 season pressed his case further and led to an ODI debut against Ireland. He made a two-ball duck but 1251 Championship runs, including five hundreds, were enough to win him a place in England's Ashes squad to tour Australia.",
        null
    ],
    "recent_matches": [
        {
            "Bat & Bowl": "7",
            "Ground": "Leeds",
            "Match Date": "17 Aug 2018",
            "Opposition": "v Notts",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "9*",
            "Ground": "Northampton",
            "Match Date": "16 Aug 2018",
            "Opposition": "v Northants",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "10",
            "Ground": "Nottingham",
            "Match Date": "10 Aug 2018",
            "Opposition": "v Notts",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "13",
            "Ground": "Leeds",
            "Match Date": "9 Aug 2018",
            "Opposition": "v Lancashire",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "24",
            "Ground": "Leeds",
            "Match Date": "3 Aug 2018",
            "Opposition": "v Northants",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "6",
            "Ground": "Leeds",
            "Match Date": "31 Jul 2018",
            "Opposition": "v Leics",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "13",
            "Ground": "Leeds",
            "Match Date": "30 Jul 2018",
            "Opposition": "v Derbyshire",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "16",
            "Ground": "Chesterfield",
            "Match Date": "28 Jul 2018",
            "Opposition": "v Derbyshire",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "35",
            "Ground": "Leeds",
            "Match Date": "27 Jul 2018",
            "Opposition": "v Bears",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "9, 9",
            "Ground": "Manchester",
            "Match Date": "22 Jul 2018",
            "Opposition": "v Lancashire",
            "Scorecard": "FC",
            "Team": "Yorkshire"
        }
    ]
}