{
    "batting_averages": [
        {
            "": "Tests",
            "100": "1",
            "50": "7",
            "6s": "5",
            "Ave": "24.33",
            "Ct": "19",
            "HS": "149",
            "Inns": "39",
            "Mat": "25",
            "NO": "0",
            "Runs": "949",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "18",
            "50": "101",
            "6s": "",
            "Ave": "23.44",
            "Ct": "368",
            "HS": "199*",
            "Inns": "928",
            "Mat": "537",
            "NO": "40",
            "Runs": "20823",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "2",
            "5w": "1",
            "Ave": "20.40",
            "BBI": "7/36",
            "BBM": "7/57",
            "Balls": "2627",
            "Econ": "2.32",
            "Inns": "35",
            "Mat": "25",
            "Runs": "1020",
            "SR": "52.5",
            "Wkts": "50"
        },
        {
            "": "First-class",
            "10": "3",
            "4w": "",
            "5w": "23",
            "Ave": "20.14",
            "BBI": "7/30",
            "BBM": "",
            "Balls": "31136",
            "Econ": "2.53",
            "Inns": "",
            "Mat": "537",
            "Runs": "13157",
            "SR": "47.6",
            "Wkts": "653"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/648695.html",
        "http://www.espncricinfo.com/magazine/content/story/244384.html",
        "http://www.espncricinfo.com/magazine/content/story/75601.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/97900/97951.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/97900/97951.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/97900/97951.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nOctober 21, 1851, Crabtree, Pitsmoor, Sheffield, Yorkshire "
        ],
        "Bowling style": [
            "Right-arm fast (roundarm)"
        ],
        "Died": [
            "June 18, 1898, Pitsmoor, Sheffield, Yorkshire (aged 46 years 240 days) "
        ],
        "Full name": [
            "George Ulyett"
        ],
        "Major teams": [
            "England,",
            "Yorkshire"
        ]
    },
    "profile_info": [
        null,
        "At home Ulyett of course played many times for England against Australia, and in two memorable encounters at Lord's he contributed in a very marked degree to England's success. The first of the two matches was in 1884, when A. G. Steel scored 148 - the innings of his life. On the Tuesday afternoon the Australians, with a balance of 150 runs against them, went in for the second time. The wicket had not worn well, and Peate, bowling from the Nursery end, had the batsmen from the first in obvious difficulties. After a little time, however, to everyone's surprise, Lord Harris took him off and gave Ulyett the ball. Never was a captain better justified by results. The broken places on the pitch which had made Peate difficult rendered Ulyett well-nigh irresistible. Bowling his fastest, and repeatedly breaking back several inches, he had one of the strongest of all Australian teams at his mercy. At the drawing of stumps that evening four men were out for 73, and the next morning the Australians were all out for 143, England winning the match by an innings and five runs. Ulyett took seven wickets in 39 overs and a ball, and had only 36 runs hit from him. It was on that eventful Tuesday afternoon that  Ulyett caught and bowled Bonnor in a way that no one who was present will ever forget. Bonnor's mission was to  knock the fast bowler off, and he did his best. He drove a  half-volley with all his force, but the ball - travelling faster than an express train - went into Ulyett's right hand instead of to the boundary. Bonnor wandered disconsolately back to the Pavilion, and the England players gathered round Ulyett, curious, perhaps, to know what manner of man he was, and anxious to congratulate him on his escape from imminent danger. One can remember, even now, the look of wonder on the faces of A. G. Steel and  Alfred Lyttelton. Ulyett himself was very modest about the matter. Complimented on the catch, when the day's play was over, he said simply that if the ball had hit his fingers instead of going into his hand he should have played no more cricket that season.",
        "The other England match was in 1890. England had much the stronger side, and won in the end by seven wickets, but on the first day there was a period of great anxiety. The ground had suffered a good deal from rain, and after the Australians had been put out for 132, England lost W. G. Grace, Shrewsbury, W. W. Read and Gunn - the four best bats on the side - for 20 runs.  Turner and Ferris were bowling their best, and the outlook was, to say the least, cheerless. However, Maurice Read and Ulyett saved the side from collapse. They put on 72 runs in an hour and a half, and next morning Ulyett carried his own score to 74. That was the highest innings he ever played for England against Australia in this country, and, curiously enough, he never appeared for England again. The  Yorkshire authorities would not let him off for The Oval match in 1890, and when the Australians paid us their next visit, in 1893, his star had waned.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}