{
    "batting_averages": [
        {
            "": "Tests",
            "100": "1",
            "50": "0",
            "6s": "2",
            "Ave": "37.60",
            "Ct": "3",
            "HS": "136*",
            "Inns": "12",
            "Mat": "7",
            "NO": "2",
            "Runs": "376",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "7",
            "50": "32",
            "6s": "",
            "Ave": "25.91",
            "Ct": "72",
            "HS": "136*",
            "Inns": "262",
            "Mat": "166",
            "NO": "17",
            "Runs": "6350",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "7",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "129.66",
            "BBI": "2/16",
            "BBM": "",
            "Balls": "414",
            "Econ": "5.63",
            "Inns": "",
            "Mat": "166",
            "Runs": "389",
            "SR": "138.0",
            "Wkts": "3"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/302468.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155361.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/96800/96826.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/96800/96826.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/96800/96826.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nSeptember 6, 1917, Byfleet, Surrey "
        ],
        "Died": [
            "August 8, 2001, Stockcross, Berkshire (aged 83 years 336 days) "
        ],
        "Education": [
            "Eton College; Pembroke College, Cambridge"
        ],
        "Full name": [
            "Francis George Mann"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Middlesex"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nFrancis George Mann, CBE, DSO, MC, died on August 8, 2001, aged 83. The elder son of Frank Mann, who captained England in South Africa in 1922-23, George Mann similarly led an MCC side there, in 1948-49. He continued another family achievement by captaining England in each of his seven Tests: five in South Africa and two at home against New Zealand the following summer. Three years in the Eton XI, and captain in 1936, he won Blues in 1938 and 1939 while at Pembroke College, Cambridge. His younger brother, John Pelham Mann, also captained Eton and played a handful of games for Middlesex. George himself made his first-class debut for Middlesex in 1937 and played several games for them in those pre-war seasons. However, before he could prosecute either a cricketing or a business career, war intervened. He would have an outstanding war, rising to the rank of major with the Scots Guards. His resourceful courage and cheerful leadership, particularly in the Italian campaign, won him great acclaim and much-merited decoration. In one judgment he was assessed as \"the best regimental officer in the British Army\".  \n",
        "He brought much of the same spirit to captaincy. Needing time to recuperate from wounds, he did not return to cricket seriously until 1947, when he played in the majority of Middlesex's usually victorious matches of that resplendent summer. He occasionally deputised as captain for Walter Robins, and took on the role full-time in 1948 and 1949 with consummate style, leading Middlesex to third and then a shared first place. Such were his personal appeal and practical skills that he was invited to take MCC to South Africa in the winter of 1948-49. Mann's success was twofold. First, the tourists were unbeaten in 23 games, and won the rubber 2-0 with Mann contributing above expectation, especially with his 136 not out at a critical point in the Fifth Test at Port Elizabeth. Secondly, the captain's gladdening temper ensured that the tour was, on and off the field, probably as unstressful as any. When South African captain Dudley Nourse was pressing for a win at Port Elizabeth to square the series, it was Mann who urged England to chase victory, rather than play for a draw. Set 172 in 95 minutes, they won with a minute to spare. ",
        "He then led England in the first two New Zealand Tests of 1949. But because he was unable to make himself available as far ahead as Australia in 1950-51, his Test career was abruptly halted and Freddie Brown appointed in his place. He also resigned the Middlesex captaincy after that summer, turning his perceptive attention to that ready adjunct of both the soldier and the cricketer, namely, beer from then on, most of his cricket was at a minor level. He played his last first-class match in 1958 for the Free Foresters. A compact, dark-haired figure at the crease, he scored quickly and freely and, in all his 166 first-class matches, made 6,350 runs at an average of 25.91; in Tests, he scored 376 at 37.60. His Port Elizabeth Test century was his highest first-class score. \nThat pleasing South African tour ended on a joyful note with a shipboard romance on the homebound journey with a South African, Margaret Marshall Clark, whom he married later in 1949. Family matters, both in a personal and professional sense, began to occupy him more, and for 30 years he helped manage the family brewing concern, Mann, Crossman and Paulin; from 1977 to 1987, he was involved with the Extel press agency. However, he remained close to the first-class game in a number of administrative capacities. He was honorary secretary of Middlesex from 1951 to 1965, their chairman from 1980 to 1983, and president from 1983 to 1990. Additionally, he was president of MCC in 1984-85, chairman of the Cricket Council in 1983, chairman of the TCCB from 1978 to 1983, and a life vice-president of MCC from 1990. He was appointed CBE in 1983. ",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}