{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "1",
            "Ave": "16.16",
            "Ct": "5",
            "HS": "49",
            "Inns": "7",
            "Mat": "4",
            "NO": "1",
            "Runs": "97",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "7",
            "6s": "",
            "Ave": "11.95",
            "Ct": "160",
            "HS": "79",
            "Inns": "349",
            "Mat": "258",
            "NO": "62",
            "Runs": "3430",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "1",
            "Ave": "27.47",
            "BBI": "5/168",
            "BBM": "5/168",
            "Balls": "1044",
            "Econ": "2.68",
            "Inns": "7",
            "Mat": "4",
            "Runs": "467",
            "SR": "61.4",
            "Wkts": "17"
        },
        {
            "": "First-class",
            "10": "13",
            "4w": "",
            "5w": "74",
            "Ave": "22.85",
            "BBI": "8/43",
            "BBM": "",
            "Balls": "59046",
            "Econ": "2.37",
            "Inns": "",
            "Mat": "258",
            "Runs": "23334",
            "SR": "57.8",
            "Wkts": "1021"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154669.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/76400/76435.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJune 11, 1908, Paddington, London "
        ],
        "Bowling style": [
            "Slow left-arm orthodox"
        ],
        "Died": [
            "March 30, 1978, Solihull, Warwickshire (aged 69 years 292 days) "
        ],
        "Full name": [
            "George Alfred Edward Paine"
        ],
        "Height": [
            "\n6 ft 1 in "
        ],
        "Major teams": [
            "England,",
            "Middlesex,",
            "Warwickshire"
        ],
        "Other": [
            "Coach"
        ]
    },
    "profile_info": [
        "\nGeorge Paine, who died at Solihull on March 30, aged 69, was for a short time pretty near the full England side as a slow left-hander and would probably have been picked had anything happened to Verity. In 1934, a season not on the whole helpful to bowlers of his type, he headed the first-class averages with 156 wickets at 17.07. His father and grandfather had both been employed at Lord's and he himself, born at Paddington, was engaged on the Lord's staff and in 1926 played five matches for Middlesex. In only one of these did he meet with any success taking five for 77 and three for 25 against Warwickshire, who were so much impressed with his possibilities that, with the consent of Middlesex, they invited him to qualify for them. As a result of this he was a regular member of their side from 1929 to 1938. \n",
        "In his earlier years though useful he was often expensive, but he wisely concentrated on improving his length, the first essential in a slow left-hander, and gradually acquired more spin, though he never became one of the great spinners and was always a little too inclined to bowl defensively. Still in 1931 for Warwickshire he took 127 wickets at 19.20 and in 1932 136 at 18.93 and after a slight setback in 1933, when his wickets were more expensive, reached his peak in 1934. That winter, going with the MCC to the West Indies, he played in four Tests and had, for a bowler of his type there, a highly respectable record, but on his return his decline was as steady and as rapid as his advance had been. He began to be troubled with rheumatism. In 1935 115 wickets cost him 22.27 each and averages of 28, 30 and 28 in the next three seasons tell their own tale. In 1936 he was in fact kept out of the side for much of the summer by ill-health. At the end of 1938 he failed to agree with the county on terms and left them for league cricket, only reappearing for one match in an emergency in 1947.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}