{
    "batting_averages": [
        {
            "": "Tests",
            "100": "2",
            "50": "7",
            "6s": "2",
            "Ave": "40.00",
            "Ct": "15",
            "HS": "122*",
            "Inns": "29",
            "Mat": "15",
            "NO": "1",
            "Runs": "1120",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "62",
            "50": "194",
            "6s": "",
            "Ave": "35.96",
            "Ct": "477",
            "HS": "220",
            "Inns": "1061",
            "Mat": "643",
            "NO": "82",
            "Runs": "35208",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "12",
            "Econ": "4.00",
            "Inns": "1",
            "Mat": "15",
            "Runs": "8",
            "SR": "-",
            "Wkts": "0"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "1",
            "Ave": "35.68",
            "BBI": "5/50",
            "BBM": "",
            "Balls": "4223",
            "Econ": "3.34",
            "Inns": "",
            "Mat": "643",
            "Runs": "2355",
            "SR": "63.9",
            "Wkts": "66"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/1087799.html",
        "http://www.espncricinfo.com/cricketer/content/story/142346.html",
        "http://www.espncricinfo.com/ci/content/story/129050.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155485.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154740.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/25300/25362.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/25300/25362.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/25300/25362.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJune 13, 1879, Hucknall Torkard, Nottinghamshire "
        ],
        "Bowling style": [
            "Right-arm bowler"
        ],
        "Died": [
            "June 29, 1958, Tylers Green, Cuckfield, Sussex (aged 79 years 16 days) "
        ],
        "Full name": [
            "George Gunn"
        ],
        "Major teams": [
            "England,",
            "Nottinghamshire"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        "A younger brother of John Gunn and a nephew of William Gunn, George Gunn first appeared for Nottinghamshire in 1902. He met with no special success to begin with, but displayed such good style and powers of defence that there could be little doubt about his class. He steadily improved, but a haemorrhage of the lungs late in July ended his cricket for the summer. Happily a winter in New Zealand did him so much good that in 1907 he took the field again and, finishing at the top of the averages, bore a big part in winning the Championship for Nottinghamshire. Although his health was thus obviously re-established, his friends decided that he should spend the next winter in Australia. There went a team sent by M.C.C. and the illness of A. O. Jones, the captain, necessitated a call upon Gunn's services. The young professional made full use of his chance, making 119 and 74 in the first of the five Test matches, 122 not out in the fifth and for the whole tour heading the batting figures with an average of 5l.",
        "Visiting Australia again in 1911-12 under J. W. H. T. Douglas, Gunn again showed to marked advantage, batting so consistently that he averaged 42 in the Test matches. While he enjoyed a well-earned reputation for Test cricket in Australia, he had a tragic experience in England, where only once, at Lord's in 1909, was he called upon to play for his country. Upon his form at the time, his selection was a mistake; he himself thought he should not have been chosen and, playing without his usual confidence, he was dismissed for 1 and 0.",
        "Apart from that failure upon what might have been a big occasion in his life, Gunn enjoyed a wonderfully successful career. For Nottinghamshire before the First World War he made over 13,000 runs in the course of twelve full seasons, his best summer being that of 1913 when he hit 1,697, average nearly 50. On cricket being resumed, he made five separate centuries in 1919, gaining an average of 65. For twelve consecutive seasons he registered over 1,000 runs, his aggregate amounting to nearly 1,800 in 1927 and again in 1928. Among his triumphs was a first-wicket stand of 252 with W. W. Whysall against Kent at Trent Bridge in  1924. He and Whysall altogether associated in 40 three-figure opening partnerships. Three times Gunn put together two hundreds in a match at Nottingham: 132 and 109 not out v. Yorkshire in 1913; 169 and 185 not out v. Surrey in  1919; and 100 and 110 v. Warwickshire in 1927 when aged 48. Characteristic of the man was the game with Yorkshire. He batted six hours for the 132, but, with no occasion for anxiety, he followed with 109 out of 129 in less than ninety minutes. He celebrated his 50th birthday by hitting 164 not out against Worcestershire at Worcester and in the  West Indies next winter he and A. Sandham obtained 322 for the first wicket against Jamaica at Kingston.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}