{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "2",
            "6s": "0",
            "Ave": "15.56",
            "Ct": "13",
            "HS": "66",
            "Inns": "20",
            "Mat": "14",
            "NO": "4",
            "Runs": "249",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "8",
            "50": "54",
            "6s": "",
            "Ave": "19.79",
            "Ct": "450",
            "HS": "122",
            "Inns": "820",
            "Mat": "549",
            "NO": "138",
            "Runs": "13501",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "1",
            "4w": "0",
            "5w": "4",
            "Ave": "29.41",
            "BBI": "7/70",
            "BBM": "12/130",
            "Balls": "3810",
            "Econ": "2.13",
            "Inns": "22",
            "Mat": "14",
            "Runs": "1353",
            "SR": "82.8",
            "Wkts": "46"
        },
        {
            "": "First-class",
            "10": "30",
            "4w": "",
            "5w": "125",
            "Ave": "20.03",
            "BBI": "10/18",
            "BBM": "",
            "Balls": "116292",
            "Econ": "2.13",
            "Inns": "",
            "Mat": "549",
            "Runs": "41336",
            "SR": "56.3",
            "Wkts": "2063"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/128733.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155428.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154709.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/102004/055024.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/102004/055024.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJuly 9, 1893, Barwell, Leicestershire "
        ],
        "Bowling style": [
            "Right-arm fast-medium"
        ],
        "Died": [
            "March 6, 1981, Leicester (aged 87 years 240 days) "
        ],
        "Full name": [
            "George Geary"
        ],
        "Major teams": [
            "England,",
            "Leicestershire"
        ],
        "Other": [
            "Coach"
        ]
    },
    "profile_info": [
        "\nGeorge Geary, who died at the age of 87 on March 6, 1981, after a long period of ill-health, had been in his day one of the best bowlers in the world and was also one of the last survivors of those who were playing regular county cricket before the Great War. A tall, powerful man, he bowled fast-medium well within his strength, with a short run and a beautifully easy action. His stock ball moved naturally form the off and could be deadly if the wicket helped him, as when he ruined his second benefit, against Warwickshire at Hinckley in 1936, by taking thirteen for 43 (the match produced him £10). This was varied by a delivery which came straight through and, a far more dangerous ball, the leg-cutter which pitched on middle-and-leg and left the bat sharply. This was the one which the experts dreaded and which secured the all-important wicket of Bradman, caught at slip for 29, in the Nottingham Test of 1934. Apart from this he could make full use of the shine to swing the new ball. Yet with all these gifts, he will probably be remembered chiefly as a stock bowler who would peg away cheerfully all day if need be, keeping the situation under control whether or not he was getting wickets. As a batsman he never claimed to be a stylist, but he was typically effective: the more runs were needed, the more resolutely he would set himself to get them, not least by punishing ruthlessly anything which fell short of his very high standards of what first-class bowling should be. In his last season, at the age of 45, when an injury prevented him from doing his full share of bowling, he scored three centuries. He was a fine slip, but in fact his vast hands were equally tenacious anywhere: in The Oval Test of 1926, besides two blinding slip catches off Larwood, he caught a brilliant one low at mid-off off Rhodes to dismiss Arthur Richardson. \n",
        null,
        "In 1923 he appeared in a Test trial and in 1924-25 made his first tour abroad, for Lord Tennyson's unofficial side in South Africa, where he was an outstanding success as a bowler. In 1924 he had been picked for his First Test, against South Africa, and in 1926 he played against Australia at Leeds, where Carr put his opponents in with disastrous results. According to Geary his captain's great mistake was taking his batsmen, not his bowlers, out to inspect the wicket. At any rate, when Geary came in the score, in face of a total of 494, was 182 for eight. He and MacAulay added 108, Geary making 35 not out, and, though he could not save the follow-on, he may well have rescued England from defeat. He played again in the final Test at The Oval. That winter he went with MCC to India and in 1927-28 was a member of their side in South Africa, where he took twelve for 130 in the first Test and was reckoned by the South Africans to be, on a matting wicket, the finest bowler of his type since Barnes. Unfortunately, in the Second Test his right arm, which had troubled him intermittently for some years, became so bad that he could not play again until the last match, and further he missed most of the 1928 season. Indeed his career was in jeopardy. He was saved by Lord Harris, who enquired into his case and insisted upon his having the best medical treatment. An operation was performed on his elbow and was so successful that he was not only able to accept an invitation to go to Australia in 1928-29, but, with nineteen wickets at an average of 25, headed the bowling averages in the Tests. At Sydney in the Second Test he followed five for 35 with an innings of 66, and in the final Test at Melbourne he had in the first innings the astonishing analysis of 81-36-105-5. In 1929 he played in the last two Tests against South Africa; in 1930 he played against Australia at Leeds, and in 1934, also against Australia, at Nottingham and Lord's. At Nottingham, coming in at 165 for six, he scored 53, including ten 4s, and helped Hendren to put on 101 in 110 minutes. In 1932 he had gone withLord Tennyson's team to the West Indies and, as he also once took a coaching appointment in South America, he was one of the most widely travelled cricketers of his time.",
        "His last season for Leicestershire was 1938 and then he became the professional at Charterhouse. He showed himself a great coach and in particular was one of the few who could really teach bowling. Feeling that at 65 he would be rash to undertake another three-year contract, he left Charterhouse in 1959 with great reluctance on both sides, but Rugby were desperate for help and persuaded him to come and stand behind their nets. Before the end of the first net he could bear it no longer, had his coat off and continued to bowl for another eleven years.",
        "Few professionals have been more popular and more respected, and deservedly. No-one ever saw him out of temper: he was always cheerful and smiling and had a wonderful sense of humour which made him a splendid raconteur. E. W. Dawson said that, when he took over the Leicestershire captaincy immediately after coming down from Cambridge and utterly inexperienced, he owed everything to Geary, who, though not yet the senior professional, looked after him like a father.",
        "In all first-class matches he made 13,500 runs (including eight centuries) with an average of 19.80 and took 2,063 wickets at 20.03.",
        null,
        null,
        "He was a loyal, hard-working and gifted professional, with a buoyant humour\nso necessary for a stock bowler, especially when he has to get through 81 overs in an innings, as Geary did at Melbourne in 1929, taking 5 for 105.",
        "I went to see him in his tidy little home in 1973, and the reminiscences poured forth in rich profusion but with modesty. I lost track of him, but last year saw him in a nursing home. He now looked his great age, and his memory had gone almost completely.",
        "He was Leicestershire through and through, the eldest of sixteen children of a\nshoemaker in the village of Barwell. The first county match he saw was the first he played in, in 1912. By the time his service to Leicestershire drew to a close in 1938, he had taken 2063 wickets in first-class cricket at 20.04 and scored 13,504 runs at 19.80, with eight centuries. He also held 451 catches.",
        "After coming close to emigrating to Canada, he almost had his cricket career\naborted in 1914 when 21-year-old Aircraftman Geary had his left shoulder\nand thigh slashed by a spinning propeller. He was still suffering severe after-effects in 1919. He played for Nelson in the league in 1920, and then Leicestershire called him back.",
        "With the talented Ewart Astill as co-driver, Geary steered the county's fortunes\nfor the best part of 20 years, carrying the attack both with the new ball and, with his notable stamina, often down the innings. Tall, he had a lively, rhythmic action (I happened, by the oddest chance, to have watched him in action on film only a week before the announcement of his death: a 1926 clip turned up during a session of Wisden Film Search). Like S. F. Barnes, he biassed the ball cleverly and sharply, his leg-cutter being deadly. The outstanding performances began to accumulate.",
        "His best figures came at Pontypridd in 1929: 10 for 18 against Glamorgan, a world record until Verity took 10 for 10. In 1926 he blazed to 39 wickets in eight innings in June, taking 14 in one match at Southampton and 14 in another at Ashby de la Zouch. His batting often came in useful too, although he tended to shrug it off as a casual accessory to his chief role. Some large scores stand to his credit, including a century for Players v Gentlemen, but he found significance in valuable small knocks, like the nine runs he made off 101\nballs in the Adelaide Test of 1928-29, and the four he hit to win the previous Test ('I got £10 for that bat - the bat that won the Ashes!'). That tour began for George Geary with a smashed nose in Perth. He was carried off on a door, no stretcher being available. Yet he was to carry a large burden of responsibility during Chapman's triumphant tour, topping the Test bowling despite missing the opening Test, won by England by an innings and 675 runs on a pitch on which he might easily have taken a dozen wickets.",
        "He played against Australia in 1930 (once) and 1934 (twice), finishing his Test\ndays in 'Verity's match', his only appearance for England at Lord's, when he\nwas almost 41. A fortnight earlier he had saved a little face for England with a\nseventh-wicket stand of 101 at Trent Bridge with Hendren. 'I could see O'Reilly set his teeth,' he recalled. 'It made me set mine.'",
        "Geary's best Test figures came at Johannesburg in the first Test of the 1927-28\nseries. His 7 for 70 and 5 for 60 on the matting promised to be a curtain-up for a repeat of Barnes's sensational feats of 1913-14. But elbow trouble in the second Test forced him out of the series and probably dashed what would have been an English victory.",
        "There have been some catastrophic benefits, but Geary's second, in 1936, ranks\namong the unhappiest, even if it was partly his own doing. At Hinckley, he took 7 for 7 and 6 for 20 against Warwickshire and finished with the princely sum of £10. After retirement came two decades of coaching at Charterhouse, where he schooled the budding genius of Peter May, and one at Rugby.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}