{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "14.62",
            "Ct": "45",
            "HS": "39*",
            "Inns": "28",
            "Mat": "24",
            "NO": "12",
            "Runs": "234",
            "St": "15"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "6",
            "6s": "",
            "Ave": "14.59",
            "Ct": "753",
            "HS": "75",
            "Inns": "545",
            "Mat": "504",
            "NO": "206",
            "Runs": "4947",
            "St": "343"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "24",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "68",
            "Econ": "6.44",
            "Inns": "",
            "Mat": "504",
            "Runs": "73",
            "SR": "-",
            "Wkts": "0"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/316652.html",
        "http://www.espncricinfo.com/bodyline/content/story/316500.html",
        "http://www.espncricinfo.com/bodyline/content/story/316173.html",
        "http://www.espncricinfo.com/bodyline/content/story/316605.html",
        "http://www.espncricinfo.com/lancashire/content/story/219444.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=11946"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/81300/81315.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/81300/81315.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/81300/81315.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMay 9, 1901, Warrington, Lancashire "
        ],
        "Died": [
            "January 5, 1966, Warrington, Lancashire (aged 64 years 241 days) "
        ],
        "Fielding position": [
            "Wicketkeeper"
        ],
        "Full name": [
            "George Duckworth"
        ],
        "Major teams": [
            "England,",
            "Lancashire"
        ]
    },
    "profile_info": [
        null,
        "But Duckworth possessed many other qualities. He was one of the finest wicketkeepers the game has produced; as a batsman he could be relied upon to fight in a crisis; he possessed wit and good humour which made him an endearing companion, and he was a sound judge of a player, an ability which served his native Lancashire well as a committee man in recent years.",
        "Duckworth, born and resident in Warrington all his life, joined Lancashire in 1922. He made his debut a year later and ended his first-class career, perhaps prematurely, in 1938. He took up journalism, but hardly had time to establish himself before war broke out in 1939. Then he spent spells in hotel management and farming before his post-war career, which included journalism, broadcasting, and acting as baggage-master and scorer to M.C.C. teams abroad, and for touring countries here. He also took Commonwealth sides to India.",
        "Duckworth received a trial with Warwickshire before arousing the interest of his native county with whom he quickly showed his talent by the confident manner in which he kept to such varied and demanding bowlers as the Australian fast bowler, E. A. McDonald, and the spin of C. H. Parkin and R. Tyldesley. By 1924 he had gained the first of 24 Test caps for England, a total which undoubtedly would have been much higher but for the competition of L. E. G. Ames of Kent, who in the 1930s usually gained preference because of his batting prowess. In his later days with Lancashire, Duckworth also faced strong competition from Farrimond, which he resisted successfully.",
        "In Test cricket, Duckworth claimed 59 wicketkeeping victims, and he also hit 234 runs, with 39 not out as his highest. For Lancashire his number of victims was a record 921, and his highest score 75. In all first-class matches he helped in 1,090 dismissals, 751 catches and 339 stumpings. He dismissed 107 batsmen, 77  caught and 30 stumped, in his best season, 1928.",
        "That season completed three Championship successes for  Lancashire, captained by Leonard Green, who described  Duckworth as \"one of the smallest, but noisiest of all cricketing artists -- a man born to squat behind the wicket and provide good humour and unbounded thrills day by day in many a glorious summer\".",
        "Lancashire won the Championship again in 1930, and 1934, so that Duckworth gained the honour of being a member of five championship teams. In 1949-50 Duckworth, a man of administrative ability, took his first Commonwealth team to India, Pakistan and Ceylon, and repeated the successful venture in 1950-51 and 1953-54. Then followed his duties as baggage-master and scorer, at home and abroad, where his jovial personality, wise counsel and experience were of benefit to many a team and individual cricketer. His radio and television commentaries, typically humorous and forthright, became well-known, both on cricket and on Rugby League, in which game he was a devoted follower of Warrington.",
        "Among many tributes were:",
        "H. Sutcliffe (Yorkshire and England): George was a delightful colleague, a great man on tours particularly. He had a vast knowledge of the game and he was always ready and willing to help any young player. As a wicketkeeper he was brilliant.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}