{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "2",
            "6s": "0",
            "Ave": "29.90",
            "Ct": "9",
            "HS": "84",
            "Inns": "12",
            "Mat": "7",
            "NO": "2",
            "Runs": "299",
            "St": "3"
        },
        {
            "": "First-class",
            "100": "37",
            "50": "111",
            "6s": "",
            "Ave": "26.71",
            "Ct": "568",
            "HS": "232*",
            "Inns": "1012",
            "Mat": "612",
            "NO": "52",
            "Runs": "25649",
            "St": "78"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "7",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "2",
            "4w": "",
            "5w": "23",
            "Ave": "29.81",
            "BBI": "8/55",
            "BBM": "",
            "Balls": "31848",
            "Econ": "3.51",
            "Inns": "",
            "Mat": "612",
            "Runs": "18666",
            "SR": "50.8",
            "Wkts": "626"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdencricketer/content/story/229628.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155464.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/041998/001881.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/041998/001881.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nOctober 6, 1887, Cowley, Oxford "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "December 3, 1964, Winchester, Hampshire (aged 77 years 58 days) "
        ],
        "Fielding position": [
            "Wicketkeeper"
        ],
        "Full name": [
            "George Brown"
        ],
        "Major teams": [
            "England,",
            "Hampshire"
        ]
    },
    "profile_info": [
        "\nGeorge Brown was one of the most colourful of cricketers. Countless stories were -still are- told about him and, if some are apocryphal, they are no more surprising than many that are undoubtedly true. The earliest recounts that, in the spring of 1906, when he was eighteen, he set out from Cowley in Oxford-\nshire-that prolific nursery of Hampshire cricketers-with a tin trunk, a bat, a pair of plimsolls and the bare price of a single ticket to Southampton. The last, so far as his playing career is concerned, relates that in 1933, rising 46, he began his last season by opening the innings against Surrey on a difficult Oval wicket and carrying his bat for 150 of his side's total of 294.\nIn the interim this remarkable man, utterly fearless, over six feet tall, possessed of immense physical strength and with a deep tan, high cheek bones and imperious nose which gave him the appearance of a Red Indian chief, made a highly individual and varied way across 27 years of cricket. No one has\nquite equalled his allround record. He went in first for England - and,\nwith an average of fifty, was the only consistent English batsman in the\n1921 Tests against Armstrong's Australians with Gregory and McDonald\nas their attacking edge. A left-handed bat with a naturally aggressive\napproach, he drove and hooked with quite savage power. \n",
        "He was never his county's regular wicketkeeper, but at a moment's notice he would pull on a pair of gloves and keep - so one highly critical contemporary declared - as well as anyone in the world: and he kept wicket for England in seven Test Matches. He was chosen for the decisive - Oval - Test of the 1926\nrubber, but had to fall out because of injury.",
        null,
        "Figures show Brown as an erratic player but, unlike many to whom\nthat description may be applied, his failures were usually against weak\nopposition. It was his nature to rise to an occasion. Thus, when Hampshire beat the Australians in 1912 - the last county side to do so until Surrey in 1956  - Brown took four \"key\" wickets. When, at Edgbaston in 1922, Warwickshire bowled out Hampshire for 15, made them follow on and had taken six second innings\nwickets with 31 still wanted to avoid an innings defeat, it was George who led the recovery, unparalleled in cricket history, which enabled Hampshire to win by 155 runs.",
        "Also against Warwickshire, this time at Southampton, after some disagreement with his equally unpredictable captain, Lord Tennyson, George Brown went in to bat at No.10 bearing some strange ruin of a bat. Almost at once he received a fast, short ball from Harry Howell and, swinging round, hit it up over the\nwicketkeeper and over the sight-screen behind him for six. A few moments later a powerful stroke split the old bat: George tore the blade in two as if it were a toy, gave the spare piece to the umpire and batted on unconcernedly with half the blade.",
        "In 1913, at Portsmouth, some feeling crept into the game with Kent and Arthur Fielder, the Kent fast-bowler, let go a bouncer at Brown who dropped his bat to his side, stood up, took - the ball full in the chest, gave an exultant roar of \"He's not fast \" and went on to score 71.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}