{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "2",
            "6s": "1",
            "Ave": "30.33",
            "Ct": "5",
            "HS": "63",
            "Inns": "10",
            "Mat": "6",
            "NO": "1",
            "Runs": "273",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "9",
            "50": "53",
            "6s": "",
            "Ave": "22.01",
            "Ct": "252",
            "HS": "131*",
            "Inns": "606",
            "Mat": "352",
            "NO": "60",
            "Runs": "12018",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "1",
            "5w": "0",
            "Ave": "27.73",
            "BBI": "4/50",
            "BBM": "7/112",
            "Balls": "1367",
            "Econ": "2.80",
            "Inns": "11",
            "Mat": "6",
            "Runs": "638",
            "SR": "59.4",
            "Wkts": "23"
        },
        {
            "": "First-class",
            "10": "40",
            "4w": "",
            "5w": "147",
            "Ave": "18.89",
            "BBI": "9/64",
            "BBM": "",
            "Balls": "63988",
            "Econ": "2.81",
            "Inns": "",
            "Mat": "352",
            "Runs": "30058",
            "SR": "40.2",
            "Wkts": "1591"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/133169.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154776.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/032005/058540.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nOctober 27, 1877, Northampton "
        ],
        "Bowling style": [
            "Right-arm fast-medium"
        ],
        "Died": [
            "March 3, 1943, Clifton, Bristol (aged 65 years 127 days) "
        ],
        "Full name": [
            "George Joseph Thompson"
        ],
        "Major teams": [
            "England,",
            "Auckland,",
            "Northamptonshire"
        ],
        "Other": [
            "Umpire, Coach"
        ]
    },
    "profile_info": [
        "\nGeorge Joseph Thompson, died on March 3 at Bristol in his 67th year. To him largely belonged the credit of raising Northamptonshire to the first class in 1905, and he was recoginsed as the greatest player the county ever produced. After playing in the Wellingborough Grammar School XI, Thompson, when 17 years of age, appeared first for the county in 1895, before Northamptonshire ranked in the second-class competition. When that advance was made Thompson in 1901 and again in 1902 took over a hundred wickets and in batting averaged 36: In 1903, with 92 wickets for ten runs apiece and 33 as batting average, he played a big part in bringing Northamptonshire to the head of the competition. He attained to greater heights in the following summer with 99 wickets for eleven runs each and a batting average of 42. Having won ten matches out of twelve and drawing the others, Northamptonshire in the ensuing winter were received into the first-class circle and in 1905 entered the senior county competition. Prior to that memorable occurrence Thompson, in 1900, put together 125 for Players against Gentlemen at Scarborough, and in the winter of 1902-03 was a member of the team captained by Lord Hawke but led on the field by P. F. Warner. In New Zealand the side won all 18 matches, Thompson playing a notable part in the success with 177 wickets for 6 runs apiece. At Adelaide in South Australia's first innings he took nine wickets for 85. Two years later, when one of Lord Brackley's side in the West Indies, Thompson batted consistently and took 126 wickets at ten runs each. So good was his form that he played for England against Australia at Birmingham in 1909, but he bowled only four overs in a low-scoring match, George Hirst and Blythe sharing the twenty Australian wickets. Next winter he went to South Africa with the team captained by H. D. G. Leveson Gower, and with 33.37 was second to Hobbs in the batting averages, besides taking 23 wickets in the five Test matches, of which three were lost, the rubber going to South Africa. Throughout the tour Thompson showed consistent form without doing anything exceptional. \n",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}