{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "0",
            "50": "0",
            "6s": "0",
            "Ave": "0.00",
            "Ct": "0",
            "HS": "0",
            "Inns": "1",
            "Mat": "1",
            "NO": "0",
            "Runs": "0",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "5",
            "4s": "",
            "50": "40",
            "6s": "",
            "Ave": "17.51",
            "Ct": "214",
            "HS": "126",
            "Inns": "571",
            "Mat": "328",
            "NO": "56",
            "Runs": "9022",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "1",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "12",
            "4w": "",
            "5w": "41",
            "Ave": "16.76",
            "BBI": "8/21",
            "BBM": "",
            "Balls": "32818",
            "Econ": "2.10",
            "Inns": "",
            "Mat": "328",
            "Runs": "11503",
            "SR": "47.8",
            "Wkts": "686"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/1096855.html",
        "http://www.espncricinfo.com/magazine/content/story/265946.html",
        "http://www.espncricinfo.com/ci/content/story/128687.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155650.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/122004/056909.icon.jpg"
    ],
    "personal_info": {
        "Also known as": [
            "GG"
        ],
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nJuly 7, 1856, Ealing, Middlesex "
        ],
        "Died": [
            "February 13, 1932, Denmark Hill, London (aged 75 years 221 days) "
        ],
        "Full name": [
            "George Gibbons Hearne"
        ],
        "Major teams": [
            "England,",
            "Kent"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nGeorge Hearne, the eldest of three brothers--Frank and Alec were the others -- all of whom played with much distinction for Kent, was born at Ealing on July 7, 1856, and derived his qualification for Kent through his father having charge of the Private Banks Ground at Catford Bridge. George Hearne's chance of appearing in the county ranks was, no doubt, materially increased by the fact that in 1875--the first year of Lord Harris's captaincy -- all Kent's home matches with other counties were contested at Catford Bridge. Playing first for Kent in that summer of 1875 when less than nineteen years of age, George Hearne kept his place in the eleven for twenty-one seasons. Primarily a bowler, left-hand round arm, fast medium in pace, he afterwards developed into a capable left-handed batsman. He used to get on a decided natural break and off his bowling manly catches were given in the slips where C. A. Absolom seldom missed a chance. He always batted in correct style and, improving as he increased in strength, played many fine innings, some of which, as Lord Harris wrote, would have been larger but for his captain running him out so often. Smart if not brilliant in the field, George Hearne, as a rule, stood point or mid wicket. Following upon his first season for Kent, he was engaged at Prince's and in 1877 began a connection with the M. C. C. which continued for nearly half a century. \n",
        " G. G., as he was known to all cricketers, took in the course of his twenty-one seasons of county cricket, 577 wickets for Kent at a cost of 16½ runs each and scored 7,344 runs with an average of 18. As a result of his labours as bowler in 1877 and 1878 he had 201 wickets for 12 runs apiece and in 1886--his most successful season as a batsman--he made 987 runs for the county with an average of 41. His aggregate in all first-class matches that year was 1,125, among his big performances being:--126 against Middlesex at Gravesend, when he and his brother Frank shared in a partnership of 226, and 117 against Yorkshire at Canterbury, where he and Cecil (afterwards Bishop) Wilson added 215 while together. Three years later at Gravesend he put together 103 against Sussex, a stand with Frank Marchant, who scored 176, producing 249 runs.",
        "Among George Hearne's bowling feats were:--eight wickets for 46 against Lancashire at Old Trafford, when he performed the hat-trick; four for nine against Hampshire at Winchester; fourteen for 130 against Derbyshire at Derby; thirteen for 75 against Hampshire at Southampton; fourteen for 45 against M. C. C., at Lord's, and eight for 53 against Lancashire at Canterbury -- all in the seventies.",
        "In 1889, When Notts, Lancashire and Surrey tied for the Championship, Notts entered upon their concluding engagement apparently assured of first honours but in this match--at Beckenham--they were dismissed in their second innings for 35. Kent, set 52 to win, lost six wickets for 25 but hit off the remaining run without further loss, George Hearne batting with rare skill on a diabolical pitch for an hour and three-quarters and being not out 14 at the finish.",
        " Hearne participated in May, 1878, in the match at Lord's which established the reputation of Australian cricket, the tourists on that occasion, after dismissing a most powerful M. C. C. team for 33 and 19, putting on 41 and 12 for one wicket and finishing the game off in a single day.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}