{
    "batting_averages": [
        {
            "": "Tests",
            "100": "1",
            "50": "3",
            "6s": "3",
            "Ave": "21.88",
            "Ct": "11",
            "HS": "104",
            "Inns": "26",
            "Mat": "18",
            "NO": "0",
            "Runs": "569",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "53",
            "50": "127",
            "6s": "",
            "Ave": "32.63",
            "Ct": "463",
            "HS": "286",
            "Inns": "855",
            "Mat": "493",
            "NO": "37",
            "Runs": "26698",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "1",
            "5w": "0",
            "Ave": "35.40",
            "BBI": "4/68",
            "BBM": "4/91",
            "Balls": "732",
            "Econ": "2.90",
            "Inns": "14",
            "Mat": "18",
            "Runs": "354",
            "SR": "73.2",
            "Wkts": "10"
        },
        {
            "": "First-class",
            "10": "4",
            "4w": "",
            "5w": "41",
            "Ave": "22.79",
            "BBI": "8/29",
            "BBM": "",
            "Balls": "42442",
            "Econ": "2.81",
            "Inns": "",
            "Mat": "493",
            "Runs": "19904",
            "SR": "48.6",
            "Wkts": "873"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/1087906/an-eleven-for-fielding-heaven",
        "http://www.espncricinfo.com/magazine/content/story/438795.html",
        "http://www.espncricinfo.com/magazine/content/story/337943.html",
        "http://www.espncricinfo.com/magazine/content/story/310591.html",
        "http://www.espncricinfo.com/magazine/content/story/272932.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=15509"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/17800/17804.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/17800/17804.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/17800/17804.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMay 19, 1874, Cheltenham, Gloucestershire "
        ],
        "Bowling style": [
            "Right-arm fast"
        ],
        "Died": [
            "May 11, 1955, Fordington, Dorset (aged 80 years 357 days) "
        ],
        "Full name": [
            "Gilbert Laird Jessop"
        ],
        "Height": [
            "\n5 ft 7 in "
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Gloucestershire,",
            "London County"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        null,
        "Born at Cheltenham on May 19, 1874, he enjoyed a memorable career in first-class cricket which, dating from 1894 to the start of the First World War, extended over twenty years. There have been batsmen who hit the ball even harder than Jessop, notably C. I. Thornton and the two Australians, George Bonnor and Jack Lyons, but no one who did so more often or who, in match after match, scored as rapidly. Where Jessop surpassed all other hitters was in the allround nature of his scoring. At his best, he could make runs from any ball, however good it might be. Although only 5ft 7ins in height, he bent low as he shaped to play, a method which earned him the sobriquet of The Croucher. Extraordinarily quick on his feet, he was ready to hit firm-footed if the ball were pitched well up and equally, when it was of shorter length, to dash down the pitch and drive. When executing leg-side strokes, he almost lay down and swept round with the bat practically horizontal, putting great power behind the ball as, thanks to strong, supple wrists, he also did when bringing off the square cut. Lightness of foot allied to wonderful sight made it possible for him to run out to the fastest bowlers of his time -- Richardson and Mold -- and at the peak of his form pull or straight-drive them with almost unerring certainty. No one ever approached him in this particular feat; indeed, nobody else could have attempted it with reasonable hope of success.",
        "At times Jessop sacrificed his wicket through trying to hit before he got a true sight of the ball or judged the pace of the turf and, not unnaturally in view of the liberties he took with good length bowling, the ball which kept low often dismissed him. A batsman with such marvellous gifts that in half an hour he might win a game seemingly lost, he was a wonderful personality on the field and the idol of spectators who always love a fearless batsman.",
        "Jessop's claims to distinction were not limited to the brilliancy of his run-getting. For a number of years he ranked high as a fast bowler and for a man of his pace he showed surprising stamina. Far more remarkable than his bowling, however, was his fielding, which might fairly be termed as phenomenal as his hitting and which was a matter of great pride to him. No hit proved too hard for him to stop and his gathering and returning of the ball approached perfection. In his early days he fielded at cover-point; later he specialised in the position of extra mid-off, standing so deep that with almost anyone else a run would have been a certainty.  Jessop's presence deterred the boldest of batsmen from making any attempt. In short, such a fine bowler and such a superb fieldsman was he that, even without his batting ability, he would have been worth a place in almost any team. A man of engaging manners, he was a charming companion and, like most truly great men, modest to a degree.",
        "First tried for Gloucestershire in 1894,  Jessop established his reputation a year later when, among other performances, he hit 63 out of 65 in less than half an hour from the Yorkshire bowling at Cheltenham. He continued to assist Gloucestershire till the end of his first-class career and for thirteen years from 1900 he captained the side. By 1897 he had become one of the great players of the day, making 1,219 runs in first-class matches and taking 116 wickets for less than 18 runs each. In that summer he hit two particularly noteworthy innings - 140 for Cambridge University against the Philadelphians in 95 minutes and 101 out of l18 in 40 minutes against  Yorkshire at Harrogate. In the course of the latter display he hit the ball six times out of the ground and some dozen times over the ropes. Until 1907 a hit over the ropes counted four; only a hit out of the ground earned six. Except in 1898 he regularly made over 1,000 runs every season until 1909, when a bad back injury sustained while fielding in the Test match at Leeds in early July kept him out of the game for the rest of the year. In 1900 he scored 2,210 runs and took 104 wickets and next summer his aggregate amounted to 2,323, including 157 out of 201 in an hour against West Indies at Bristol.",
        "Among his 53 centuries were five of more than 200: 286 out of 335 in 175 minutes for Gloucestershire against Sussex at Brighton, 1903(he and J. H. Board adding 320 for the sixth wicket); 240 out of 337 in 200 minutes for Gloucestershire v. Sussex at Bristol, 1907; 234 out of 346 in 155 minutes for Gloucestershire v. Somerset at Bristol, 1905; 233 out of 318 in 150 minutes for An England XI v. Yorkshire at  Lord's, 1901; and 206 out of 317 in 150 minutes for  Gloucestershire v. Nottinghamshire at Trent Bridge,  1904.",
        "Four times for Gloucestershire he reached three figures in each innings of a match: 104 and 139 v. Yorkshire at Bradford, 1900, when the newspapers stated that, in the two innings he cleared the ropes more than twenty times; 143 and 133 not out v. Somerset at Bath,  1908; 161 and 129 v. Hampshire at Bristol, 1909; and 153 and 123 not out v. Hampshire at Southampton, 1911. He achieved the feat on another occasion, against Somerset in a friendly game organised for the opening of a new club pavilion. S. M. J. Woods termed this a remarkable performance on a pitch far from true and against professional bowling. Altogether in first-class cricket he hit 26,058 runs, average 32.60.",
        "His bowling successes included 8 wickets for 34 runs v. Hampshire, 1898; 5 for 13 v. Lancashire, 1895; 8 for 54 v. Lancashire, 1898; 8 for 29 v. Essex, 1900; 8 for 58 v. Middlesex, 1902. All these were achieved for Gloucestershire except that against Hampshire, on which occasion he was playing for Cambridge. His wickets in first-class cricket totalled 851, average 22.91.",
        " Jessop took part in eighteen Test matches between 1899 and 1909, thirteen against Australia and five against South Africa, and would probably have appeared in others but for the back strain he suffered in l909. He disappointed in  Australia except for his fielding, and in most of the contests in England met with moderate success; but he earned undying fame in The Oval Test of 1902. There, under conditions considerably helpful to bowlers, England, set 273 to make to win, lost their first five wickets for 48.  Australia looked to have the match in hand, but Jessop joined F. S. Jackson and in marvellous fashion hit 104 out of 139 in an hour and a quarter, paving the way to victory by one wicket for England. Twice he sent the ball on to the roof of the Pavilion and from another big hit was caught on the Players' Balcony by H. K. Foster.",
        "Jessop went to Cambridge in 1896 and played for the University for four seasons, being captain in 1899. He accomplished little of note against Oxford in the way of batting, two innings of over 40 being his best scores on the big occasion, but he bowled to good purpose in two of the games, taking six wickets for 65 in the first innings in 1897 and six for 126 in the first innings a year later.",
        "Besides his cricketing ability, Jessop was an allround athlete of note. He got his Blue as a hockey goalkeeper, but fell ill and could not play in the University match; came near getting an Association football Blue and played for The Casuals as half-back or goalkeeper. He also appeared as a wing-threequarter for Gloucester R.F.C. He would have played billiards for Cambridge against Oxford, but was gated and could not take part. In one week he made two breaks of over 150. He could run the 100 yards in 10.2 seconds and frequently entered for sports meetings. A scratch golfer, he took part in the Amateur Championship in 1914, was Secretary of the Cricketers' Golfing Society and for some years Secretary of the Edgware Club.",
        "In addition to the visit he paid to Australia in 1901-02 under A. C. MacLaren, he went to America with the team captained by P. F. Warner in 1897, and again in 1899 when K. S. Ranjitsinhji led the side.",
        "For Beccles School in 1895, when a master there, Jessop scored 1,058 runs, average 132, and took 100 wickets at a cost of less than two and a half runs apiece.",
        "He served as a captain in the Manchester Regiment during the First World War from 1914 till he was invalided out with a damaged heart in 1918. Married in October 1902, he first met his bride a few months earlier during his visit to Australia. She died in 1953.",
        "Tributes paid to Jessop include:",
        "Sir Pelham Warner: \"He was a wonderful cricketer. It was a great pleasure to play with or against him. It has been said that he was unorthodox, but no one watched the ball more closely.\"",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}