{
    "batting_averages": [
        {
            "": "Tests",
            "100": "2",
            "50": "8",
            "6s": "7",
            "Ave": "20.49",
            "Ct": "173",
            "HS": "104",
            "Inns": "133",
            "Mat": "91",
            "NO": "14",
            "Runs": "2439",
            "St": "46"
        },
        {
            "": "First-class",
            "100": "7",
            "50": "62",
            "6s": "",
            "Ave": "21.22",
            "Ct": "816",
            "HS": "144",
            "Inns": "753",
            "Mat": "465",
            "NO": "52",
            "Runs": "14882",
            "St": "250"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "91",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "122.50",
            "BBI": "2/50",
            "BBM": "",
            "Balls": "286",
            "Econ": "5.13",
            "Inns": "",
            "Mat": "465",
            "Runs": "245",
            "SR": "143.0",
            "Wkts": "2"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/785081/glovemen-apart",
        "http://www.espncricinfo.com/blogs/content/story/623651.html",
        "http://www.espncricinfo.com/magazine/content/story/377353.html",
        "http://www.espncricinfo.com/magazine/content/story/144863.html",
        "http://www.espncricinfo.com/wcm/content/story/145384.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=12543"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/254200/254233.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/254200/254233.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/254200/254233.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nAugust 18, 1920, Finchley, Middlesex "
        ],
        "Bowling style": [
            "Legbreak"
        ],
        "Died": [
            "May 3, 1999, Northampton (aged 78 years 258 days) "
        ],
        "Education": [
            "Kent College, Canterbury"
        ],
        "Fielding position": [
            "Wicketkeeper"
        ],
        "Full name": [
            "Thomas Godfrey Evans"
        ],
        "Major teams": [
            "England,",
            "Kent"
        ]
    },
    "profile_info": [
        "\nGodfrey Evans was arguably the best wicketkeeper the game has ever seen. Debates about wicketkeepers cannot be stilled by statistics but what is beyond question is that Evans was the game's most charismatic keeper: the man who made the game's least obtrusive specialism a spectator sport in itself. His energy and enthusiasm brought the best out of other fielders, whatever the state of the game. But he added to that a technical excellence that has probably never been surpassed. \n",
        "Evans was born in North London, but moved to Kent when he was a baby and was brought up by his grandfather after the death of his mother. At Kent College, he was an all-round sportsman, and played in the school team mainly as a batsman: the games master thought wicket-keeper was a good place to hide one of the team's less mobile fielders. He made his  Kent debut in July  1939 as a batsman, but kept wicket in three of his next four games before the war came. His reputation only flourished when the former  England captain,  A. E. R. Gilligan, saw him in a Services match in 1942 and ensured that he received invitations for the major wartime matches.",
        "By the end of the first post-war summer,  Evans had displaced Paul Gibb as  England's  wicket-keeper, after an excellent performance for the Players at  Lord's when he did not concede a bye. He let through one on his Test debut at  The Oval, which irritated him years later:  a silly little blighter from Jim Langridge, outside off stump. That kind of perfectionism ensured that there was no serious challenge to his pre-eminence for the next 13 years. At  Sydney, in  1946-47, he began standing up to  Alec Bedser, at first only for the old ball, then all the time. His menacing presence there made the bowler better and more confident; above all, according to  Bedser, it ensured that he bowled a full length.  Bedser got the idea from Herbert Strudwick, who had stood up to Maurice Tate; he insists that  Evans's fingers were never even marked by the experience.  He was so quick, and had such wonderful hands, you see.",
        "Evans was not ashamed to tumble, perhaps making the comparatively easy look difficult. But he also executed stumpings with lightning speed, making the difficult look absurdly easy. He was one of the most theatrical of cricketers but, as with all the great performers, the apparent ease masked a self-discipline that the audience never suspected. His greatest secret was the meticulously observed lunchtime siesta ritual, which enabled him to keep fresh and focused. This gave him the ability to conduct the team like an orchestra, and he could flog life from the tired limbs of his teammates at the end of the hottest day. He had a remarkable physique: strong, sturdy, squat and astonishingly resilient, plus a keen eye, remarkable concentration and sharp reflexes.  Evans might have taken up boxing for a career: he flattened several opponents before the Kent authorities intervened and told him to choose between the sports. He chose.",
        "At home, he missed only five Tests in 12 seasons between 1947 and 1958, and in all played 91. After the  1946-47 tour, Bill O'Reilly wrote that wicket-keeping was the only department where  England matched  Australia. In  1950-51, according to Trevor Bailey,  Evans did not miss a chance, and took one at  Melbourne that still amazed Bailey years later, when he  caught Neil Harvey standing up to  Bedser one-handed, horizontal, and airborne down the  leg side off a genuine leg-glance. But  Evans's value to his side and his popular appeal also hinged on his batting. At Adelaide in 1946-47, he famously batted for 97 minutes without scoring, to help Denis Compton to his second century of the match, and avoid likely defeat. More often, his batting was as flashy as his wicket-keeping: highlights included a century in the Old Trafford Test of 1950 and another against India at Lord's two years later, when he scored 98 before lunch.",
        null,
        "Keeping alone could not account for his popularity. He made his highest score, 144, at Taunton in 1952. Afterwards, it was announced that there would be a collection for Somerset's beneficiary, Harold Gimblett. Evans at once volunteered to go round with the box, which he did with his cheery smile and banter, making the takings far larger than they would have been. He was always generous himself for good causes. He was equally famous for his night-time roistering, some of which would - in a sterner age - have got him into terrible trouble with the tabloids. His standard shipboard party piece, as Carmen Miranda leading the team in a fancy dress conga, has never quite been forgotten. Many who knew him well believe that behind the extrovert lay a rather sadder figure: he never quite settled into steady post-cricket employment. \"For all that Godfrey was a cricketing Falstaff,\" said his biographer Christopher Sandford, \"there was a touch of Hamlet too. He thought and fretted about life more than he let on.\"",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}