{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "4",
            "50": "0",
            "6s": "1",
            "Ave": "28.00",
            "BF": "35",
            "Ct": "0",
            "HS": "27*",
            "Inns": "2",
            "Mat": "2",
            "NO": "1",
            "Runs": "28",
            "SR": "80.00",
            "St": "0"
        },
        {
            "": "ODIs",
            "100": "0",
            "4s": "4",
            "50": "0",
            "6s": "0",
            "Ave": "43.00",
            "BF": "56",
            "Ct": "2",
            "HS": "28*",
            "Inns": "4",
            "Mat": "4",
            "NO": "3",
            "Runs": "43",
            "SR": "76.78",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "2",
            "4s": "",
            "50": "16",
            "6s": "",
            "Ave": "20.33",
            "BF": "",
            "Ct": "73",
            "HS": "115*",
            "Inns": "229",
            "Mat": "188",
            "NO": "34",
            "Runs": "3965",
            "SR": "",
            "St": "0"
        },
        {
            "": "List A",
            "100": "0",
            "4s": "",
            "50": "2",
            "6s": "",
            "Ave": "13.00",
            "BF": "",
            "Ct": "40",
            "HS": "81*",
            "Inns": "165",
            "Mat": "225",
            "NO": "27",
            "Runs": "1794",
            "SR": "",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "36.60",
            "BBI": "3/111",
            "BBM": "3/111",
            "Balls": "312",
            "Econ": "3.51",
            "Inns": "3",
            "Mat": "2",
            "Runs": "183",
            "SR": "62.4",
            "Wkts": "5"
        },
        {
            "": "ODIs",
            "10": "0",
            "4w": "1",
            "5w": "0",
            "Ave": "17.85",
            "BBI": "4/33",
            "BBM": "4/33",
            "Balls": "192",
            "Econ": "3.90",
            "Inns": "4",
            "Mat": "4",
            "Runs": "125",
            "SR": "27.4",
            "Wkts": "7"
        },
        {
            "": "First-class",
            "10": "2",
            "4w": "",
            "5w": "18",
            "Ave": "28.84",
            "BBI": "8/57",
            "BBM": "",
            "Balls": "26668",
            "Econ": "3.16",
            "Inns": "",
            "Mat": "188",
            "Runs": "14075",
            "SR": "54.6",
            "Wkts": "488"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "10",
            "5w": "4",
            "Ave": "23.07",
            "BBI": "5/27",
            "BBM": "5/27",
            "Balls": "10191",
            "Econ": "4.17",
            "Inns": "",
            "Mat": "225",
            "Runs": "7085",
            "SR": "33.1",
            "Wkts": "307"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/963177.html",
        "http://www.espncricinfo.com/england/content/story/712375.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/177300/177387.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nDecember 16, 1955, Ackworth, Yorkshire "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "January 21, 2014 (aged 58 years 36 days) "
        ],
        "Education": [
            "Minsthorpe High School"
        ],
        "Full name": [
            "Graham Barry Stevenson"
        ],
        "Height": [
            "\n6 ft 0 in "
        ],
        "Major teams": [
            "England,",
            "Northamptonshire,",
            "Yorkshire"
        ],
        "Nickname": [
            "Moonbeam"
        ]
    },
    "profile_info": [
        "\nGraham Stevenson, the former Yorkshire and England allrounder was recognised by many good judges as a cricketer of enormous natural talent. \"As good as Botham,\" Yorkshire observers were particularly inclined to claim. But while Botham enjoyed a hugely successful England career, Stevenson's international experience amounted to two Tests and four one-day internationals. \n",
        "If his international career was brief, his England debut in an ODI in Sydney in 1980 provided a wonderful story. Stevenson was 25, eager to build on a fine season in county cricket. He returned bowling figures of 4 for 33 - Rod Marsh, Dennis Lillee, Greg Chappell and Len Pascoe making up a famous quartet - as Australia were dismissed for 163.",
        "England were struggling at 129 for 8 when Stevenson joined his old Yorkshire mucker, David Bairstow, at the crease. \"Evening lad - we can piss this,\" Bairstow greeted him. They did, too, winning by two wickets with more than an over to spare, Stevenson ending unbeaten on 28 from 18 balls, and sprinted from the field like a couple of jubilant schoolfellows.",
        "He made a Test debut the following month in Mumbai against India in a match to commemorate the golden jubilee of the BCCI. But he only made one more Test appearance after that, against West Indies in Antigua the following winter. Even so, he could count Dilip Vengsarka, Gordon Greenidge and Clive Lloyd among his five Test victims.",
        "That Stevenson's talent never entirely flowered owed much to injury, but it was also due in some manner to his easy-going disposition and maddening lapses of concentration. He played in a deeply disunited era in Yorkshire cricket, but he was an affable, easy-going character who never had time for politics, as his nickname of Moonbeam testified. Geoffrey Boycott repeatedly named him as one of his favourite cricketers.",
        "As well as being a fine seam bowler who could move the ball both ways at challenging pace, he was a late-order batsman of great insouciance who loved nothing better than to launch good-length deliveries high and hard over extra cover and a brilliant fielder with one of the most powerful arms in the country.\n \nAgainst Northamptonshire at Headingley in 1980 he grabbed the first eight wickets at a cost of 57. Only Tim Lamb, who was to become the chairman of the Test and County Cricket Board, and Jim Griffiths, a notorious rabbit, were to come and he could well have gone on to bag all ten but much to the disbelief of his team manager Raymond Illingworth, he left the field to change his sweat-soaked shirt. ",
        "But perhaps one of most headline grabbing acts was with the bat when he shared a Yorkshire record-breaking last wicket stand of 149 with Boycott against Warwickshire at Edgbaston in May 1982. Coming in as last man, Stevenson thrashed 115 not out, at the time the highest unbeaten score ever recorded by a No 11 batsman. Boycott suggested afterwards: \"It was my brains and experience and Graham's skill that saw us through.\" ",
        "Stevenson was surely a candidate on that day as the finest batsman ever to stroll out for Yorkshire at No. 11. The 1980s was a lean period for Yorkshire, but they could boast depth in batting and on several occasions fielded an entire side with first-class centuries to their credit. ",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}