{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "86",
            "50": "7",
            "6s": "2",
            "Ave": "30.71",
            "BF": "",
            "Ct": "35",
            "HS": "77",
            "Inns": "32",
            "Mat": "21",
            "NO": "4",
            "Runs": "860",
            "SR": "",
            "St": "0"
        },
        {
            "": "ODIs",
            "100": "0",
            "4s": "7",
            "50": "0",
            "6s": "2",
            "Ave": "21.62",
            "BF": "342",
            "Ct": "2",
            "HS": "44",
            "Inns": "8",
            "Mat": "8",
            "NO": "0",
            "Runs": "173",
            "SR": "50.58",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "26",
            "4s": "",
            "50": "107",
            "6s": "",
            "Ave": "36.90",
            "BF": "",
            "Ct": "602",
            "HS": "171",
            "Inns": "647",
            "Mat": "403",
            "NO": "129",
            "Runs": "19116",
            "SR": "",
            "St": "2"
        },
        {
            "": "List A",
            "100": "2",
            "4s": "",
            "50": "31",
            "6s": "",
            "Ave": "28.28",
            "BF": "",
            "Ct": "143",
            "HS": "120*",
            "Inns": "287",
            "Mat": "308",
            "NO": "48",
            "Runs": "6761",
            "SR": "",
            "St": "2"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "172",
            "Econ": "2.65",
            "Inns": "6",
            "Mat": "21",
            "Runs": "76",
            "SR": "-",
            "Wkts": "0"
        },
        {
            "": "ODIs",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "8",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "4",
            "Ave": "37.35",
            "BBI": "5/14",
            "BBM": "",
            "Balls": "17497",
            "Econ": "2.88",
            "Inns": "",
            "Mat": "403",
            "Runs": "8404",
            "SR": "77.7",
            "Wkts": "225"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "2",
            "5w": "1",
            "Ave": "29.79",
            "BBI": "5/23",
            "BBM": "5/23",
            "Balls": "5159",
            "Econ": "4.53",
            "Inns": "",
            "Mat": "308",
            "Runs": "3903",
            "SR": "39.3",
            "Wkts": "131"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/307164.html",
        "http://www.espncricinfo.com/england/content/story/270091.html",
        "http://www.espncricinfo.com/ci/content/story/128805.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/154100/154132.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/154100/154132.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/154100/154132.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJuly 12, 1946, Fareham, Hampshire "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "November 26, 2006, Grenada (aged 60 years 137 days) "
        ],
        "Education": [
            "Bradfield College"
        ],
        "Full name": [
            "Graham Richard James Roope"
        ],
        "Major teams": [
            "England,",
            "Berkshire,",
            "Griqualand West,",
            "Minor Counties,",
            "Surrey"
        ]
    },
    "profile_info": [
        "\n\"I ain't no square with my corkscrew hair,\" declared that bopping elf Marc Bolan. Nor, assuredly, was that genial chatterbox Graham Roope, another\nbeloved curly-locked entertainer whose sudden death of a heart attack during a 60th birthday trip to Grenada robbed the game of one of its more charismatic figures.  \n",
        "Eyebrows were hoisted in the 1970s when England's selectors repeatedly picked a batsman whose first nine Test knocks begat 137 runs. Roope, happily, had other\nrabbits up his sleeve. So ragged was English slip fielding between the decline of Colin Cowdrey and emergence of Ian Botham that two county stalwarts who might have stayed in the margins found opportunity knocking: 'Roopey' and\nPhil Sharpe. If Sharpe's anticipation was marginally superior, the Hampshire-born Roope was the more athletic.",
        "Reactions sharpened by goalkeeping stints for Wimbledon, Kingstonian and Corinthian Casuals, he took 602 catches, a haul surpassed among exclusively postwar players by only Graeme Hick (668) and Keith Fletcher (644), who\nboth put in many more seasons than the 19 in which Roope served Surrey from 1964 to 1982. Geoff Arnold, that arch-seducer of outside edges, rates him among the best half-dozen slips he has seen.",
        "A product of Bradfield College who represented the Public Schools and played for Berkshire at 17, he collected his first 35 catches in 19 Tests; only Jack Gregory, WG Grace, Bobby Simpson and Eknath Solkar did so in fewer. Twice he took 17\nin a calendar year; only Marcus Trescothick among Englishmen has taken that many more often. Despite 19,116 first-class runs at 36.90 and eight 1,000-run summers, his natural exuberance was seldom glimpsed on the loftiest stages. \"He could be exasperating,\" remembers Alan Butcher, Surrey's current\ncoach. \"He wasn't as confident as he should have been, so perhaps didn't\nalways push himself into positions where he might fail. ",
        "\"He was always the unluckiest bloke in the world. During practice at Portsmouth one time someone hit the ball on to the square and the big roller rolled it into the pitch two foot wide of off stump. Of course, he was the only one who got a ball that pitched there, nipped back and bowled him.\" More genuine ill-luck came in his benefit year: scammed by a fraudster, he made a loss.",
        "Venturing north in retirement, he played for Farsley in the Yorkshire leagues while summarising for Radio Leeds and coaching at Ampleforth College\nand Woodhouse Grove, where he was also head groundsman when he died. \"I roomed with him in the Caribbean and barely got a wink,\" recalls Stephen Thorpe, captain of the touring Lazarusians. \"Just as you were nodding off, usually around 4am, Graham would rouse from his slumber ... 'and another\nthing, did I tell you about when Brears accidentally introduced me to the Queen as Cyril Roope?'\"",
        null
    ],
    "recent_matches": [
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}