{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "17.75",
            "Ct": "0",
            "HS": "32",
            "Inns": "4",
            "Mat": "4",
            "NO": "0",
            "Runs": "71",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "1",
            "50": "44",
            "6s": "",
            "Ave": "17.96",
            "Ct": "123",
            "HS": "143",
            "Inns": "525",
            "Mat": "321",
            "NO": "31",
            "Runs": "8873",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "4",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "33.66",
            "BBI": "4/13",
            "BBM": "",
            "Balls": "7094",
            "Econ": "3.27",
            "Inns": "",
            "Mat": "321",
            "Runs": "3872",
            "SR": "61.6",
            "Wkts": "115"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/714423.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155744.html"
    ],
    "latest_photos": [],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJune 29, 1896, Denmark Hill, London "
        ],
        "Bowling style": [
            "Legbreak"
        ],
        "Died": [
            "May 5, 1978, Stroud Common, Shamley Green, Surrey (aged 81 years 310 days) "
        ],
        "Full name": [
            "Alfred Herbert Harold Gilligan"
        ],
        "Major teams": [
            "England,",
            "Sussex"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nHarold Gilligan was the youngest of three brothers all of whom played first-class cricket. Although Frank, the eldest, played for Essex before emigrating to New Zealand, the name of Gilligan became synonymous with Sussex cricket for a decade and more following the First World War (during which Harold was awarded the AFC).  \n",
        "Alfred Herbert Harold Gilligan played regularly from 1919 until 1930 and in his last year he captained the Sussex side. In the winter of 1929-30 he captained the MCC team which toured New Zealand and which played the first official Test matches against that country. He proved himself not only an astute captain but also a diplomat of considerable ability. His charming and likeable personality was, in large measure, responsible for this tour being remembered to this day with affection by many New Zealanders. ",
        "After the last War his interest in cricket moved to The Oval and the Surrey club. Here he served with distinction as a member of the committee. For a time he was the club's honorary treasurer and at the time of his death was a vice-president of the club. He also served for a number of years on the cricket sub-committee of MCC.",
        "Harold was, like his brother Arthur, an all-round sportsman, a keen golfer and an ardent skier. He was a man of integrity, one who was never afraid to speak his mind yet always appreciating the other man's point of view.",
        "To one like myself, who had known him for so many years, he never changed and remained a stalwart friend, always ready to give help and advice, when asked to do so, or to welcome one into his hospitable and charming home. The warmth of his personality created for him a wide circle of friends who will remember him with great affection.\n"
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}