{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "2",
            "6s": "2",
            "Ave": "19.40",
            "Ct": "15",
            "HS": "98",
            "Inns": "28",
            "Mat": "21",
            "NO": "3",
            "Runs": "485",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "3",
            "50": "23",
            "6s": "",
            "Ave": "19.91",
            "Ct": "234",
            "HS": "102*",
            "Inns": "438",
            "Mat": "361",
            "NO": "72",
            "Runs": "7290",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "1",
            "4w": "3",
            "5w": "4",
            "Ave": "28.35",
            "BBI": "6/32",
            "BBM": "10/124",
            "Balls": "4969",
            "Econ": "2.67",
            "Inns": "36",
            "Mat": "21",
            "Runs": "2212",
            "SR": "63.7",
            "Wkts": "78"
        },
        {
            "": "First-class",
            "10": "20",
            "4w": "",
            "5w": "98",
            "Ave": "17.51",
            "BBI": "9/41",
            "BBM": "",
            "Balls": "58027",
            "Econ": "2.58",
            "Inns": "",
            "Mat": "361",
            "Runs": "24994",
            "SR": "40.6",
            "Wkts": "1427"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/1150405/what-do-bodyline-and-sandpapergate-have-in-common",
        "http://www.espncricinfo.com/magazine/content/story/1126583.html",
        "http://www.espncricinfo.com/magazine/content/story/818049.html",
        "http://www.espncricinfo.com/magazine/content/story/758659.html",
        "http://www.espncricinfo.com/magazine/content/story/697733.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=16207"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/213600/213679.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/213600/213679.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/213600/213679.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nNovember 14, 1904, Nuncargate, Nottinghamshire "
        ],
        "Bowling style": [
            "Right-arm fast"
        ],
        "Died": [
            "July 22, 1995, Randwick, Sydney, New South Wales, Australia (aged 90 years 250 days) "
        ],
        "Full name": [
            "Harold Larwood"
        ],
        "Major teams": [
            "England,",
            "Europeans (India),",
            "Nottinghamshire"
        ]
    },
    "profile_info": [
        null,
        "There was one further phase. As the year lived in Australia came to equal those spent in his native England, Larwood became something of a curiosity, still generously receiving pilgrims and journalists at his Kingsford home, even though his eyesight failed in later years. And when British Prime Minister John Major gave Larwood's cricket achievement belated recognition by awarding him the MBE in 1993, his picture made the newspapers again, together with characteristic quotes from the old fast bowler as he contemplated the changes that had overtaken cricket in the many years since he was headline news himself. Scoffing at the amount of protective gear worn by modern batsmen, Larwood described them as `trussed up like turkeys' and asserted that they `should stand up and be counted like men'.",
        " Larwood, who died in hospital in Sydney on July 22, aged 90, was the key figure in the never-to-be-allowed-to-be-forgotten `Bodyline' Test series of 1932-33, when England's supercilious, icy and provocative captain Douglas Jardine instructed him to bowl what they both insisted on calling ` leg theory' at the Australian batsmen. With Bill Voce, his hefty Notts team-mate, bowling fast left-arm from the other end, `Lol' Larwood spearheaded England to a 4-1 series victory, taking 33 wickets at just under 20 apiece as batsmen ducked, weaved and skipped, the heavy concentration of vulture-like leg-side fielders ready for catches from hurried defensive jabs.",
        " Larwood's classical action, copied by countless schoolboys - including Ray Lindwall in Sydney - culminated in a side-on delivery, the ball's velocity touching the highest ever recorded",
        " Don Bradman, the prime target was reduced to comparative mediocrity with an average of 56 - he had made 974 runs (at 139.14) in England in the previous Ashes series of 1930- with Larwood hurrying him into indiscretions and taking his wicket four times in eight Test innings (and twice in the only other match in which they were in opposition, the Australian XI match at Melbourne before the First Test).",
        "In the Adelaide Test, Australian exasperation reached white heat as the captain, Bill Woodfull, was struck stunningly over the heart by a lifting ball from Larwood- whose captain cynically switched to the Bodyline field as soon as Woodfull was able to continue - and Bert Oldfield suffered a fracture when edging another Larwood delivery onto his temple. Mounted police mustered behind the pavilion as the masses of spectators hooted and jeered and threatened to storm the field.",
        " Woodfull later made some terse remarks to the sheepish MCC manager P. F. Warner, and the Australian Cricket Board fired off a cable to Lord's, protesting at the English bowling tactics. The respective governments were drawn into the controversy, but financial considerations saw to it that the series was played out, and Larwood even heard himself cheered wildly by the Sydney crowd in the final Test as he walked off after scoring 98 as nightwatchman batsman. The worst of the personal vilification was behind him, and some humour even emerged from the battleground. Lines from a popular contemporary revue ran: `Oh, they'd be a lot calmer in Ned Kelly's armour/When Larwood the wrecker begins.'",
        "He finished with a painfully damaged foot, but Jardine would not let him leave the field until Bradman was dismissed, the fast bowler's continuing presence serving as a depressant to Australia. The two principal adversaries left the field together, neither speaking.",
        " Larwood never played for England again. Welcomed home as a popular hero, he soon found that `diplomacy' was at work. At Lord's members of the MCC committee had begun to understand the cause of Australian indignation. That cricket had been damaged was becoming obvious to all but the blindly partisan. Moves to outlaw the leg-side field-setting, if not the short-pitched fast ball, were instituted. And a letter of apology was drawn up for signature by Harold Larwood, the arch-exponent of Bodyline. Since he had been bowling to orders and believed in his heart that there was nothing sinister in his method of attack, he refused to sign the letter. His Test career was over at 28.",
        "The broken left foot prevented him from bowling in 1933, but when Woodfull's 1934 team landed in England, speculation was high. Would Larwood resume combat with the Australians? Overlooked for the First Test allegedly because of a bruised foot, he spared the selectors any dilemma by stating before the Lord's Test: `I refuse to play in any more Tests. Politicians are trying to hound me out of cricket. I was fit for the last Test. They feared I would burst the Empire.'",
        "He took 82 cheap wickets for Notts that summer, and over 100 in 1935 and 1936, topping the national bowling averages in 1936 for the fifth time in his life, a deed unmatched by any other fast bowler. England had clearly denied themselves a great talent.",
        "Captain Jardine, architect of the Bodyline upheaval, paid no penalty, led England in India a year later, and declared himself unwilling to play against Australia again.",
        "Harold was the fourth of five sons presented to miner Robert Larwood by his wife. He was born in Nuncargate, Notts on Nov 14, 1904 (precisely the same day as future Archbishop of Canterbury, Michael Ramsey). Larwood left school at 13 and worked in a shop before becoming a pit-boy, working with the ponies. The teenaged fast bowler showed distinct promise in village and junior league matches, and at 19 he was signed by Nottinghamshire.",
        "In 20 matches in 1925 he took 73 wickets and frightened a few batsmen, and the following year found him playing his First Test, against Australia at Lord's where he dismissed Charlie Macartney, Jack Gregory and Herby Collins. England's captain was Arthur Carr, who was also Larwood's county skipper, a tough, uncompromising man who had most to do with developing and encouraging this bright new talent.",
        " Larwood was not chosen again until the final Test, when England regained the Ashes at the Oval from an ageing Australian combination. The home team recalled 48-year-old spinner Wilfred Rhodes, and with Hobbs and Sutcliffe making high-class centuries, victory was achieved by 289 runs. Young Larwood captured six wickets.",
        "Around 5ft 8ins, but strongly-built with wide shoulders and long arms, he had a smooth, rhythmic approach and a high arm action. His speed was truly exceptional, and because of his lack of height, his bouncer tended to skid, veering into the ribs rather than wastefully over the head. The schoolboy Ray Lindwall drew upon this action after watching through the pickets at the SCG in 1932-33. In more recent times, the Pakistan express bowler Waqar Younis has had much of Larwood's movement about his run-up and delivery. Larwood's stock ball snapped in from the off, and in days when leg-before dismissals could be granted only from balls that pitched between wicket and wicket, he was denied many a dismissal that would have been given to succeeding generations of bowlers.",
        "There is a macabre tendency to assess fast bowlers' potency by the injuries they inflict. Larwood always claimed that he never tried to hit a batsman - though legend has it that he and Voce bet each other a packet of fags over who would be first to strike an Indian batsman on the turban in 1932. (Beer and cigarettes, incidentally, were Larwood's staple intake during intervals.) Among batsmen who sustained serious injury from Larwood's thunderbolts were Reg Sinfield of Gloucestershire, the South African `Jock' Cameron, and Patsy Hendren, a seasoned exponent of the hook shot. All were stretchered off unconscious. Scores of others suffered breaks and bruises in the line of Larwood's fire, and many a batsman in county cricket discovered minor ailments that necessitated their withdrawal before matches against Nottinghamshire.",
        "In 1927, Larwood embarked on a marriage which was to last into its seventh decade, and in 1928, after two Test appearances that summer against West Indies, he went to Australia with Percy Chapman's 1928-29 side and was part of a highly successful campaign in which Wally Hammond made 905 runs in the five Tests, and Larwood led off with 6 for 32 in Australia's opening innings, at Brisbane's Exhibition Ground, in a match won by England by a massive margin, 675 runs. It was Don Bradman's maiden Test, bringing onto the stage the two central characters of the drama four years ahead.",
        " Larwood impressed as a lower-order batsman and as a fieldsman on this first Australian tour of his, and he gained his 18 Test wickets with fast, straight bowling and admirable stamina. Injuries continued to interrupt his progress, but he always fought his way back to fitness, even though illness cost him an appearance in the 1930 Lord's Test against Australia. This was Bradman's season. He gathered, swiftly, 974 runs in his seven Test innings, and Larwood, who took only four wickets in his three Tests that summer, got the 21-year-old champion out only once, for 232 at the Oval- and that was a dubious decision.",
        " England were left in no doubt as to the problem facing them when next they toured Australia. With a triple-century, two double-centuries and an `ordinary' century under his belt in the 1930 Tests, what might the `Boy from Bowral' do on his hard pitches at home?",
        "Thus Bodyline was conceived. England wicketkeeper George Duckworth observed an uncertainty in Bradman's batting at the Oval when rain freshened the pitch and the ball flew. Notts captain Arthur Carr had significant input into the planning of the leg-side attack, and actually had Larwood and Voce staging rehearsals against hapless county opposition. `Cricket's Hiroshima' thus came to pass.",
        "With the acrimonious 1932-33 Test series proving to be his last, Larwood finished with a Test record of 78 wickets, average 28.36, in his 21 appearances, and for a further four years he inflicted misery on the lives of English county batsmen until his body finally gave in to the punishment of the years. He took in all 1427 first-class wickets at only 17.52, and there were three centuries among his 438 innings (average 19.92).",
        null,
        "Initially they stayed in a hotel, with half the bill, as Larwood later discovered, being paid by former Prime Minister Ben Chifley, one of the fast bowler's numerous unexpected admirers. Jack Fingleton later described with amusement how the broad Australian and Nottingham accents rendered conversation between these two humble men mutually unintelligible.",
        " Larwood found employment in a soft-drinks factory, and soon warmed to the egalitarianism of Australian life. He was deeply affected also by the readiness with which he was accepted by old cricket opponents as well as total strangers. Though he never lost his native accent and always spoke nostalgically of England, he knew and repeatedly acknowledged that Australia was the place for him.",
        "Just before leaving England, he had passed the time of day with Don Bradman at the 1948 tour farewell dinner, and a year later there was further balm in the form of honorary membership of MCC. Years later he was even elected to life membership of the SCG, scene of some of his most stirring deeds.",
        "He told his story in detail, in a book prepared by Kevin Perkins, in 1965. He joined studio discussions during nocturnal broadcasts of Ashes Test matches from England. Occasionally he lent his name to newspaper pieces. On the 50th anniversary of the Bodyline Tests he expressed the opinion that Ian Botham was `over-rated': `The way he's been bowling out here, he wouldn't burst a paper bag.' A few months ago he enjoyed a visit from Darren Gough, and telephoned later to congratulate him on his 6 for 49 in the Sydney Test.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}