{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "1",
            "6s": "1",
            "Ave": "32.25",
            "Ct": "1",
            "HS": "67*",
            "Inns": "5",
            "Mat": "3",
            "NO": "1",
            "Runs": "129",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "50",
            "50": "122",
            "6s": "",
            "Ave": "36.17",
            "Ct": "247",
            "HS": "310",
            "Inns": "673",
            "Mat": "368",
            "NO": "37",
            "Runs": "23007",
            "St": "1"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "3",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "51.80",
            "BBI": "4/10",
            "BBM": "",
            "Balls": "3949",
            "Econ": "3.22",
            "Inns": "",
            "Mat": "368",
            "Runs": "2124",
            "SR": "96.3",
            "Wkts": "41"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/1096099/triple-figures--double-quick",
        "http://www.espncricinfo.com/county-cricket-2016/content/story/1036681.html",
        "http://www.espncricinfo.com/ci/content/story/533600.html",
        "http://www.espncricinfo.com/magazine/content/story/431496.html",
        "http://www.espncricinfo.com/magazine/content/story/335067.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=13379"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/102004/055004.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/102004/055004.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/102004/055004.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nOctober 19, 1914, Bicknoller, Somerset "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "March 30, 1978, Dewlands Park, Verwood, Dorset (aged 63 years 162 days) "
        ],
        "Full name": [
            "Harold Gimblett"
        ],
        "Major teams": [
            "England,",
            "Somerset"
        ],
        "Other": [
            "Coach"
        ]
    },
    "profile_info": [
        null,
        null,
        "The start of his career was so sensational that any novelist attributing it to his hero would have discredited the book. Given a months trial on the Somerset staff in 1935 after a number of brilliant performances in local matches, he was told before the period had expired that there was no future for him in county cricket and was sent home. Next day there was a last minute vacancy against Essex at Frome and he was recalled to fill it, mainly as a young man who could chase the ball in the field and perhaps bowl a few overs of mild medium pace. In fact, coming in to face Nicholas, the England fast bowler, then at his best, with six wickets down for 107, he reached his 50 in twenty-eight minutes and his 100 in sixty-three, finally making 123 out of 175 in eighty minutes with three 6s and seventeen 4s. The innings won him the Lawrence Trophy for the fastest 100 of the season. In the next match, against Middlesex at Lord's, though lame and batting with a runner, he made 53 against Jim Smith, Robins, Pebbles and Sims, three of them England bowlers. It was hardly to be expected that he could keep this up and his record at the end of the season was modest, but his second summer dispelled any notion that his early successes had been a fluke, as he scored 1,608 runs with an average of 32.81. People sometimes talk as if after this he was a disappointment. In fact his one set-back, apart from being overlooked by the selectors, was when in 1938, probably listening to the advice of grave critics, he attempted more cautious methods and his average dropped to 27. But can one call disappointing a man who between 1936 and his retirement in 1953 never failed to get his 1,000 runs, who in his career scored over 23,000, more than any other Somerset player, and fifty centuries, the highest 310 against Sussex at Eastbourne in 1948, and whose average for his career was over 36? Moreover after his first season he habitually went in first and yet he hit 265 sixes, surely a record.",
        "Naturally, as time went on, his judgement improved with experience, he grew sounder and in particular became the master of the hook instead of its slave, though he never abandoned it, as did Hammond and Peter May. To the end, he might have said, as Frank Woolley used to, When I am batting, I am the attack. Apart from his hook he was a fine cutter and driver, his off-drives often being played late and going past cover's left-hand, and like nearly all great attacking bats he freely employed the pull-drive, with which he was particularly severe on Mahomed Nissar at Lord's in 1936. Early in his career, on the fallacious grounds that a great games-player must be a great slip, he was put in the slips where he was only a qualified success. Elsewhere, a fine thrower and a good catch, he was far more successful and many will remember the catch at cover with which he dismissed K. H. Weekes in the Lord's Test in 1939.",
        "For twenty years after his retirement he was coach at Millifield."
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}