{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "15.25",
            "Ct": "8",
            "HS": "37*",
            "Inns": "5",
            "Mat": "4",
            "NO": "1",
            "Runs": "61",
            "St": "3"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "11",
            "6s": "",
            "Ave": "13.93",
            "Ct": "903",
            "HS": "94",
            "Inns": "764",
            "Mat": "532",
            "NO": "220",
            "Runs": "7580",
            "St": "303"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "4",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "3",
            "Econ": "10.00",
            "Inns": "",
            "Mat": "532",
            "Runs": "5",
            "SR": "-",
            "Wkts": "0"
        }
    ],
    "latest_articles": [],
    "latest_photos": [],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nNovember 2, 1891, Scarcliffe, Derbyshire "
        ],
        "Died": [
            "February 2, 1976, Derby (aged 84 years 92 days) "
        ],
        "Fielding position": [
            "Wicketkeeper"
        ],
        "Full name": [
            "Harry Elliott"
        ],
        "Major teams": [
            "England,",
            "Derbyshire"
        ],
        "Other": [
            "Umpire"
        ]
    },
    "profile_info": [
        "\nHarry Elliott, who died at Derby on February 4, aged 84, was born at Scarcliffe on November 2, 1891 (not 1895). It was whilst he was with Sir Joseph Laycock, at Wiseton Hall in Nottinghamshire that Sir Archibald White, formerly captain of Yorkshire, recommended him to Derbyshire, and he first played and kept wicket in 1920 against Essex. Immediately he made his place secure, displacing George Beet, but his early promise as a batsman never matured, though he was an excellent man in a crisis. He appeared in 194 consecutive Derbyshire matches up to 1928, when the Test match against West Indies broke the sequence; subsequently he made 232 consecutive appearances up to 1937 when injury intervened. \n",
        "Chosen to tour South Africa with M.C.C. under G. R. Jackson in 1927-28, when the latter had to withdraw and was replaced by R. T. Stanyforth (himself a wicket-keeper), Elliott's chances were greatly reduced, though in the final Test at Durban he allowed only four byes in an aggregate of 401. He also toured India under D. R. Jardine in 1933-34, playing in two Tests, when he caught six and stumped three.",
        " Elliott played in 532 first-class matches, 764 innings, 220 not out, 7,578 runs, 13.93 average; 904 catches, 302 stumpings. His total of 1,206 dismissals had, at that time, been exceeded by only four other'keepers. He holds several Derbyshire wicket-keeping records--most dismissals (a) in a season--90, (b) in a match--10, (c) in an innings--6 (three times); most stumpings in a season--30. He led the side on a number of occasions, the most notable being at Loughborough in 1933 when he made his best score of 94, sharing a stand of 222 with L. F. Townsend to set up a new record for the third wicket, and allowed no byes in the match, which was won by an innings. In 1935 he allowed no byes in 25 completed innings.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}