{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "3",
            "6s": "0",
            "Ave": "20.90",
            "Ct": "30",
            "HS": "66*",
            "Inns": "44",
            "Mat": "40",
            "NO": "12",
            "Runs": "669",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "1",
            "50": "13",
            "6s": "",
            "Ave": "18.07",
            "Ct": "269",
            "HS": "101",
            "Inns": "416",
            "Mat": "378",
            "NO": "106",
            "Runs": "5603",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "2",
            "4w": "9",
            "5w": "5",
            "Ave": "24.37",
            "BBI": "8/43",
            "BBM": "15/104",
            "Balls": "11173",
            "Econ": "1.88",
            "Inns": "73",
            "Mat": "40",
            "Runs": "3510",
            "SR": "77.5",
            "Wkts": "144"
        },
        {
            "": "First-class",
            "10": "54",
            "4w": "",
            "5w": "164",
            "Ave": "14.90",
            "BBI": "10/10",
            "BBM": "",
            "Balls": "84219",
            "Econ": "2.07",
            "Inns": "",
            "Mat": "378",
            "Runs": "29145",
            "SR": "43.0",
            "Wkts": "1956"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/1119605/when-australia-were-spun-dry",
        "http://www.espncricinfo.com/blogs/content/story/1077794.html",
        "http://www.espncricinfo.com/magazine/content/story/1066658.html",
        "http://www.espncricinfo.com/magazine/content/story/754587.html",
        "http://www.espncricinfo.com/magazine/content/story/627878.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=22185"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/76100/76127.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/76100/76127.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/76100/76127.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMay 18, 1905, Headingley, Leeds, Yorkshire "
        ],
        "Bowling style": [
            "Slow left-arm orthodox"
        ],
        "Died": [
            "July 31, 1943, Caserta, Italy (aged 38 years 74 days) "
        ],
        "Full name": [
            "Hedley Verity"
        ],
        "Major teams": [
            "England,",
            "Yorkshire"
        ]
    },
    "profile_info": [
        null,
        "He received his wounds in the Eighth Army's first attack on the German positions at Catania, in Sicily. Eye-witnesses, who were a few yards from Verity when he was hit, have told the story. The objective was a ridge with strong points and pillboxes. Behind a creeping barrage Verity led his company forward 700 yards. When the barrage ceased, they went on another 300 yards and neared the ridge, in darkness. As the men advanced, through corn two feet high, tracer-bullets swept into them. Then they wriggled through the corn, Verity encouraging them with \"Keep going, keep going.\" The moon was at their back, and the enemy used mortar-fire, Very lights and fire-bombs, setting the corn alight. The strongest point appeared to be a farm-house, to the left of the ridge; so Verity sent one platoon round to take the farm-house, while the other gave covering fire. The enemy fire increased, and, as they crept forward, Verity was hit in the chest. \"Keep going,\" he said, \"and get them out of that farm-house.\" When it was decided to withdraw, they last saw Verity lying on the ground, in front of the burning corn, his head supported by his batman. So, in the last grim game, Verity showed, as he was so sure to do, that rare courage which both calculates and inspires.",
        "Judged by any standard, Verity was a great bowler. Merely to watch him was to know that. The balance of the run up, the high ease of the left-handed action, the scrupulous length, the pensive variety, all proclaimed the master. He combined nature with art to a degree not equalled by any other English bowler of our time. He received a handsome legacy of skill and, by an application that verged on scientific research, turned it into a fortune. There have been bowlers who have reached greatness without knowing, or, perhaps, caring to know just how or why; but Verity could analyse his own intentions without losing the joy of surprise and describe their effect without losing the company of a listener. He was the ever-learning professor, justly proud yet utterly humble.",
        "In the matter of plain arithmetic, so often torn from its context to the confusion of judgement, Verity, by taking 1,956 wickets at 14.87 runs each in ten years of first-class cricket, showed by far the best average of his time. In the recorded history of cricket the only bowlers of this class with lower averages are: Alfred Shaw, 2,072 wickets at 11.97 each; Tom Emmett, 1,595 wickets at 13.43 each; George Lohmann, 1,841 wickets at 13.73 each; James Southerton, 1,744 wickets at 14.30 each. It might be argued that during the period 1854 to 1898, covered by the careers of these cricketers, pitches tended to give more help to the bowler than they did during Verity's time. Verity, I know, for one, would not have pressed such a claim in his own favour. He never dwelt on decimals; and, while he enjoyed personal triumph as much as the next man, that which absorbed his deepest interest was the proper issue of a Test match with Australia or of an up-and-down bout with Lancashire; and if, in his country's or county's struggle towards victory, he brought off some recondite plot for the confounding, of Bradman or McCabe or Ernest Tyldesley or Edward Paynter, well, then he was happy beyond computing.",
        "Yet his bowling achievements, pressed into but overflowing the ten years of his career, were so rich and various that they here demand some concentrated notice. ",
        "He played in 40 Test matches, taking 144 wickets at 24.37 runs each. He took 100 wickets in Test cricket in a shorter period than any other English bowler.",
        "He is the only cricketer who has taken 14 wickets in a day in a Test match, this feat being performed against Australia at Lord's in the second Test, 1934. During this match, he took 15 wickets for 104 runs, thus sharing with Wilfred Rhodes, his Yorkshire predecessor, the honour of taking most wickets in an England v. Australia match.",
        "Twice he took all 10 wickets in an innings; in 1931, against Warwickshire at Headingley, Leeds, for 36 runs in 18.4 (6-ball) overs, 6 maidens; in 1932, on the same ground, against Nottinghamshire, for 10 runs in 19.4 (6-ball) overs, 16 maidens - a world record in first-class cricket for the fewest number of runs conceded by a bowler taking all 10 wickets in an innings, and it included the hat-trick.",
        "Against Essex at Leyton, in 1933, he took 17 wickets in one day, a record shared only by C. Blythe and T.W. Goddard.",
        "In each of his nine full English seasons he took at least 150 wickets, and he averaged 185 wickets a season; thrice consecutively (1935-36-37) he took over 200 wickets. His average ranged from 12.42 to 17.63. He headed the first-class English bowling averages in his first season (1930) and in his last (1939), and never came out lower than fifth.",
        "Verity was born at Headingley, but passed his twenty-fifth birthday before he played for Yorkshire, in 1930, the year that W. Rhodes retired. Some of his earlier seasons were spent in playing as an amateur for Rawdon in the Yorkshire Council; for Accrington in the Lancashire League; and for Middleton in the Central League. He was then, as always afterwards when allowed, an all-rounder. As a batsman, his height, reach, concentration and knowledge of what to avoid raised him distinctly from the ruck of mediocrity; but, whereas his bowling included grace, his batting had only style. The former was nature embellished by art; the latter was art improved by invention.",
        "As a bowler, Hedley Verity stands, and will stand, with his illustrious predecessors in the Yorkshire attack: Edmund Peate (1879-1887), Robert Peel (1882-1899), Wilfred Rhodes (1898-1930) - the dates indicate the time of their respective playing careers - but Verity was not a slow left-hander in the accepted sense, and he used to reject comparision with Rhodes so far as method was concerned, saying: \"both of us are left-handed and like taking wickets; let's leave it at that.\"",
        " Verity's mean pace was what is called slow-medium; on fast pitches, often about medium; and he would send down an inswinging yorker of an abrupt virulence not unworthy of George Hirst.",
        "Naturally, on wet or crumbled or sticky pitches, he reduced pace and tossed the leg-spinner higher, but even here his variety of pace and of angle of delivery was remarkable. He was a born schemer; tireless, but never wild, in experiment; as sensitive in observation as a good host, or as an instrumentalist who spots a rival on the beat; the scholar who does not only dream, the inventor who can make it work.",
        "Just how good a bowler was he? In relation to rivals in his own craft but of an earlier day, such a question is useless except to amuse an idle hour or to excite and idle quarrel. We can only say that, in his own short time, he was the best of his kind. In England, day in and day out, he may never have quite touched the greatness of Robert Peel, Colin Blythe or Wilfred Rhodes. In Australia, neither in 1932-33 or 1936-37, did he perplex their batsmen quite as J.C. White perplexed them in 1928-29, but, as a workman-artist, he will take some beating. H.B. Cameron, that fine wicket-keeper-batsman of South Africa, playing against Yorkshire in 1935, hit him for three fours and three sixes in one over; but very rarely did a batsman survive a liberty taken with Verity. He had, besides, a wonderful skill in restoring the \"rabbits\", early and with little inconvenience, to the hutch.",
        "If a touchstone of Verity's greatness be needed, there is D.G. Bradman, the most inexorable scorer of runs that cricket has yet seen, whose Test match average against England stands at 91.42 in 46 innings. I think it was Verity who kept that average under 150. He was one of only three or four bowlers who came to the battle with Bradman on not unequal terms (haud impar congressus!); and Bradman was reported as saying: \"I think I know all about Clarrie (Grimmett), but with Hedley I am never sure. You see, there's no breaking point with him.\"",
        "Verity timed his blows. In the fifth Test match, at Sydney, early in 1933, Australia, 19 runs behind on the first innings, lost Victor Richardson for 0. Woodfull and Bradman added 115; Larwood, injured, had left the field - and that particular Larwood never came back - then Verity deceived Bradman in flight, bowled him for 71 and went on to take five for 33 in 19 overs and win the match. In the earlier Tests, amid the fast bowling and the clamour, not much had been heard of Verity, except as a rescuing batsman. But, when the last pinch came, there he was to relieve the weary line; very Yorkshire.",
        "Verity never allowed the opinion that Bradman was less than a master on damaged pitches, refusing to stress the evidence of his own triumph at Lord's in 1934 (Bradman c and b Verity 36; c Ames b Verity 13) and referring to Bradman's two innings of 59 and 43 in 1938 against Yorkshire at Sheffield. \"It was a pig of a pitch,\" he said, \"and he played me in the middle of the bat right through.\" Maybe Verity's opinion of Bradman was heightened by a natural generosity in its giver, but on this matter I think that Verity had reason to know best.",
        "As an all-round fielder, Verity was no more than sound, but to his own bowling, or at backward point, he sometimes touched brilliance; and there sticks in the memory the catch that he made at Lord's in 1938, when McCabe cut one from Farnes crack from the bat's middle.",
        "As a batsman for Yorkshire, Verity was mostly kept close to the extras. His build and reach suggested power and freedom, but it remained a suggestion; and he was analogous to those burly golfers who prod the tee-shot down the middle to a prim 180 yards. A casual observer might have mistaken Verity for Sutcliffe a little out of form, for he seemed to have caught something of that master's style and gesture, and , like Sutcliffe, he could be clean bowled in a manner that somehow exonerated the batsman from all guilt. He never quite brought off \"the double\", though in 1936 he took 216 wickets and scored 855 runs. But he had the sovereign gift of batting to an occasion. In the 1936-37 visit to Australia, G.O. Allen could find no opening pair to stay together, so he sent in Verity with C.J. Barnett in the fourth Test, at Adelaide, and they put up partnerships of 53 and 45. Not much, perhaps; but the best till then. In all Test matches, his batting average was close on 21; nearly 3 units higher than his average in all first-class cricket.",
        "Verity had the look and carriage of a man likely to do supremely well something that would need time and trouble. His dignity was not assumed; it was the natural reflection of mind and body harmonised and controlled. He was solid, conscientious, disciplined; and something far more. In all that he did, till his most gallant end, he showed the vital fire, and warmed others in its flame. To the spectator in the field he may have seemed, perhaps, a little stiff and aloof; but among a known company he revealed geniality, wit, and an unaffected kindness that will not be forgotten.",
        "There was no \"breaking-point\" with Verity; and his last reported words: \"Keep going,\" were but a text on his short and splendid life.",
        "R. C. Robertson-Glasgow, Wisden Cricketers' Almanack"
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}