{
    "batting_averages": [
        {
            "": "Tests",
            "100": "16",
            "50": "23",
            "6s": "6",
            "Ave": "60.73",
            "Ct": "23",
            "HS": "194",
            "Inns": "84",
            "Mat": "54",
            "NO": "9",
            "Runs": "4555",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "151",
            "50": "230",
            "6s": "",
            "Ave": "52.02",
            "Ct": "474",
            "HS": "313",
            "Inns": "1098",
            "Mat": "754",
            "NO": "124",
            "Runs": "50670",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "54",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "40.21",
            "BBI": "3/15",
            "BBM": "",
            "Balls": "993",
            "Econ": "3.40",
            "Inns": "",
            "Mat": "754",
            "Runs": "563",
            "SR": "70.9",
            "Wkts": "14"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/1129981.html",
        "http://www.espncricinfo.com/greatestteams/content/story/545226.html",
        "http://www.espncricinfo.com/magazine/content/story/530052.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/431936.html",
        "http://www.espncricinfo.com/magazine/content/story/363876.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=20413"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/12900/12908.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/12900/12908.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/12900/12908.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nNovember 24, 1894, Summerbridge, Harrogate, Yorkshire "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "January 22, 1978, Cross Hills, Yorkshire (aged 83 years 59 days) "
        ],
        "Full name": [
            "Herbert Sutcliffe"
        ],
        "Major teams": [
            "England,",
            "Maharaj Kumar of Vizianagram's XI,",
            "Yorkshire"
        ]
    },
    "profile_info": [
        null,
        "In a career extending from 1919 to 1939 Herbert Sutcliffe scored more than 50,000 runs and averaged 52. He never knew a season of failure, except by the standard of his own astonishing peaks, and at the zenith of his career he scored 16,255 runs in five years as a measure of mastery in all conditions and over the world's best bowling of the time.",
        "The First World War delayed his entry into county cricket until he was 24 years old when, after demobilisation from a commission in the Green Howards, he was given a place in the Yorkshire side. His quality was never in doubt and by the end of the 1919 season he had scored five centuries in an aggregate of 1,839 runs. He had also established a first-wicket partnership with Percy Holmes. For fourteen years these two batsmen opened the innings for Yorkshire, representing a partnership of unparalleled success in which they put up the hundred on 74 occasions. Equally happy was Sutcliffe's Test match association with J. B. Hobbs, for this became the most accomplished of all opening partnerships. Sutcliffe's good fortune, however, was only in the presentation of opportunity. Seizure of it was his own merit and with one partner or another he constructed 145 first-wicket century stands.",
        "His artistry and efficiency in difficult conditions became legendary in his lifetime, with his centuries against Australia at The Oval in 1926 and at  Melbourne in 1929 as historic examples. Matches against  Lancashire stirred him to nine centuries. His defensive patience and skill became a byword, yet at need his hitting was brilliant in the extreme. Against Northamptonshire at Kettering he met spin on the sticky wicket with an innings of 113 which included ten 6s. At Scarborough against the fast bowling of Farnes and Nichols, Sutcliffe took his personal score from 100 to 194 in forty minutes. His 100th first-class century was the 132 he hit in less than two hours at Bradford when Yorkshire were hurrying to defeat  Gloucestershire.",
        "Courage and concentration were his basic attributes. No prospect daunted him, no difficulty dismayed him, no crisis upset him. He was an artist of the dead bat and an uncompromising hooker of fast bowling. He sought solution to his batting problems by taking them as they came, one at a time. He never allowed the present to be influenced by the alarms of the past or fears for the future. In the means and manner of his performances he raised enormous prestige for himself throughout the cricketing world. He was admired and respected wherever he played and by his refusal to depreciate his own value he raised the status of his profession.",
        "He took the supplementary rewards of his distinction with polished grace and unfailing consideration for colleagues. Herbert Sutcliffe the individual always made it clear that he was  Herbert Sutcliffe inseparable from Yorkshire and England. He was as punctilious in acknowledgment of obligations as he was single-minded towards the immediate task in hand.",
        "After the retirement of A. W. Lupton in 1927,  Sutcliffe was offered the Yorkshire captaincy as a professional player. Although he was on tour in South Africa when the invitation came he appreciated the possibility of divided opinions and with characteristic diplomacy declined the appointment, giving an insurance of his willingness to play under any captain.",
        "During his playing days he founded and developed a sports outfitting business, now directed by his elder son. After his retirement from the field he took a managerial appointment in the paper trade. He showed himself as successful in commerce as in cricket and for the same reasons of application and reliability. His repayment to the game which had given him so much was service on the Yorkshire committee, as an England selector, and as sponsor for many good causes in cricket.",
        "Though he was born in Summerbridge, Sutcliffe was a Pudsey native in cricket association. There, as a schoolboy, he began league cricket and from there he advanced to the county, but neither Pudsey nor any other nursery could have claimed Herbert Sutcliffe as a typical product. He was a Yorkshireman in his loyalty and training, but he was cosmopolitan in approach and outlook. His manner fitted Lord's as expressively as it fitted Leeds.",
        "Immaculate, alert, brisk of movement, serene in repose, he carried his character with a clear label wherever he appeared. His off-drive wore a silk hat and his hook was a ready response to the aggressive intent of any bumper. His defensive play was the reduction of risk to the minimum and his self-confidence was unshakeable.",
        "In his first-class career he scored 149 centuries. He shared with Holmes a partnership of 555 for Yorkshire, and with Hobbs a partnership of 283 for England against  Australia.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}