{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "7.00",
            "Ct": "3",
            "HS": "5",
            "Inns": "2",
            "Mat": "1",
            "NO": "1",
            "Runs": "7",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "2",
            "6s": "",
            "Ave": "12.25",
            "Ct": "283",
            "HS": "76",
            "Inns": "264",
            "Mat": "175",
            "NO": "58",
            "Runs": "2524",
            "St": "195"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "1",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "3",
            "Econ": "12.00",
            "Inns": "",
            "Mat": "175",
            "Runs": "6",
            "SR": "-",
            "Wkts": "0"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wcm/content/story/245985.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/66600/66685.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/66600/66685.icon.jpg"
    ],
    "personal_info": {
        "Also known as": [
            "Hopper"
        ],
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJanuary 25, 1908, Goudhurst, Kent "
        ],
        "Died": [
            "December 1, 1995, Hastings, Sussex (aged 87 years 310 days) "
        ],
        "Education": [
            "Brighton College"
        ],
        "Fielding position": [
            "Wicketkeeper"
        ],
        "Full name": [
            "William Howard Vincent Levett"
        ],
        "Major teams": [
            "England,",
            "Kent"
        ]
    },
    "profile_info": [
        null,
        "Born on Jan 5, 1908, William Howard Vincent Levett was educated at Brighton College, and was chosen for the Public Schools XV which played against the 1926 Australians at Lord's. He caught Johnny Taylor and was himself bowled by Jack Ryder for 3.",
        "His reputation grew in club cricket, where his alacrity behind the stumps was matched by his bravery; he stood up to all but the speediest bowlers, even on dubious surfaces. Always an amateur, he came into the Kent side for two matches in 1930, excelling in the match against Lancashire at Dover by holding three catches and effecting five stumpings. In 1933 he helped dismiss nine Notts batsmen in a match at Maidstone, and repeated the feat at Northampton in 1934 and against Sussex at Tunbridge Wells in 1935. Twice he made six dismissals in an innings (Northampton 1934 and Neath 1939). It was a reflection of the era in which he played, and the deceptive skills of tiny legspinner `Tich' Freeman in particular, that Levett's 478 first-class dismissals (175 matches) included 195 stumpings. Handy with the bat, he sometimes opened, but averaged only 12, with a highest score of 76.",
        "His willingness to dive for catches had that arch snaffler of slip catches, Frank Woolley, grumbling at the talent bonuses that Levett was costing him, and this ability coupled with his reputation for drinking merrily after hours spawned one of the most hackneyed of after-dinner stories: Levett, bleary-eyed, narrowly escaping decapitation, as the first ball of the day roared past for four byes, to be followed by an amazing full-length dive to hold a fast leg-side edge from the second, the beaming keeper announcing that he too thought it wasn't bad effort, considering it was the first ball of the day. His sense of fun stretched to bowling a bread roll to Ted White when the Australians went in to score seven runs to beat Kent in 1938.",
        "Equally enthusiastic in club matches, Kent 2nd XI games, or Gentlemen v Players (four times at Lord's, four elsewhere), Howard Levett was a kindly and genial colleague and captain, whose guidance and influence Godfrey Evans, for one, found to be priceless in his formative years.",
        "Having served in the Royal West Kent Regiment during the Second World War, Levett played on occasionally for a couple of seasons for Kent, and began farming on the other side of the Sussex border. But his service to Kent CCC was lifelong, for he was a valued committee member, president in 1974, and became president of the supporter's club. Such was his affection for that `other clan', the professional cricketers, that he established the Hoppers Tie Club, with its barrels and hops on a blue background. The pros had not been allowed to wear Kent's official tie, with its white horses on red ground.",
        null,
        null,
        "When I joined the county staff in 1937 and began to learn my trade as a wicketkeeper, I had tremendous support from Hopper who encouraged me to stand up to the medium-pacers, saying `You are nothing but a long stop with gloves on standing back to those'. In those days when Leslie Ames was 'keeping for England Hopper would be 'keeping for the county. Otherwise he would be helping me in the Minor County matches. He would say: `Now, Godfrey, I'll 'keep in the first innings and you field at slip. Watch how I take the ball and position myself, and in the second innings I'll field at first slip and you 'keep.' This was invaluable to me, hence I say that without Hopper I would never have gained the standard and the technique I was lucky enough to attain.",
        "In another story accredited to him, after a hectic night out on hop wine, he took his stance behind the stumps and did not move as the first ball went for four byes. Still in the same position, the next ball was glanced by the batsman. Hop dived over and caught an absolute blinder, then came up to the captain saying, `That wasn't bad for the first ball of the day, was it?'",
        "The thing I took to heart, which helped me most from Hop, was his insistence in\nbeing up to the wicket. He would say, when standing back you can only catch the batsman out, but if you are up you can catch, stump, run them out, but mostly it is the psychological advantage you have in being there. The batsman is frightened to play right forward in case of overbalancing, and many a wicket will be taken that is not credited to the 'keeper, whereas in fact by standing up you have made it possible.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}