{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "10.88",
            "Ct": "5",
            "HS": "26",
            "Inns": "17",
            "Mat": "13",
            "NO": "8",
            "Runs": "98",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "2",
            "6s": "",
            "Ave": "9.66",
            "Ct": "172",
            "HS": "58",
            "Inns": "330",
            "Mat": "251",
            "NO": "101",
            "Runs": "2213",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "4",
            "5w": "3",
            "Ave": "30.91",
            "BBI": "6/63",
            "BBM": "9/227",
            "Balls": "2882",
            "Econ": "2.89",
            "Inns": "20",
            "Mat": "13",
            "Runs": "1391",
            "SR": "64.0",
            "Wkts": "45"
        },
        {
            "": "First-class",
            "10": "15",
            "4w": "",
            "5w": "62",
            "Ave": "21.38",
            "BBI": "8/24",
            "BBM": "",
            "Balls": "42937",
            "Econ": "2.75",
            "Inns": "",
            "Mat": "251",
            "Runs": "19738",
            "SR": "46.5",
            "Wkts": "923"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/963517/dazzling-light--murky-shadow",
        "http://www.espncricinfo.com/magazine/content/story/333331.html",
        "http://www.espncricinfo.com/magazine/content/story/258594.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155433.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154688.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/80400/80412.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/80400/80412.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/80400/80412.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJanuary 20, 1908, Aberdeen, Scotland "
        ],
        "Bowling style": [
            "Legbreak googly"
        ],
        "Died": [
            "February 28, 1980, Speen, Buckinghamshire (aged 72 years 39 days) "
        ],
        "Full name": [
            "Ian Alexander Ross Peebles"
        ],
        "Major teams": [
            "England,",
            "Scotland,",
            "Middlesex,",
            "Oxford University"
        ]
    },
    "profile_info": [
        "\nIan Peebles was for a short time one of the most formidable bowlers in the world and one of the few who could make Bradman look fallible. A tall man with a beautifully easy run-up and a high action, which gave him a particularly awkward flight, he bowled leg-breaks and googlies, and in an age of fine leg-spinners he was, for a while, the equal of any. \n",
        "The start of his career was unusual. Coming south from Scotland in the hope of getting a chance in the cricket world, he was engaged as Secretary at the Aubrey Faulkner School of Cricket and so impressed Faulkner himself (to whose coaching he always acknowledged a great debt) and also Sir Pelham Warner that, when difficulty was found in raising a good enough Gentlemen's side against the Players at the Oval in 1927, he was given a place. On this occasion he bowled Sandham, but that was his only wicket; nor was he more successful later in the season at the Folkestone and Scarborough Festivals. However that winter he was sent with the MCC side to South Africa: ostensibly he went as secretary to the captain, but he bowled well enough to secure a place in the first four Tests and, without doing anything spectacular, made it clear that his possibilities had not been overestimated. In 1928 he played a few matches for Middlesex, but it was in 1929 that he really came to the fore, taking 120 wickets at just under 20 runs each and being one of three amateurs to take 100 wickets for the country that season - a unique performance. In 1930 he was up at Oxford, for whom he took 70 wickets, thirteen of them against Cambridge; then, after taking six wickets (including Hobbs, Sutcliffe and Leyland) for 105 for the Gentlemen v the Players, he was picked for the forth Test at Old Trafford. Here, as soon as Peebles came on, Woodfull, who was well set, became acutely uncomfortable, on one occasion leaving a ball which just went over his middle stump; Bradman, coming in, was all but bowled first ball by Peebles, who then had him dropped in the slips and finally caught at slip for 14. The first three balls Kippax received from Peebles produced three confident but unsuccessful appeals for l. b. w.. For such bowling three for 150 was a wholly inadequate reward. In the final Test at the Oval six for 204 may not look much, but in an Australian total of 695 it was better than anyone else. That winter Peebles went again with MCC to South Africa and both there and against New Zealand in the following summer he was one of the most effective bowlers. Already, though, the amount of bowling he had had to do in matches, followed by countless hours in the nets in winter, was affecting him: his leg-break was losing its venom, he was becoming increasingly dependent upon his googly, and his great days were passing, though he was picked for the last Test in 1934, an invitation which he had to refuse owing to injury. When, after several seasons of intermittent appearances, he returned to regular county cricket in 1939 to captain Middlesex, Peebles was really no more than a change bowler, and though he played occasionally until 1948, the loss of an eye in a war-time air-raid had, to all intents and purposes, ended his serious cricket career.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}