{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "3",
            "6s": "0",
            "Ave": "20.89",
            "Ct": "31",
            "HS": "60",
            "Inns": "31",
            "Mat": "18",
            "NO": "2",
            "Runs": "606",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "27",
            "50": "108",
            "6s": "",
            "Ave": "36.81",
            "Ct": "419",
            "HS": "192",
            "Inns": "554",
            "Mat": "365",
            "NO": "66",
            "Runs": "17968",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "118.00",
            "BBI": "1/38",
            "BBM": "1/43",
            "Balls": "572",
            "Econ": "3.71",
            "Inns": "11",
            "Mat": "18",
            "Runs": "354",
            "SR": "190.6",
            "Wkts": "3"
        },
        {
            "": "First-class",
            "10": "1",
            "4w": "",
            "5w": "11",
            "Ave": "30.27",
            "BBI": "6/21",
            "BBM": "",
            "Balls": "22718",
            "Econ": "2.71",
            "Inns": "",
            "Mat": "365",
            "Runs": "10262",
            "SR": "67.0",
            "Wkts": "339"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/489242.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/68700/68754.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/68700/68754.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nMarch 7, 1918, Bignall End, Staffordshire "
        ],
        "Bowling style": [
            "Legbreak googly"
        ],
        "Died": [
            "September 15, 1984, Bignall End, Staffordshire (aged 66 years 192 days) "
        ],
        "Full name": [
            "John Thomas Ikin"
        ],
        "Major teams": [
            "England,",
            "Lancashire"
        ],
        "Other": [
            "Coach"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nJack Ikin  played in eighteen Test for England between 1946 and 1955, scoring 606 runs with an average of 20.89 and taking three wickets at 118 runs each. These figures naturally suggest the question, why was he picked so often and so long? The answer is that, though at the time England had such bats as Hutton, Washbrook, Compton and Edrich and, at the end of the period, May and Cowdrey, there was not the depth of batting there had been before the war: two or three reliable players ere wanted to support the stars and crises were frequent. One gets the impression that the selectors, at a loss to fill the gap, constantly fell back on Ikin. \n",
        "He was essentially a sound player, though in his young days stronger on the off than on the leg. He was determined and could be trusted not to throw his wicket away stupidly. He was left-handed, he was adaptable and equally happy to open or to go in six or seven. Above all he was a superb field, whether at short leg or in the slips. Though he never made a big score for England, he often played bravely when runs were wanted. At Sydney in 1946-47 his 60, made in three hours, was the second-highest innings in a total of 255, while at Melbourne in a desperate situation he made 48 and helped Yardley to put on 113 in two hours. In 1951 against South Africa at Trent Bridge his 33 was top score in the second innings, at Lord's he made 51 and at Old Trafford, where he faced bravely a fierce battering form McCarthy, his 22 and 38, made as Hutton's opening partner, were important contributions in a low-scoring match. In 1952 he made 53 against India at The Oval. In 1955, after a three-year absence, he was recalled as one of five left-handers to counter Goddard's leg-theory, but the experiment was not a success.",
        "Born at Stoke-on-Trent, he played for Staffordshire in 1934 at the age of sixteen gained a regular place in the side in 1936 and in 1938, when he headed the batting, was picked for the Minor Counties against Oxford University. In 1939 he appeared in four matches for Lancashire and took his first wicket in first-class cricket, that of the great George Headley. Playing regularly for Lancashire in 1946, he was picked for England before he had got his county cap and that winter went with MCC to Australia, where he played in all the Tests. In 1947-48 he was a member of G. O. Allen's side to the West Indies, but was a failure. His only other tour was with a Commonwealth team to India in 1950-51. Here he had the most prolific season of his career, heading the averages in the unofficial Tests with 625 runs and average of 89.28. An injury forced him to refuse the MCC tour to India the following winter. For Lancashire he did splendid work as a batsman and was also useful as a leg-break and googly bowler. Against Somerset at Taunton in 1949 he did the hat-trick. His highest score was 192 against Oxford University at Oxford in 1951. Latterly he missed a good deal of cricket through ill health and injury and it was this that caused him to retire at the end of 1957.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}