{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "1",
            "50": "0",
            "6s": "0",
            "Ave": "8.00",
            "Ct": "0",
            "HS": "6*",
            "Inns": "2",
            "Mat": "1",
            "NO": "1",
            "Runs": "8",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "4s": "",
            "50": "6",
            "6s": "",
            "Ave": "11.90",
            "Ct": "257",
            "HS": "92*",
            "Inns": "473",
            "Mat": "386",
            "NO": "144",
            "Runs": "3918",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "1",
            "5w": "0",
            "Ave": "27.20",
            "BBI": "4/102",
            "BBM": "5/136",
            "Balls": "202",
            "Econ": "4.03",
            "Inns": "2",
            "Mat": "1",
            "Runs": "136",
            "SR": "40.4",
            "Wkts": "5"
        },
        {
            "": "First-class",
            "10": "11",
            "4w": "",
            "5w": "72",
            "Ave": "22.03",
            "BBI": "8/27",
            "BBM": "",
            "Balls": "72124",
            "Econ": "2.43",
            "Inns": "",
            "Mat": "386",
            "Runs": "29279",
            "SR": "54.2",
            "Wkts": "1329"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/128779.html",
        "http://www.espncricinfo.com/cricketer/content/story/139393.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/53500/53534.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/53500/53534.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/53500/53534.icon.jpg"
    ],
    "personal_info": {
        "Also known as": [
            "Long Jack"
        ],
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJuly 11, 1893, Clophill, Bedfordshire "
        ],
        "Died": [
            "April 8, 1965, Norwood Green, Southall, Middlesex (aged 71 years 271 days) "
        ],
        "Full name": [
            "Frederick John Durston"
        ],
        "Major teams": [
            "England,",
            "Middlesex"
        ],
        "Other": [
            "Coach"
        ]
    },
    "profile_info": [
        "\nFrederick John Durston, the former Middlesex and England fast bowler, died in hospital at Southall on April 8, aged 71. Born on July 11, 1893, at Clophill, Bedfordshirewith whose village club he learned the game-he went to Lord's as a groundboy in 1914. After serving with the Royal Engineers, he returned to Lord's in 1919 and, on the recommendation of E. G. Wynyard, the old Hampshire cricketer, made his debut for Middlesex in four matches. In his first full season-1920-he played a material part in helping Middlesex win the championship, taking 113 wickets in all matches, the first of six occasions on which he was to take 100 wickets in a season. In three other years he took over ninety. \n",
        "Standing well over six feet and magnificently built, he was a right-arm opening bowler - perhaps fast-medium rather than fast-with fine powers of endurance and consistent accuracy of length. He achieved his highest aggregate (136 wickets) in 1921, when Middlesex again won the championship and when he played for England against Australia at Lord's-his only Test: his five wickets in the match included C. G. Macartney in each innings and Warwick Armstrong for a duck. Shortly afterwards he took eight wickets for the Players against the Gentlemen at Lord's, but though he represented the Players on six other occasions he never again appeared in the Lord's fixture. He performed hattricks against both Universities-at Fenner's in 1922 and in the Parks the following year.\nSome success\nHe toured Jamaica with Mr Julien Cahn's side early in 1929, and when his first-class career was over he visited the Argentine with Sir Theodore Brinckman's team in 1937-38. He retired from first-class cricket in 1933, having changed with some success to slow off-spin bowling in his last two years. Altogether in first-class matches he took 1,329 wickets for 29,279 runs (av. 22.03). In addition he was a powerful right-hand hitter, scoring nearly 4,000 runs, his highest innings being 92 not out against Northamptonshire at Lord's in 1930. At Leyton in 1927 he assisted Hendren establish the present Middlesex ninth-wicket record-an unbroken 160, scored in only 80 minutes.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}