{
    "batting_averages": [
        {
            "": "Tests",
            "100": "2",
            "50": "6",
            "6s": "1",
            "Ave": "46.36",
            "Ct": "6",
            "HS": "133",
            "Inns": "21",
            "Mat": "11",
            "NO": "2",
            "Runs": "881",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "67",
            "50": "161",
            "6s": "",
            "Ave": "37.50",
            "Ct": "352",
            "HS": "331*",
            "Inns": "897",
            "Mat": "509",
            "NO": "46",
            "Runs": "31914",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "29.00",
            "BBI": "2/17",
            "BBM": "2/17",
            "Balls": "138",
            "Econ": "2.52",
            "Inns": "5",
            "Mat": "11",
            "Runs": "58",
            "SR": "69.0",
            "Wkts": "2"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "34.73",
            "BBI": "4/37",
            "BBM": "",
            "Balls": "5685",
            "Econ": "2.67",
            "Inns": "",
            "Mat": "509",
            "Runs": "2536",
            "SR": "77.8",
            "Wkts": "73"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/925349.html",
        "http://www.espncricinfo.com/magazine/content/story/246297.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154166.html",
        "http://www.espncricinfo.com/wcm/content/story/245985.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154635.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/042004/051385.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042004/051385.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042004/051385.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nFebruary 22, 1917, Chiswick, Middlesex "
        ],
        "Bowling style": [
            "Right-arm offbreak"
        ],
        "Died": [
            "October 12, 1996, Bury St Edmunds, Suffolk (aged 79 years 233 days) "
        ],
        "Full name": [
            "John David Benbow Robertson"
        ],
        "Major teams": [
            "England,",
            "Middlesex"
        ],
        "Other": [
            "Coach"
        ]
    },
    "profile_info": [
        "\nPolished and stylish, wristy and effortless: these were the words used time and again to describe innings played by Jack Robertson during his seasons with Middlesex. And at Test level, no more elegant pair than Len Hutton and Robertson ever opened England's batting. Unfortunately for the Southerner, and for impartial spectators, Hutton and Robertson opened together in only three Tests - two in West Indies in 1947-48, and at Lord's in 1949- because Lancashire's Washbrook was invariably seen as slightly superior against fast bowling. \n",
        "This led to the absurdity of Robertson's omission after scoring 121 against New Zealand in that Lord's Test (143 with Hutton for the first wicket), because the injured Washbrook recovered in time for the next Test. So Robertson had the rare distinction of a century in his final home Test: to which he added two half-centuries at Madras in his last England appearance, on the 1951-52 tour of India.",
        " John David Benbow Robertson was born in Chiswick on Feb 22, 1917. His father was a regular player with Turnham Green. At 15 Jack played for Middlesex 2nds, and came under the watchful eyes of Plum Warner and coach Jack Durston. His first-class debut in 1937 saw him stumped for a duck at Oxford. Capped in 1939, when he was 22, Robertson then found himself one of cricket's lost generation as world war cut away six summers. A driver in the RASC during the Dunkirk evacuation, he ended the war as a captain in the Duke of Wellington's Regiment, and a battle-school instructor. He was also responsible for a famous act of patriotic defiance during a Services match of Lord's in 1944. A flying-bomb just missed Lord's and exploded near the church. The players, having thrown themselves to the turf, then resumed play, and Robertson hooked Bob Wyatt's first ball into the Grandstand.",
        "His career with Middlesex ( 1937-59) was exemplary. Fourteen times he reached 1000 runs in a season, going on past 2000 in nine of them. He came within 83 runs of 3000 in 1951, but was at his peak in the late 1940s. The golden 1947 season may well be branded with the names of Compton and Edrich, who both passed 2000 for Middlesex, but Jack Robertson (2214 runs at 65.12, with 11 centuries) and his opening partner Syd Brown (1709) were also key agents in the winning of the Championship. They followed their first-wicket stand of 310 against Notts with 222 against Yorkshire, both at Lord's. The former was a record until Eric Russell and Pasty Harris bettered it against the 1967 Pakistanis.",
        null,
        "In the preceding winter he had headed England's Test averages in the Caribbean with 390 at 55.71, his First Test century coming in Trinidad, where England were in danger on the matting surface. Robertson's 133 spanned 5¾ hours (15 fours) and saved the match, though the debut centuries from S. C. Griffith and Andy Ganteaume remain better-remembered.",
        "This was Robertson's destiny. Self-effacing, abstemious, a pillar of decency and integrity, he so often allowed others the spotlight of glory. Even when, in 1949, he scored 331 not out, still the Middlesex record and the highest score made in Worcester's wondrous setting, he made much of the fact that his pleasure was dulled when he found his car-tyres deflated that evening, the story told with an amused air.",
        "His 11 Tests brought him 881 runs at 46.37, figures which point to fickle selection, and in all first-class cricket his 31,914 runs (37.50) contained 67 centuries. He took 73 wickets (34.74) with offspin, and held 350 catches. From 1958 to 1968 he was Middlesex coach.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}