{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "2",
            "Ave": "9.00",
            "Ct": "4",
            "HS": "40",
            "Inns": "18",
            "Mat": "12",
            "NO": "4",
            "Runs": "126",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "8",
            "6s": "",
            "Ave": "11.98",
            "Ct": "425",
            "HS": "71",
            "Inns": "919",
            "Mat": "639",
            "NO": "318",
            "Runs": "7205",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "1",
            "4w": "4",
            "5w": "4",
            "Ave": "22.08",
            "BBI": "6/41",
            "BBM": "10/60",
            "Balls": "2976",
            "Econ": "2.18",
            "Inns": "20",
            "Mat": "12",
            "Runs": "1082",
            "SR": "60.7",
            "Wkts": "49"
        },
        {
            "": "First-class",
            "10": "66",
            "4w": "",
            "5w": "255",
            "Ave": "17.75",
            "BBI": "9/32",
            "BBM": "",
            "Balls": "144470",
            "Econ": "2.25",
            "Inns": "",
            "Mat": "639",
            "Runs": "54351",
            "SR": "47.1",
            "Wkts": "3061"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/1096855.html",
        "http://www.espncricinfo.com/magazine/content/story/710639.html",
        "http://www.espncricinfo.com/magazine/content/story/265946.html",
        "http://www.espncricinfo.com/ci/content/story/130047.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155688.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=14133"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/102004/055277.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/102004/055277.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/102004/055277.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMay 3, 1867, Chalfont St Giles, Buckinghamshire "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "April 17, 1944, Chalfont St Giles, Buckinghamshire (aged 76 years 350 days) "
        ],
        "Full name": [
            "John Thomas Hearne"
        ],
        "Major teams": [
            "England,",
            "Middlesex"
        ],
        "Other": [
            "Coach"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        null,
        "Right-hand medium-pace, he took a fairly long run up to the wicket, and it would be difficult to recall a bowler with a more beautiful delivery, made as his left hand pointed down the pitch. Standing nearly five feet eleven inches, he brought the ball over with a perfectly straight arm, and such was his command of length that a batsman might wait many overs for a ball from which he was certain to score. Even on the best of wickets he got on quite an appreciable off-break and, varying his pace cleverly, he used at times to send down a fast ball which swung with his arm. On a bowler's wicket he could dismiss the strongest sides, and on one of the crumbling pitches which occasionally bothered batsmen forty years ago he was simply unplayable. The leading bowler, not only for Middlesex but for the M.C.C. in the days when the club programme included quite a number of first-class matches, he was called upon for an amount of work which would have tired out most men in a very few years, but his splendid methods served him so well that a career in first-class cricket, which opened in 1888, did not close until the 1914 war, and in 1923 at Edinburgh he took six wickets for 64 for Middlesex against Scotland.",
        " Jack Hearne came of famous cricket stock. A nephew of old Tom Hearne and of George Hearne, both of whom played for Bucks and Middlesex, before the latter went to Catford Bridge, he was a cousin of G. G. Hearne, Frank Hearne and Alec Hearne, all distinguished professionals for Kent. His brother, Walter Hearne, also a good Kent bowler, broke down through knee trouble when he looked to have many years of success before him and then became scorer, as did Alec Hearne when his cousin died.",
        "J. T. used to relate how chance helped him into first-class cricket. I was born and bred in Buckinghamshire, which, in my young days, did not have a county club or I might have got no further than that, but A. J. Webbe, having watched him on the Evelyn School ground, where Hearne coached, asked him to play in a Middlesex Colts match, and then against the Australians in 1888. He took two cheap wickets, but a further invitation for the next match against Surrey could not be accepted, one of the masters advising him that he was not qualified. By living with his brother in London this difficulty was overcome, but he still worked at Evelyn School during the summer, and in June 1890 he received a telegram asking him to play for Middlesex that very day.",
        " I turned over my pitch-mowing job to someone else, dashed to the station, and from a newspaper found that Middlesex were playing Notts. When I arrived at Lord's just before lunch-time I saw 99 for no wicket on the score-board. Not until reaching the dressing-room did I learn that my side were batting. If Notts had been at the wickets I should not have played in that match. I remember Mr. Webbe leaning out of the pavilion window as I passed down the little alley to the players' room and saying, `It is quite all right but I nearly left you out.'",
        " When Notts batted near the end of the day I bowled J. A. Dixon with a real beauty, and as we left the field the great Arthur Shrewsbury said to me, `Well bowled, young'un. If you bowl like that you will get someone else out to-morrow'--and I did--six for 62. That is how I began my connection with Middlesex and, barring a couple of matches missed through a strained arm, I went on playing for the county without a break until I retired from county cricket in 1914.",
        "Next season at Lord's he took 14 Yorkshire wickets for less than five runs apiece, and in 14 matches the capture of 118 wickets for ten runs each put him top of the first-class averages. From that proof of ability he went steadily ahead, and in 1893 the fine reward of 212 wickets fell to him, while his aggregate rose to 257 wickets at 14.72 each in 1896; only Tom Richardson with 246 at 16.79 each fared nearly as well. In fact, that was Hearne's greatest year. He appeared for the Players against the Gentlemen at the Oval and Lord's, but those matches were comparatively of small importance in view of his doings against the Australians. With 56 wickets at 13.17 runs apiece he far surpassed the work of any other bowler during the summer against the touring team, though his rivals for fame included Robert Peel, George Lohmann, John Briggs, Tom Richardson and A. D. Pougher. He finished at Hastings for South of England by taking six Australian wickets for eight runs in 17 overs, 13 of them maidens. He also made 29 not out, the next highest score of his side to 53 by W. G. Grace. In the three Test matches that season he took 15 wickets at 14.1 each, dividing the honours with Tom Richardson, whose 24 wickets cost 18.7 each. At Lord's his bowling was not required until the second innings, when he sent down 36 overs for 76 runs and five wickets; but at the Oval, where Australia scored only 119 and 44, he took six wickets for 41 and four for 19--ten in all for six runs apiece, so having a large share in winning the rubber match by 66 runs.",
        "An even more memorable game that season was at Lord's in June when M.C.C. avenged the disaster of 1878 by dismissing the Australians for 18, one less than the club fell for eighteen years previously. On that occasion Spofforth and Boyle brought undying fame to our visitors--in fact, made a name for Australian cricket in England. The revenge performance earned most renown for A. D. Pougher, who, going on to bowl with three wickets down for 18, disposed of five batsmen without a run being scored off him and the innings ended without addition. Yet Hearne took a greater part than did the Leicestershire bowler in gaining a single innings victory for M.C.C. In the first innings he sent down eleven overs for four runs and four wickets, and in the second, when the Australians put together a total of 183, he took, at a cost of 73 runs, all nine wickets that fell--the visitors batted one man short, Giffen being ill.",
        "In the winter of 1897 he went to Australia with A. E. Stoddart, and his nine wickets for 141 in the first Test at Sydney helped materially in England's only win in the rubber of five matches, which all told yielded him no more than twenty victims. He took part in three Test matches in 1899--the first experience of a rubber of five in England--and at Leeds set up a record that still stands by doing the only hat-trick against Australia in a Test match in England. His victims were those formidable opponents Clem Hill, Sidney Gregory and M. A. Noble. He did three other hat-tricks; and another big achievement when meeting Australians occurred nine years earlier for Middlesex at Lord's, where he bowled W. L. Murdoch, the Australian captain and great batsman, for nought in each innings.",
        "Besides coaching during several winters in India for the Maharaja of Patiala, Jack Hearne went to South Africa in 1891-92 and, with the two left-handers, J. J. Ferris and Nutty Martin, as colleagues, he claimed 163 wickets for less than seven runs each. South African batting was very weak at that time, and Ferris, the Australian, then qualified for Gloucestershire, with 235 wickets at 5.91 each, eclipsed Hearne's performance.",
        null,
        "From 1891 to 1924 Hearne was engaged at Lord's, and the M.C.C. voted him, in lieu of a benefit, the sum of £500. Middlesex gave him the match with Somerset in 1900 as a benefit, and in 1920 he was elected a member of the Committee of the Middlesex County Club, an honour for a professional previously awarded only to William Gunn by Notttinghamshire in 1906. When acting as coach during many seasons at Oxford, Jack Hearne endeared himself to the University undergraduates in the same way that all who met him were impressed by the modest kindliness that marked his whole life.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}