{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "4",
            "50": "0",
            "6s": "0",
            "Ave": "7.75",
            "Ct": "0",
            "HS": "14",
            "Inns": "6",
            "Mat": "4",
            "NO": "2",
            "Runs": "31",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "4s": "",
            "50": "1",
            "6s": "",
            "Ave": "6.53",
            "Ct": "128",
            "HS": "54",
            "Inns": "453",
            "Mat": "401",
            "NO": "142",
            "Runs": "2032",
            "St": "0"
        },
        {
            "": "List A",
            "100": "0",
            "4s": "",
            "50": "0",
            "6s": "",
            "Ave": "3.60",
            "Ct": "3",
            "HS": "9",
            "Inns": "8",
            "Mat": "11",
            "NO": "3",
            "Runs": "18",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "52.42",
            "BBI": "2/65",
            "BBM": "3/126",
            "Balls": "792",
            "Econ": "2.78",
            "Inns": "6",
            "Mat": "4",
            "Runs": "367",
            "SR": "113.1",
            "Wkts": "7"
        },
        {
            "": "First-class",
            "10": "15",
            "4w": "",
            "5w": "86",
            "Ave": "21.48",
            "BBI": "9/30",
            "BBM": "",
            "Balls": "72700",
            "Econ": "2.71",
            "Inns": "",
            "Mat": "401",
            "Runs": "32847",
            "SR": "47.5",
            "Wkts": "1529"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "1",
            "5w": "3",
            "Ave": "9.75",
            "BBI": "6/14",
            "BBM": "6/14",
            "Balls": "782",
            "Econ": "2.47",
            "Inns": "",
            "Mat": "11",
            "Runs": "322",
            "SR": "23.6",
            "Wkts": "33"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/156019.html",
        "http://www.espncricinfo.com/england/content/story/137128.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154552.html"
    ],
    "latest_photos": [],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nMay 15, 1929, Wall Heath, Staffordshire "
        ],
        "Bowling style": [
            "Right-arm fast-medium"
        ],
        "Died": [
            "February 25, 2004, Barmouth,  Gwynedd (aged 74 years 286 days) "
        ],
        "Full name": [
            "John Alfred Flavell"
        ],
        "Major teams": [
            "England,",
            "Worcestershire"
        ]
    },
    "profile_info": [
        "\nJack Flavell, the England and Worcestershire fast bowler, died in his sleep on February 25, aged 74. Born in Wall Heath in Staffordshire, his 401 first-class appearances produced 1,529 wickets. He played four times for England, twice in 1961 and 1964 at home against Australia. He signed for Worcestershire in 1949 and soon earned a reputation as a tearaway fast bowler with an overlong run-up.\nKnown then as \"Mad Jack\" it took him several seasons before he cut both pace and length of run-up, and he quickly became one of the outstanding new ball bowlers in county cricket. He took over 100 wickets in a season eight times, with his 171 wickets in 1961 putting him top of the national averages. \n",
        "Tom Graveney, who joined Worcestershire in 1962, says this of his first season. \"I stood at first slip and was always amazed when I had a look at the ball after Jack's first over. There was hardly a mark on either polished side, because his superb hand action meant he usually hit the seam. His method was simple. He came in off an economical run-up and bowled so close to the stumps that he effectively bowled from middle to middle stump.",
        "\"The only moan we batsmen had was that we then had to bat standing in the hole dug by his front foot! He could swing it as well, and was a captain's dream because he would bowl all day, any day, up or down wind against any batsman.\"\nFlavell was stockily built and only a little above average height (5ft 101/2 inches).  His low number of caps was because he played in a golden age of pace bowlers, including Fred Trueman, Brian Statham, Frank Tyson, Peter Loader, Alan Moss and allrounder Trevor Bailey. A modern Flavell, master of line, length and unrelenting hostility would be an England ever present.",
        "He took three hat-tricks, as well as nine wickets in an innings three times, including his best return of 9 for 30 against Kent at Dover in the final match of the season in 1955. The painful memory for this writer is that I managed 9 for 35 against Yorkshire three months earlier, and led the Brylcreem Awards of 100 guineas for best bowling, batting, fielding and wicketkeeping prizes - until Flavell pipped me on the line.",
        "Together with Devon-born Len Coldwell, he was part of one of the best new-ball pairings in county cricket in the 1960s when Worcestershire won two Championship titles, finished second twice and fourth and fifth once. He had the perfect approach to his trade, with an unshakeable faith in his rock-solid method convincing him that no batsman deserved to survive against him for long.",
        "He also played professional football for West Bromwich Albion and Walsall as a rugged defender who subscribed to the theory that \"the winger might go past me. The ball might go past - but never both at the same time.\" A keen middle handicap left-handed golfer, Flavell was a member of Enville Golf Club for many years. He played regularly after he retired from New Road in 1967 and was a popular club captain in 1981. He bought a garage in Himley and after converting it to a restaurant was a popular host for many years before he moved to Barmouth, where he ran a guest house.",
        "Flavell's life was like his bowling - straightforward with no frills but he always paid attention to detail and never missed a trick on or off the field. He spoke plainly in a broad Black Country brogue and never refused a challenge.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}