{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "5.60",
            "Ct": "5",
            "HS": "10*",
            "Inns": "10",
            "Mat": "8",
            "NO": "5",
            "Runs": "28",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "1",
            "6s": "",
            "Ave": "8.93",
            "Ct": "150",
            "HS": "62",
            "Inns": "392",
            "Mat": "341",
            "NO": "114",
            "Runs": "2485",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "44.52",
            "BBI": "3/65",
            "BBM": "3/65",
            "Balls": "2368",
            "Econ": "1.91",
            "Inns": "14",
            "Mat": "8",
            "Runs": "757",
            "SR": "139.2",
            "Wkts": "17"
        },
        {
            "": "First-class",
            "10": "17",
            "4w": "",
            "5w": "82",
            "Ave": "19.68",
            "BBI": "9/55",
            "BBM": "",
            "Balls": "78965",
            "Econ": "2.03",
            "Inns": "",
            "Mat": "341",
            "Runs": "26793",
            "SR": "58.0",
            "Wkts": "1361"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/240292.html",
        "http://www.espncricinfo.com/cricketer/content/story/141260.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155330.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/042004/051974.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042004/051974.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042004/051974.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nOctober 14, 1912, Paddington, London "
        ],
        "Bowling style": [
            "Slow left-arm orthodox"
        ],
        "Died": [
            "February 5, 1993, St John's Wood, London (aged 80 years 114 days) "
        ],
        "Full name": [
            "John Albert Young"
        ],
        "Major teams": [
            "England,",
            "Middlesex"
        ]
    },
    "profile_info": [
        null,
        " ",
        " John Albert Young, a short man with a low delivery not unlike Norman Gifford's of more recent vintage, joined the Lord's groundstaff and played occasionally for Middlesex before the Second World War, with little success. By 1945, though, he had improved, and took 8 for 71 against the RAF and 6 for 33 against the Army while guesting for Glamorgan.",
        null,
        null,
        "Young's efforts in the Championship season of 1947 should not be submerged by the runscoring feats of Compton and Edrich. The left-armer took 7 for 46 against Glamorgan, who were beaten inside two days, returned 6 for 41 and 5 for 36 against Northants, and took 9 for 82 in the match against Gloucestershire at Cheltenham, where Middlesex won by 68 runs despite Tom Goddard taking 15 wickets (7 for 70 and 8 for 86) for the home side. And Young picked up 5 for 36 against Northants as Middlesex wrapped up the title at Lord's on Aug 28. In all he took 159 wickets (17.38) in that season, topping Middlesex's averages (a position he was not to relinquish until 1955). His figures might have been even better had he not, after injuries to others, been asked to open the bowling for the last month of the season. In this unaccustomed role he picked up just one wicket.",
        "That year Young won the first of his eventual eight Test caps: at Headingley he dismissed two of South Africa's most accomplished batsmen, Alan Melville and Bruce Mitchell. He appeared in three of the Tests against the powerful 1948 Australians, sending down 11 successive maidens (a Test record at the time) to Bradman and Hassett at Trent Bridge, finishing with 1 for 79 from 60 overs in the first innings. Young's five wickets in the series included Hassett twice, and his consistency won him a tour of South Africa, under his county captain George Mann. He took 41 wickets (24.73) on the tour, taking 6 for 38 against Border and 5 for 25 v Natal, but appeared in only two of the Tests.",
        " Young's final caps came against New Zealand in 1949. Ironically, his best Test bowling figures came in his last match: 3 for 65 at Lord's, where he brought Martin Donnelly's epic 206 to an end and also dismissed Mooney and Cave. He finished with 17 wickets (44.52) in his eight Tests.",
        " Back at county level Young was as dangerous as ever, and as tight: he conceded scarcely over two runs an over throughout his career, while his wickets cost him fewer than 20 runs apiece. He took 150 wickets in 1949, 13 of them (for 119) coming against Kent at Canterbury. The previous year, at The Oval, he took 14 wickets - 7 for 50, 7 for 47 - against Surrey in Stan Squires's benefit match: Young snared the beneficiary in both innings.",
        "After a relatively quiet 1950 season (112 wickets at 22.24) Young was more incisive in 1951, taking 157 wickets (18.95) and snapping up another hat-trick, this time at Lancashire's expense. At the end of the season he recorded his best-ever bowling figures, with 9 for 55 (the other man was run out) on a turning pitch at Hastings for an England XI against a Commonwealth XI. Among Young's victims were Frank Worrell, Bruce Dooland and Derek Shackleton- and spinners George Tribe and Sonny Ramadhin, who took advantage of the helpful pitch to take the Commonwealth team to victory despite Young's efforts. Ramadhin took 11 wickets (for 61) and Tribe the other nine.",
        "The following season, 1952, was Jack Young's benefit year. Although he injured both knees in only the second match, he appeared in every game and ended with his best seasonal tally of wickets: 163 at 19.88. His benefit amounted to £4946.",
        " Young showed his liking for Canterbury's St Lawrence ground with 6 for 55 and 8 for 60 against Kent in 1953, during which he took 122 wickets (21.22). The early-season match against Northants at Peterborough was an exciting one: chasing 227, the home side were 225 for 7, then lost a wicket. After one run was scored, Young popped up to take the last two wickets with successive balls to force the tie.",
        "After two further seasons, in both of which he took 94 wickets, Young dropped out of county cricket after only three matches in 1956. He was then 43. In 341 first-class matches (292 of them for Middlesex) he had captured 1361 wickets (19.68), taking five in an innings on 82 occasions and 10 in a match 17 times. He exceeded 100 wickets each season from 1946 to 1953. Only four bowlers - Fred Titmus, J. T. and J. W. Hearne and Jim Sims- have taken more wickets for Middlesex than Young's 1182, and only the elder Hearne did so at a better average. An enthusiastic tailender, Young scored 2485 runs (8.93) in first-class cricket, with a highest score of 62 against Yorkshire at Bramall Lane in 1949, where he shared in an unlikely ninth-wicket stand of 98 with J. J. Warr (47). A tidy fielder, especially proficient in the gully, he also took 148 catches.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}