{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "153",
            "50": "1",
            "6s": "3",
            "Ave": "9.80",
            "BF": "2827",
            "Ct": "85",
            "HS": "81",
            "Inns": "194",
            "Mat": "140",
            "NO": "78",
            "Runs": "1137",
            "SR": "40.21",
            "St": "0"
        },
        {
            "": "ODIs",
            "100": "0",
            "4s": "23",
            "50": "0",
            "6s": "0",
            "Ave": "7.58",
            "BF": "561",
            "Ct": "53",
            "HS": "28",
            "Inns": "79",
            "Mat": "194",
            "NO": "43",
            "Runs": "273",
            "SR": "48.66",
            "St": "0"
        },
        {
            "": "T20Is",
            "100": "0",
            "4s": "0",
            "50": "0",
            "6s": "0",
            "Ave": "1.00",
            "BF": "2",
            "Ct": "3",
            "HS": "1*",
            "Inns": "4",
            "Mat": "19",
            "NO": "3",
            "Runs": "1",
            "SR": "50.00",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "4s": "",
            "50": "1",
            "6s": "",
            "Ave": "9.79",
            "BF": "",
            "Ct": "134",
            "HS": "81",
            "Inns": "295",
            "Mat": "231",
            "NO": "116",
            "Runs": "1753",
            "SR": "",
            "St": "0"
        },
        {
            "": "List A",
            "100": "0",
            "4s": "",
            "50": "0",
            "6s": "",
            "Ave": "9.27",
            "BF": "",
            "Ct": "65",
            "HS": "28",
            "Inns": "102",
            "Mat": "255",
            "NO": "62",
            "Runs": "371",
            "SR": "",
            "St": "0"
        },
        {
            "": "T20s",
            "100": "0",
            "4s": "3",
            "50": "0",
            "6s": "0",
            "Ave": "5.75",
            "BF": "26",
            "Ct": "8",
            "HS": "16",
            "Inns": "10",
            "Mat": "44",
            "NO": "6",
            "Runs": "23",
            "SR": "88.46",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "3",
            "4w": "27",
            "5w": "26",
            "Ave": "26.83",
            "BBI": "7/42",
            "BBM": "11/71",
            "Balls": "30778",
            "Econ": "2.89",
            "Inns": "261",
            "Mat": "140",
            "Runs": "14839",
            "SR": "55.6",
            "Wkts": "553"
        },
        {
            "": "ODIs",
            "10": "0",
            "4w": "11",
            "5w": "2",
            "Ave": "29.22",
            "BBI": "5/23",
            "BBM": "5/23",
            "Balls": "9584",
            "Econ": "4.92",
            "Inns": "191",
            "Mat": "194",
            "Runs": "7861",
            "SR": "35.6",
            "Wkts": "269"
        },
        {
            "": "T20Is",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "30.66",
            "BBI": "3/23",
            "BBM": "3/23",
            "Balls": "422",
            "Econ": "7.84",
            "Inns": "19",
            "Mat": "19",
            "Runs": "552",
            "SR": "23.4",
            "Wkts": "18"
        },
        {
            "": "First-class",
            "10": "6",
            "4w": "40",
            "5w": "44",
            "Ave": "25.38",
            "BBI": "7/42",
            "BBM": "",
            "Balls": "46946",
            "Econ": "2.91",
            "Inns": "",
            "Mat": "231",
            "Runs": "22795",
            "SR": "52.2",
            "Wkts": "898"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "11",
            "5w": "2",
            "Ave": "28.41",
            "BBI": "5/23",
            "BBM": "5/23",
            "Balls": "12414",
            "Econ": "4.83",
            "Inns": "",
            "Mat": "255",
            "Runs": "10003",
            "SR": "35.2",
            "Wkts": "352"
        },
        {
            "": "T20s",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "32.14",
            "BBI": "3/23",
            "BBM": "3/23",
            "Balls": "933",
            "Econ": "8.47",
            "Inns": "44",
            "Mat": "44",
            "Runs": "1318",
            "SR": "22.7",
            "Wkts": "41"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/blogs/content/story/1155442.html",
        "http://www.espncricinfo.com/ci/content/story/1155239.html",
        "http://www.espncricinfo.com/ci/content/story/1155226.html",
        "http://www.espncricinfo.com/ci/content/story/1155176.html",
        "http://www.espncricinfo.com/ci/content/story/1155072.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=8608"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/279300/279368.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/279300/279368.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/279300/279368.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nJuly 30, 1982, Burnley, Lancashire "
        ],
        "Bowling style": [
            "Right-arm fast-medium"
        ],
        "Current age": [
            "36 years 19 days"
        ],
        "Education": [
            "St Theodore's RC High School; St Theodore's RC Sixth Form Centre - Burnley"
        ],
        "Full name": [
            "James Michael Anderson"
        ],
        "Height": [
            "\n6 ft 2 in "
        ],
        "Major teams": [
            "England,",
            "Auckland,",
            "England Under-19s,",
            "Lancashire,",
            "Lancashire Cricket Board"
        ],
        "Nickname": [
            "Jimmy"
        ],
        "Playing role": [
            "Bowler"
        ]
    },
    "profile_info": [
        "\nJames Anderson has proved himself as one of the most skilful and prolific fast bowlers in England's history. His talents have been particularly apparent in Test cricket where his command of swing bowling, especially on his home grounds, has been the stuff of artistry, bearing comparison with any swing bowler in any age. He has been an integral part of three victorious Ashes campaigns and became the first England bowler to take 500 Test wickets, leaving Ian Botham's previous benchmark of 383 a mere dot on the horizon. His one-day career has also had its moments as he gradually became adept at bowling in a more defensive fashion, but it is as an attacking swing bowler where he has had few peers. \n",
        "Anderson's 500th Test wicket came in September 2017 when he dismissed Kraigg Brathwaite in a Lord's Test against the West Indies. It was a delivery that illustrated his talent, coming down the slope to hit middle stump (his 501st - to bowl Kieran Powell - was even better). He became only the sixth player, and third pace bowler seamer after Glenn McGrath (563) and Courtney Walsh (519), to reach the landmark and admitted to feeling emotional. \"Normally it's anger but today it was a bit more, not quite teary but emotional. I don't get like that when trying to focus on my job and it took me a bit by surprise.\"",
        "Anderson has been something of a contradiction. He has had a reputation for being shy and uncommunicative off the field, except in the company of close friends, yet on the field his verbal aggression, which he has argued is necessary to conquer that diffident character, not always endeared him to opponents or critics.",
        "For the first six years of Anderson's international career, the best way to sum up his bowling was to paraphrase Mother Goose: when he's good, he's very, very good - and when he's bad he's horrid. But when the force was with him, he was capable of irresistible spells, seemingly able to swing the ball round corners at an impressive speed.",
        "Anderson had played only three one-day games for Lancashire when he was hurried into England's one-day squad in Australia in 2002-03 as cover for Andy Caddick. He didn't have a number - or even a name - on his shirt, but a remarkable ten-over stint, costing just 12 runs, in century heat at Adelaide earned him a World Cup spot. There, he produced a matchwinning spell against Pakistan before a sobering last-over disaster against Australia.",
        "Five wickets followed in the first innings of his debut Test, against Zimbabwe at home in 2003, then a one-day hat-trick against Pakistan, but his fortunes waned. For a couple of years Anderson was a peripheral net bowler as attempts to change his action to avoid injury affected his pace and rhythm. That oft-predicted stress fracture kept him out for most of 2006, but he still made the Australian tour and the World Cup. And suddenly, in the absence of the entire Ashes-winning attack in the second half of 2007, Anderson looked the part of pack leader again.",
        "New Zealand were blown away at Trent Bridge in 2008 (Anderson 7 for 43) during a summer that earned Anderson the honour of being named among Wisden's five Cricketers of the Year. In May of that year, he made the West Indians looked clueless at Chester-le-Street (nine wickets in the match); and back at Trent Bridge in 2010 Pakistan's inexperienced batsmen could hardly lay a bat on him (5 for 54 and 6 for 17).",
        "In 2010 Anderson came of age in a staggeringly comprehensive fashion. No longer content with being unplayable when the mood caught him, he took the decision to shelve the \"magic balls\" and concentrated on hammering out a rock-solid line and length, with dot balls and maidens his new holy grail. The upshot was a scintillating year in which he proved unhittable in every sense, with an economy rate that ramped up the pressure in every spell, and a range of weapons that made him a threat on every surface. ",
        "A career-best 11-wicket haul against Pakistan at Trent Bridge, when he came as close to unplayable as at any time in his career, was the prelude to a breakthrough tour of Australia in the winter of 2010-11. Anderson arrived to a torrent of doubters, who recalled his forlorn performance on the preceding Ashes four years earlier, in which he had taken five wickets at 82.60. But he left with a series-sealing 24 scalps at 26.04, and a reputation transformed. ",
        "Deadly with conventional swing and seam, and with a new line in reverse swing as well, he had become arguably the most complete fast bowler in the world. In 2013, fittingly at Lord's, a ground where enjoyed much success, he became the fourth England bowler to reach 300 Test wickets when he had Peter Fulton caught at slip. The previous year he had eased past Brian Statham's 252 Test wickets to become Lancashire's most successful England bowler. ",
        "He was awarded the Freedom of Burnley - his home town - in 2012, which was also his benefit year. When he began the 2013 Ashes with a match-winning 10-wicket haul at Trent Bridge his form showed no signs of abating, but the following nine Tests against Australia were far less successful and his reputation had taken something of a hit by the time a chastened England returned home after the battering down under in 2013-14.",
        "Anderson took 37 wickets in seven Tests against Sri Lanka and India in 2014, but his reputation was sullied by a verbal confrontation in the first Test at Trent Bridge with India's Ravindra Jadeja and accusations of pushing and shoving on the way in the dressing room corridor. India insisted that his behaviour had become unacceptable, but the resulting ICC investigation could not separate the truth from the lies and both men got off lightly.",
        "By then, England's bowling records looked bound to fall his way.  He passed Botham's record Test-wicket haul in the Caribbean in 2015 and shortly afterwards reached 400 against New Zealand at Headingley. His fitness remained exemplary, his action as rhythmical as ever, and his appetite still powerful enough to imagine, as he passed his 33rd birthday, playing for another five years. A northern spring, Sri Lanka the opposition, cheered him with three five-wicket hails in successive Tests in Leeds and Chester-le-Street in 2016, but a shoulder injury marred his summer and he was innocuous on Indian pitches as England slumped to a 4-0 defeat that winter. ",
        "That Anderson's left-hand batting has also steadily improved from his early days as a fully paid-up rabbit was illustrated in that Trent Bridge Test when he struck 81 in the first Test against India at Trent Bridge - his maiden first-class fifty - as he shared a Test record stand of 198 for the tenth wicket with Joe Root in the first innings. He has served England with distinction as a nightwatchman on numerous occasions and went 54 Test innings before collecting a duck, an England record. At Cardiff in 2009 he survived for 69 nail-chewing minutes to help stave off defeat by Australia. He has also been an outstanding fielder, strikingly so for a fast bowler, lithe in the outfield and sharp in the catching positions.",
        null
    ],
    "recent_matches": [
        {
            "Bat & Bowl": "5/20, 4/23",
            "Ground": "Lord's",
            "Match Date": "9 Aug 2018",
            "Opposition": "v India",
            "Scorecard": "Test # 2315",
            "Team": "England"
        },
        {
            "Bat & Bowl": "2*, 2/41, 0*, 2/50",
            "Ground": "Birmingham",
            "Match Date": "1 Aug 2018",
            "Opposition": "v India",
            "Scorecard": "Test # 2314",
            "Team": "England"
        },
        {
            "Bat & Bowl": "1/38, 8, 1/52, 0",
            "Ground": "Manchester",
            "Match Date": "22 Jul 2018",
            "Opposition": "v Yorkshire",
            "Scorecard": "FC",
            "Team": "Lancashire"
        },
        {
            "Bat & Bowl": "3/43, 5, 2/35",
            "Ground": "Leeds",
            "Match Date": "1 Jun 2018",
            "Opposition": "v Pakistan",
            "Scorecard": "Test # 2305",
            "Team": "England"
        },
        {
            "Bat & Bowl": "0*, 3/82, 0*, 1/12",
            "Ground": "Lord's",
            "Match Date": "24 May 2018",
            "Opposition": "v Pakistan",
            "Scorecard": "Test # 2304",
            "Team": "England"
        },
        {
            "Bat & Bowl": "2/27, 6, 4/26",
            "Ground": "Nottingham",
            "Match Date": "11 May 2018",
            "Opposition": "v Notts",
            "Scorecard": "FC",
            "Team": "Lancashire"
        },
        {
            "Bat & Bowl": "0/91, 0, 1/46",
            "Ground": "Manchester",
            "Match Date": "4 May 2018",
            "Opposition": "v Somerset",
            "Scorecard": "FC",
            "Team": "Lancashire"
        },
        {
            "Bat & Bowl": "0*, 4/76, 1/37",
            "Ground": "Christchurch",
            "Match Date": "30 Mar 2018",
            "Opposition": "v New Zealand",
            "Scorecard": "Test # 2301",
            "Team": "England"
        },
        {
            "Bat & Bowl": "1, 3/87, 1",
            "Ground": "Auckland",
            "Match Date": "22 Mar 2018",
            "Opposition": "v New Zealand",
            "Scorecard": "Test # 2299",
            "Team": "England"
        },
        {
            "Bat & Bowl": "2/41",
            "Ground": "Hamilton",
            "Match Date": "16 Mar 2018",
            "Opposition": "v NZ XI",
            "Scorecard": "Other",
            "Team": "England"
        }
    ]
}