{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "1",
            "50": "0",
            "6s": "0",
            "Ave": "8.00",
            "Ct": "1",
            "HS": "10",
            "Inns": "3",
            "Mat": "2",
            "NO": "1",
            "Runs": "16",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "2",
            "4s": "",
            "50": "12",
            "6s": "",
            "Ave": "14.30",
            "Ct": "109",
            "HS": "126*",
            "Inns": "445",
            "Mat": "256",
            "NO": "59",
            "Runs": "5523",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "1",
            "5w": "0",
            "Ave": "15.75",
            "BBI": "4/70",
            "BBM": "6/106",
            "Balls": "340",
            "Econ": "2.22",
            "Inns": "4",
            "Mat": "2",
            "Runs": "126",
            "SR": "42.5",
            "Wkts": "8"
        },
        {
            "": "First-class",
            "10": "22",
            "4w": "",
            "5w": "96",
            "Ave": "15.23",
            "BBI": "10/129",
            "BBM": "",
            "Balls": "57072",
            "Econ": "1.93",
            "Inns": "",
            "Mat": "256",
            "Runs": "18436",
            "SR": "47.1",
            "Wkts": "1210"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/251952.html",
        "http://www.espncricinfo.com/england/content/story/103358.html",
        "http://www.espncricinfo.com/magazine/content/story/75601.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/161300/161317.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/161300/161317.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nFebruary 23, 1842, Westhampnett, Sussex "
        ],
        "Bowling style": [
            "Slow left-arm orthodox"
        ],
        "Died": [
            "October 25, 1929, Westerton, Chichester, Sussex (aged 87 years 244 days) "
        ],
        "Full name": [
            "James Lillywhite"
        ],
        "Major teams": [
            "England,",
            "Sussex"
        ],
        "Other": [
            "Umpire"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        "LILLYWHITE, JAMES, JUN., born at West Hampnett, Sussex, on February 23, 1842, died at Westerton, Chichester, on October 25,aged 87. He was the last survivor of the team which, under his captaincy, went to Australia in the winter of 1876-77, and played what is now known as the first Test Match against Australia. There had been previous combinations to tour that country, but not until March, 1877, did the Australians regard themselves as strong enough to engage an English eleven on level terms. That their faith in themselves was justified is proved by the fact that they won by 45 runs, but in the return match played just afterwards England, who on the previous occasion had been compelled to take the field without a regular wicket-keeper, were successful by four wickets. Of the twenty-two men who took part in that historic game there are now only three left, and they are all in Australia--Charles Bannerman, J. McCarthy Blackham, and Tom Garrett.",
        "James Lillywhite came of a great cricketing family, of whom the best known was his uncle, William, the \" Nonpareil.\" He bowled, as he batted, left-handed, was rather slow with a high delivery, and like others of the same period was exceptionally accurate in his pitch. His first appearance at Lord's was in June, 1862, in a match between Sussex and the M.C.C. when he took fourteen wickets for 57 runs--nine in the second innings for 29 runs. A curious feature of the contest was that there was no change of bowling in any one of the four innings, Lillywhite and Stubberfield bowling unchanged for Sussex and Jimmy Grundy and George Wootton for Marylebone.",
        "For Sussex he bowled unchanged through a match twelve times --once with Stubberfield, on five occasions with Southerton, and six times with Fillery. Three of the instances with the last-named were in consecutive matches in 1873--v. Surrey at the Oval, v. Kent at Lord's, and v. Gloucestershire at Brighton. In two other big games he and Southerton were on unchanged throughout--for Players of South v. 14 Gentlemen of South at Southampton in 1865 and for South v. North at Liverpool in 1872. Playing against odds in Australia, during the tour of 1873-4, he took eighteen for72 v.15 of New South Wales and Victoria at Sydney and twelve for 61 v. 18 of Victoria at Melbourne. Three seasons later he obtained nine for 23 v. 22 of South Australia at Adelaide. In 1872 he took ninety-four wickets for 13 runs each ; in 1873, 101 at the same cost ; and in 1876, ninety-one wickets for 14 runs each. He was, in his early days, a smart field, either at slip or mid-on, and, like most left-handers, a vigorous batsman. Twice he reached three-figures for Sussex, making 105 against Hampshire at Brighton in 1864, and 126 not out against Middlesex on the Old Cattle Market Ground at Islington. His first match for Sussex was played in 1862, and his last against Yorkshire, in 1883, and for the county he took 917 wickets for 14.75 runs apiece. For twenty seasons, 1862 to 1881 inclusive, he appeared in every game played by the side.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}