{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "1",
            "6s": "0",
            "Ave": "26.88",
            "Ct": "6",
            "HS": "70",
            "Inns": "9",
            "Mat": "8",
            "NO": "0",
            "Runs": "242",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "42",
            "50": "181",
            "6s": "",
            "Ave": "35.20",
            "Ct": "380",
            "HS": "167",
            "Inns": "1058",
            "Mat": "695",
            "NO": "157",
            "Runs": "31716",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "2",
            "Ave": "21.73",
            "BBI": "7/56",
            "BBM": "7/79",
            "Balls": "1074",
            "Econ": "2.30",
            "Inns": "13",
            "Mat": "8",
            "Runs": "413",
            "SR": "56.5",
            "Wkts": "19"
        },
        {
            "": "First-class",
            "10": "14",
            "4w": "",
            "5w": "91",
            "Ave": "22.56",
            "BBI": "9/34",
            "BBM": "",
            "Balls": "89840",
            "Econ": "2.30",
            "Inns": "",
            "Mat": "695",
            "Runs": "34524",
            "SR": "58.7",
            "Wkts": "1530"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/537461.html",
        "http://www.espncricinfo.com/magazine/content/story/297907.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155461.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154682.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/032005/058562.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/032005/058562.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/032005/058562.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nJuly 10, 1906, Chailey, Sussex "
        ],
        "Bowling style": [
            "Slow left-arm orthodox"
        ],
        "Died": [
            "September 10, 1966, Withdean, Brighton, Sussex (aged 60 years 62 days) "
        ],
        "Full name": [
            "James Langridge"
        ],
        "Major teams": [
            "England,",
            "Auckland,",
            "Sussex"
        ],
        "Other": [
            "Coach"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nJames Langridge, of Sussex and England fame, died at his home at Brighton on September 10, aged 60. An all-rounder in the truest sense of the word he could compare for both his left-hand batting and his slow left-arm bowling with the best in either field. He played for Sussex from 1924 until 1953, winning an England place on eight occasions. In his career he scored 31,716 runs, average 35.20, and took 1,530 wickets at 22.56 runs each, achieving the double feat of 1,000 runs and 100 wickets six times. He hit over 1,000 runs in twenty seasons, a total exceeded by only nine batsmen, and compiled forty-two centuries. \n",
        " James Langridge--his Christian name was always employed to distinguish him from his brother, John, who opened the batting for Sussex for many years--was born at Newick on July 10, 1906. His early cricket was played first at the local school and then for the local club, where he displayed such potential that in 1923 he went to the Sussex Nursery on the county ground. The coach, A. Millward, rapidly realised that he had in his charge a batsman of considerable ability, though at the time his bowling skill had yet to manifest itself. Langridge appeared three times for the county in 1924, but could not gain a regular place until 1927. In that season he missed by eight scoring 1,000 runs and fell four short of a maiden hundred against Middlesex at Brighton. Next season he managed both targets comfortably.",
        null,
        "A year later came his First Test Match, against the West Indies at Manchester. In the second innings of a drawn game he took seven wickets for 56 runs, including that of George Headley, whom he caught off his own bowling. This feat kept him in the side for the final Test and also earned him a place in the M.C.C. team in India that winter. He scored 70 in a draw at Calcutta when batting No. 4, and took five wickets for 63 runs in the last Test at Madras. His other three appearances on the Test field were in the home series of 1935, 1936, and 1946, and he went abroad again with E. R. T. Holmes' team to Australasia in 1935-36 and to India with Lord Tennyson in 1937-38.",
        " Langridge would undoubtedly have been chosen more frequently for England but for the presence of Hedley Verity, of Yorkshire. After the Second World War, during which Langridge served with the National Fire Service, the England selectors, left without a left-arm spin bowler of Test class by the untimely death of Verity, turned to Langridge, then aged 40, for the tour of Australia.",
        "He was one of several players to spend an unhappy time there in the cricketing sense. Chosen for the third test at Melbourne, he injured a groin muscle at practice and thus missed his life's ambition. That virtually ended his tour and his representative career, though he continued to render splendid service to Sussex.",
        "In 1950 he became only the second professional cricketer in recent years to be appointed the captain of a county side, the first being H. E. Dollery, of Warwickshire. He led Sussex for three seasons. His last match was against the 1953 Australians and he gained some slight consolation for the disappointment of Melbourne by materially assisting in preventing the tourists bringing off a win, when he batted for almost two hours in scoring 46.",
        "Langridge could perhaps be cited as the typical professional of the pre-War era, skilled in all departments of the game to which he devoted his whole life. His batting style was as modest and unobtrusive as the man himself, most of his longer innings being patiently compiled. His bowling seldom troubled the best batsmen on good pitches, but, conversely, he was rarely heavily punished, so accurate was his length.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}