{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "0",
            "50": "0",
            "6s": "0",
            "Ave": "9.00",
            "Ct": "4",
            "HS": "11",
            "Inns": "3",
            "Mat": "2",
            "NO": "1",
            "Runs": "18",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "4s": "",
            "50": "13",
            "6s": "",
            "Ave": "14.38",
            "Ct": "151",
            "HS": "95",
            "Inns": "366",
            "Mat": "256",
            "NO": "42",
            "Runs": "4661",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "18.50",
            "BBI": "3/19",
            "BBM": "3/19",
            "Balls": "216",
            "Econ": "2.05",
            "Inns": "3",
            "Mat": "2",
            "Runs": "74",
            "SR": "54.0",
            "Wkts": "4"
        },
        {
            "": "First-class",
            "10": "12",
            "4w": "",
            "5w": "49",
            "Ave": "19.88",
            "BBI": "8/36",
            "BBM": "",
            "Balls": "37449",
            "Econ": "2.60",
            "Inns": "",
            "Mat": "256",
            "Runs": "16285",
            "SR": "45.7",
            "Wkts": "819"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/128175.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/062004/053214.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/062004/053214.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/062004/053214.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJune 21, 1922, Burnopfield, Co Durham "
        ],
        "Bowling style": [
            "Right-arm offbreak"
        ],
        "Died": [
            "January 26, 2003, Altrincham, Lancashire (aged 80 years 219 days) "
        ],
        "Full name": [
            "James Edward McConnon"
        ],
        "Major teams": [
            "England,",
            "Glamorgan"
        ]
    },
    "profile_info": [
        "\nJames Edward McConnon was a tall and thoughtful Geordie who found his way into\nthe Glamorgan cricket dressing-room as he was completing a professional\nfootball career with Lovells Athletic near Newport, having played wartime friendlies in 1944-45 for Aston Villa. He brought with him a knee injury, but that did not stop him bowling fast for Newport during the summer and attracting the attention of the county. \n",
        "He made his first-class debut for Glamorgan against Surrey at The Oval in 1950 at the age of 28, but by then as an off-spinner with a smooth, high action: he showed that he had batting skills capable of development and from the start\nestablished himself as a superb close fielder. His large hands and long fingers that manufactured such sharp spin were also easy grippers of balls flying through the gully. In a couple of seasons, therefore, McConnon the club\nseamer had undergone a make-over that was to propel him into the England Test team in 1954, when he played two Tests against Pakistan. That says much for his\nnatural talent and intelligence.",
        "In his second season with Glamorgan he took 136 wickets and, with Len Muncer, cemented a place in the hearts and minds of everyone Welsh who loved the\ngame. At Swansea in August, the Muncer-McConnon partnership, two off-spinners, routed the South African tourists in an amazing match. The first innings\nwere tied on 111. Glamorgan managed only 147 second time around and the tourists, 54 for no wicket at tea on the second day, looked to be racing to victory. Muncer followed his first innings 7 for 45 with 4 for 16 in 8.5 overs.\nJim, in the second innings, took 6 for 27 including a hat-trick, and Glamorgan won by 64 runs. I was one of 30,000 spectators who watched every ball.",
        "Jim's star billing was assured thereafter and enhanced when he played his two Tests for England at Old Trafford and The Oval. He started with a spell of 3 for 12 in six overs and held four catches. He was chosen to tour Australia\nin 1954-55 ahead of Jim Laker. Unfortunately he broke a little finger early on and was forced to return home. The knee injury and the brittle bones spoiled his\nchances of a long Test career.",
        "Jim, it could be argued, had another 'enemy', himself: he lacked self-confidence. Don Shepherd always admired his superb technique: 'Jim got so\nclose to the stumps at delivery he would often knock off the bails with his backside, and round the wicket he was still close, with a beautiful flight.' Peter Walker will tell you how sharply Jim turned the ball and how many catches\nflew into the leg trap. Jim himself became hesitant if a class batsman attacked him and we all recall how Wilf Wooller, the captain, spent time between balls\ncajoling or encouraging Jimmy Mac. He was a match-winner in his pomp and a valued member of the side.",
        "When I first entered a Glamorgan dressing-room in the mid-1950s, I found Jim pleasant, chatty and welcoming to youngsters. With Willie Jones of an evening he would sip a very slow beer, but only one. His widow Pauline recently recalled with Shepherd how she and Jim often sat, she with a glass of red wine\nand he with white, and I have been warmed to hear that the Cricketers'\nAssociation are sending her a little of the tincture of her choice.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}