{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "2",
            "6s": "2",
            "Ave": "14.08",
            "Ct": "12",
            "HS": "63",
            "Inns": "63",
            "Mat": "46",
            "NO": "15",
            "Runs": "676",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "2",
            "50": "18",
            "6s": "",
            "Ave": "16.60",
            "Ct": "270",
            "HS": "113",
            "Inns": "548",
            "Mat": "450",
            "NO": "108",
            "Runs": "7304",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "3",
            "4w": "13",
            "5w": "9",
            "Ave": "21.24",
            "BBI": "10/53",
            "BBM": "19/90",
            "Balls": "12027",
            "Econ": "2.04",
            "Inns": "86",
            "Mat": "46",
            "Runs": "4101",
            "SR": "62.3",
            "Wkts": "193"
        },
        {
            "": "First-class",
            "10": "32",
            "4w": "",
            "5w": "127",
            "Ave": "18.41",
            "BBI": "10/53",
            "BBM": "",
            "Balls": "101370",
            "Econ": "2.11",
            "Inns": "",
            "Mat": "450",
            "Runs": "35791",
            "SR": "52.1",
            "Wkts": "1944"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/blogs/content/story/1150567.html",
        "http://www.espncricinfo.com/magazine/content/story/1121108.html",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/1119605/when-australia-were-spun-dry",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/1066513/sailing-with-the-stars",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/1063021/-the-wrist-is-a-forgotten-area-of-spin-bowling",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=16172"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/65700/65788.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/65700/65788.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/65700/65788.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nFebruary 9, 1922, Frizinghall, Bradford, Yorkshire "
        ],
        "Bowling style": [
            "Right-arm offbreak"
        ],
        "Died": [
            "April 23, 1986, Putney, London (aged 64 years 73 days) "
        ],
        "Full name": [
            "James Charles Laker"
        ],
        "Major teams": [
            "England,",
            "Auckland,",
            "Essex,",
            "Surrey"
        ]
    },
    "profile_info": [
        null,
        "Since the days of Howell and Trumble at the turn of the century, Australian wickets had become so unresponsive to finger-spin that the off-break had virtually disappeared and sides relied on pace and wrist-spin - Gregory and McDonald, Lindwall, Miller and Johnston or again Hordern, Mailey, Grimmett and O'Reilly. Against these two types of bowler the essential is to get into line, so that the bat can swing straight down the path of the ball. But the batsman who follows this principle against vicious off-spin soon finds himself reduced to an ugly jab right across the line, and the result is always likely to be an lbw or a catch to one of the close-fielders. Moreover, so accurate was Laker that these fielders could stand very close indeed. In any case this was the weakest Australian batting side for more than 60 years, with the possible exception of 1912 when four of their essential batsmen refused to come. In particular, they lacked a great attacking genius like Trumper, MacArtney or Bradman who would refuse to be dictated to and who might have disrupted the entire plan. Indeed, the Australians had had a foretaste earlier in the season of what might happen when, for Surrey at The Oval, Laker had taken 10 for 88 in the first innings, the only instance of a bowler performing the feat twice in one season. Altogether that summer he played seven times against the Australians and took 63 wickets for 10 runs each.",
        "Born at Frizinghall, near Bradford, Laker was brought up in Yorkshire and in his schooldays was a batsman and a fast bowler. It was B. B. Wilson who, in indoor nets early in the war, suggested that he should change to off-spin and, while serving in the Middle East and having the chance of playing Army cricket with a number of distinguished players, he turned the advice to good account. Before being demobilised he was billeted at Catford and joined the cricket club, whose president then was Andrew Kempton, who for years did so much for young Surrey cricketers. Kempton recommended him to The Oval and, after playing twice for Surrey in 1946 against the Combined Services, he was taken on the county staff, the Surrey authorities having first made sure that Yorkshire were not interested. He soon made his place secure in the Surrey side in 1947 and headed their bowling averages. At the end of the season he was picked for the largely experimental MCC side which Gubby Allen was taking to the West Indies and was one of the few successes among the untried players. In the first innings of the first Test he took 7 for 103 (six of them on the second morning for 25) and, though handicapped later by strained stomach muscles, he came out top of the averages.",
        "However, in England in 1948 he suffered a severe setback. The Australian side that year was, at a modest computation, one of the strongest batting sides in the history of cricket, and nothing in Laker's limited experience had prepared him for such an ordeal. On his second appearance against them for MCC at Lord's, he was hit for nine 6s on the second morning. None the less he was chosen for the first Test and created a sensation by being easily the top scorer in the first innings with 63 made in 90 minutes: the total was 165 and he and Bedser added 89 for the ninth wicket. He also took three early wickets, Morris, Barnes and Miller, but after that he was ineffective, as he was too in the second Test. Dropped for the third Test, he was recalled for the fourth, in which Australia, set to get 404 in 344 minutes, got them within a quarter of an hour of time. The pitch was taking spin, the ball was lifting - a few years later, Laker would have been in his element. Unfortunately he failed to keep a length: moreover, although there was a spot just where a slow left-armer or leg-spinner could have used it, it was no help to him. Altogether that season his fourteen wickets against the Australians cost him 59.35 runs each, and it was probably this, and especially the treatment he received at Lord's, which led the selectors to feel that, however successful he might be in county cricket, he was not really a Test match bowler.",
        null,
        "After 1956 the attitude of the selectors naturally changed. In 1957 Laker played in four Tests against West Indies, missing one through illness, and again in 1958 in four of the five against New Zealand. In 1956-57 he was one of the MCC side in South Africa, where he met with fair success, and at last in 1958-59 was picked for a tour of Australia, where he topped the bowling averages both in the Tests and in all first-class matches. But he was by now feeling the strain and opted out of the New Zealand part of the tour which followed. In England in 1959 he was not the bowler he had been: his 78 wickets cost 24.61 runs each and he was much handicapped by an arthritic finger. At the end of the season he retired from the Surrey side, having taken for them, over thirteen years, 1,395 wickets at 17.37 in 309 matches: eleven times he had more than 100 wickets in a season. However, in 1962 he was persuaded by his friend, Trevor Bailey, to turn out for Essex, and for three years he appeared for them in 30 matches as an amateur. He was still capable of discomfiting the best players.",
        null,
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}