{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "4.00",
            "Ct": "6",
            "HS": "12",
            "Inns": "4",
            "Mat": "4",
            "NO": "0",
            "Runs": "16",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "4",
            "50": "21",
            "6s": "",
            "Ave": "17.30",
            "Ct": "252",
            "HS": "123",
            "Inns": "635",
            "Mat": "462",
            "NO": "116",
            "Runs": "8983",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "1",
            "Ave": "43.63",
            "BBI": "5/73",
            "BBM": "7/168",
            "Balls": "887",
            "Econ": "3.24",
            "Inns": "8",
            "Mat": "4",
            "Runs": "480",
            "SR": "80.6",
            "Wkts": "11"
        },
        {
            "": "First-class",
            "10": "21",
            "4w": "",
            "5w": "98",
            "Ave": "24.92",
            "BBI": "10/90",
            "BBM": "",
            "Balls": "77035",
            "Econ": "3.06",
            "Inns": "",
            "Mat": "462",
            "Runs": "39401",
            "SR": "48.7",
            "Wkts": "1581"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/236192.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155733.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/100100/100111.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMay 13, 1903, Leyton, Essex "
        ],
        "Bowling style": [
            "Legbreak"
        ],
        "Died": [
            "April 27, 1973, Canterbury, Kent (aged 69 years 349 days) "
        ],
        "Full name": [
            "James Morton Sims"
        ],
        "Major teams": [
            "England,",
            "Middlesex"
        ]
    },
    "profile_info": [
        null,
        null,
        "Originally regarded mainly as a batsman, often opening the innings, Jim Sims developed into an all-rounder and particularly after the Second World War was relied upon chiefly for his bowling. Eight times he dismissed over 100 batsmen in a season and in 1939, with 159 victims at 20.30 runs each, he was the most prolific wicket-taker in English first-class cricket. For East against West at Kingston-upon-Thames in 1948 he enjoyed the distinction of taking all ten wickets-for 90 runs-in an innings, a feat he went close to performing 15 years earlier at Old Trafford when disposing of nine Lancashire batsmen for 92 runs. He achieved the hat-trick for Middlesex at the expense of A. Melville\"s South African team at Lord\"s in 1947 and in 1933 sent back three Derbyshire batsmen in the course of four balls at Chesterfield.",
        "In his book, Cricket Prints, the late RC  Robertson-Glasgow wrote: Jim Sims can unbuckle the most difficult googly in the game today. How highly this tall, lean, genial cricketer was held in the esteem of the Middlesex authorities was illustrated by their granting him two benefits in five seasons. The first in 1946 was seriously affected by rain.",
        "He toured Australia under Percy Holmes in 1935-36 and under Gubby Allen the following winter when, though doing well in other matches, he proved costly on the hard pitches, in the two Tests for which he was called upon. He also played once each for England against South Africa, in 1935, and India, in 1936, both in England.",
        "A humorous man, who never tired of telling stories about the game in words spoken from the side of his mouth, he was popular wherever he went. Many of them concerned his idol, Pasty Hendren. One regarding Sims was about the occasion when Harold Larwood, on a fiery pitch, was making the ball fly in a somewhat terrifying manner. Sims, unusually quiet, was awaiting his turn to bat when Hendren asked him: 'Feeling nervous, Jim?' Said Sims: 'Not exactly nervous, Pasty; just a trifle apprehensive.'",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}