{
    "batting_averages": [
        {
            "": "Tests",
            "100": "13",
            "4s": "694",
            "50": "41",
            "6s": "16",
            "Ave": "51.90",
            "BF": "11011",
            "Ct": "80",
            "HS": "254",
            "Inns": "129",
            "Mat": "71",
            "NO": "12",
            "Runs": "6073",
            "SR": "55.15",
            "St": "0"
        },
        {
            "": "ODIs",
            "100": "13",
            "4s": "381",
            "50": "28",
            "6s": "40",
            "Ave": "51.61",
            "BF": "5528",
            "Ct": "55",
            "HS": "133*",
            "Inns": "110",
            "Mat": "116",
            "NO": "17",
            "Runs": "4800",
            "SR": "86.83",
            "St": "0"
        },
        {
            "": "T20Is",
            "100": "0",
            "4s": "80",
            "50": "4",
            "6s": "16",
            "Ave": "35.77",
            "BF": "612",
            "Ct": "15",
            "HS": "90*",
            "Inns": "26",
            "Mat": "28",
            "NO": "4",
            "Runs": "787",
            "SR": "128.59",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "22",
            "4s": "1165",
            "50": "56",
            "6s": "26",
            "Ave": "49.55",
            "BF": "17566",
            "Ct": "117",
            "HS": "254",
            "Inns": "221",
            "Mat": "128",
            "NO": "22",
            "Runs": "9862",
            "SR": "56.14",
            "St": "0"
        },
        {
            "": "List A",
            "100": "14",
            "4s": "489",
            "50": "36",
            "6s": "45",
            "Ave": "47.95",
            "BF": "7037",
            "Ct": "67",
            "HS": "133*",
            "Inns": "147",
            "Mat": "154",
            "NO": "22",
            "Runs": "5994",
            "SR": "85.17",
            "St": "0"
        },
        {
            "": "T20s",
            "100": "0",
            "4s": "157",
            "50": "8",
            "6s": "24",
            "Ave": "32.27",
            "BF": "1112",
            "Ct": "26",
            "HS": "92*",
            "Inns": "55",
            "Mat": "61",
            "NO": "11",
            "Runs": "1420",
            "SR": "127.69",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "45.63",
            "BBI": "2/9",
            "BBM": "2/9",
            "Balls": "1728",
            "Econ": "3.01",
            "Inns": "62",
            "Mat": "71",
            "Runs": "867",
            "SR": "90.9",
            "Wkts": "19"
        },
        {
            "": "ODIs",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "64.95",
            "BBI": "3/52",
            "BBM": "3/52",
            "Balls": "1342",
            "Econ": "5.80",
            "Inns": "60",
            "Mat": "116",
            "Runs": "1299",
            "SR": "67.1",
            "Wkts": "20"
        },
        {
            "": "T20Is",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "23.16",
            "BBI": "2/9",
            "BBM": "2/9",
            "Balls": "84",
            "Econ": "9.92",
            "Inns": "9",
            "Mat": "28",
            "Runs": "139",
            "SR": "14.0",
            "Wkts": "6"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "1",
            "5w": "0",
            "Ave": "44.12",
            "BBI": "4/5",
            "BBM": "4/5",
            "Balls": "3373",
            "Econ": "3.06",
            "Inns": "116",
            "Mat": "128",
            "Runs": "1721",
            "SR": "86.4",
            "Wkts": "39"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "53.48",
            "BBI": "3/52",
            "BBM": "3/52",
            "Balls": "1887",
            "Econ": "5.61",
            "Inns": "84",
            "Mat": "154",
            "Runs": "1765",
            "SR": "57.1",
            "Wkts": "33"
        },
        {
            "": "T20s",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "40.80",
            "BBI": "2/9",
            "BBM": "2/9",
            "Balls": "258",
            "Econ": "9.48",
            "Inns": "30",
            "Mat": "61",
            "Runs": "408",
            "SR": "25.8",
            "Wkts": "10"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/1155176.html",
        "http://www.espncricinfo.com/ci/content/story/1155171.html",
        "http://www.espncricinfo.com/ci/content/story/1155163.html",
        "http://www.espncricinfo.com/ci/content/story/1154757.html",
        "http://www.espncricinfo.com/ci/content/story/1154392.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=303669"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/279300/279383.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/279300/279383.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/279300/279383.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nDecember 30, 1990, Sheffield, Yorkshire "
        ],
        "Bowling style": [
            "Right-arm offbreak"
        ],
        "Current age": [
            "27 years 231 days"
        ],
        "Full name": [
            "Joseph Edward Root"
        ],
        "Major teams": [
            "England,",
            "England Lions,",
            "England Under-19s,",
            "Yorkshire,",
            "Yorkshire 2nd XI,",
            "Yorkshire Academy,",
            "Yorkshire Under-17s"
        ],
        "Playing role": [
            "Top-order batsman"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nThat Joe Root would one day captain England was taken as read when he hit the grand old age of 23. The accolade everybody anticipated became his three years later after Alastair Cook stood down after a heavy defeat in India with the familiar exhausted look of a Test captain who felt he could do no more. It was understandable that there were a few fears for Root's future workload. He was rare among England batsmen in achieving maturity so quickly, and had looked consumed by the delights of batting from the moment he first took guard. Now he had new responsibilities ahead.  \n",
        "Slight of build, perky of shot and with a scampish grin that got under a bowler's skin, by the time Root was appointed England captain he had rattled up 53 Tests within five years with an average top side of 50, comfortably the highest among contemporary England players. Early expectations that he would establish himself as an opener did not materialise as an expansive game increasingly seemed better acquainted to No. 3 or No. 4. He was equally influential in limited-overs cricket where England's commitment to fearless cricket after their 2015 World Cup was much to his tastes, his crispness of stroke and shrewd judgment enabling him to bat purposefully around batsmen of greater weight of shot.",
        "Root had never been a strikingly heavy scorer as he worked through the ranks, nor was he particularly athletic, but his systematic approach to batting was that of a young batsman who would not sell his wicket easily and gave England hope that he would be able to attune his game to the highest level. A slender batsman reliant more on precision than weight of stroke, his patience and stubbornness at the crease had Geoffrey Boycott gushing that he reminded him of himself, although Root soon developed a much broader range. Others saw some of his mentor Michael Vaughan in Root's front-foot drive - the pair also both attended Sheffield Collegiate.",
        "He made his mark with the England Under-19 squad in Bangladesh, shortly before the youth World Cup in New Zealand in 2010. He signed a three-year contract with Yorkshire that year. He narrowly missed out on scoring 1000 runs in his first full season with the first XI, though his performances earned him a shot with England Lions. 2011 was a breakthrough season as he made 1,013 runs at 36.17: a bright point in a poor campaign for Yorkshire who were relegated in the Championship. He again toured with England Lions that winter. ",
        "Back in England, Root, like most batsman, struggled during a rainy 2012 summer but perfectly demonstrated his talent with an unbeaten 222 against Hampshire at West End. He was named Cricket Writer's Club Young Player of the Year. The following summer he returned to the county game as an England player now walking the walk: big hundreds against Durham at Chester-le-Street and Derbyshire at Headingley confirming that here was a player of stature. ",
        "\nRoot's Test debut for England in Nagpur in 2012 exemplified the qualities which had attracted coaches from an early age. He began with England's sixth-longest debut innings in terms of balls faced, 73 from 229 balls as he displayed the patience and discrimination demanded both by the situation of the game and a desperately slow surface. ",
        "His rise continued with a maiden Test hundred in his home ground, Headingley, against New Zealand in 2013 followed by a maiden Ashes century at Lord's having been promoted to open at the beginning of the series. He risked the wrath of Yorkshire followers by suggesting that a Test hundred at Lord's was as good as it gets.",
        "Root looked set to occupy England's Test opening role for many years to come. But that stability did not remain as England were whitewashed in Australia in 2012-13. He started at No 6, in recognition of the fact that Australia were exposing technical frailties in his game, but was promoted to No 3 when Jonathan Trott left the tour with a stress-related illness and as much as he suggested he was happy to bat anywhere, it did not aid his cause. He found the going tough, becoming increasingly hesitant as his back-foot game was skilfully exposed, and his unease extended into his one-day game where he struggled to score at an acceptable tempo.",
        "Proof of Root's ability came in the way he responded. Back in England, he followed up a two-tone double hundred against Sri Lanka at Lord's - a disciplined innings with a freewheeling finale - with two more big hundreds against India. All three had the not out asterisk. That seemed to say a lot about him.",
        "He even had the fortune to skipper Yorkshire to the Championship title at Trent Bridge in 2014 when Andrew Gale was suspended, less than a fortnight after he became the first Yorkshire batsman to hit an ODI hundred at Headingley, with India the victims. He also skippered Yorkshire during a thumping defeat at Middlesex in which they chased down 400-plus in the fourth innings. To his amusement, his team-mates dubbed him \"Craptain\". ",
        "His full potential then poured forth in 2015 when he made 1,385 Test runs in the year, second only to Australia's Steven Smith and vied with Smith at the top of the ICC Test rankings. Only Michael Vaughan had made more runs in a calendar year for England; nobody had matched his 2228 runs across all three forms of the game. Root played with alacrity on all surfaces and in all formats and his obvious delight in his art was a positive symbol in an England side committed in all formats to a more enterprising approach. Jaunty Ashes hundreds at Cardiff and Nottingham helped England to victories, his consistency at No. 4 repeatedly masked top-order frailties, and a mischievous sense of humour made his success all the more pleasurable.",
        "As England fell to defeat against Pakistan in the UAE in late 2015, a pattern began to build up which piqued Root even as he confirmed himself as one of the best batsmen around: his world became rather too full of entertaining 70s and 80s when he felt that a big hundred was there for the taking. Between his hundred in Johannesburg in early 2016 on a triumphant England tour and a century in Rajkot as England slumped 4-0 to India, he passed 50 six times but only converted one into a hundred. There again, it was quite a hundred: a career-best 254 against Pakistan at Old Trafford that banished talk of premature burnout in a non-stop England programme.",
        "England, upon giving him the Test job ahead of the 2017 season, were mindful of the dangers that they might overload him. He allayed any immediate fears that the pressures of captaincy may affect his run-scoring with what proved to be a matchwinning 190 against South Africa in his first knock as England skipper. It was a determinedly flamboyant and rapid innings, spanning only 234 balls, as he set the tone of his captaincy from the outset.",
        "By the end of England's longest-ever international summer, he became the top run-scorer in international matches in a calendar year in England, going past Graham Gooch's 1,277 runs in 1990.",
        null
    ],
    "recent_matches": [
        {
            "Bat & Bowl": "19",
            "Ground": "Lord's",
            "Match Date": "9 Aug 2018",
            "Opposition": "v India",
            "Scorecard": "Test # 2315",
            "Team": "England"
        },
        {
            "Bat & Bowl": "80, 14",
            "Ground": "Birmingham",
            "Match Date": "1 Aug 2018",
            "Opposition": "v India",
            "Scorecard": "Test # 2314",
            "Team": "England"
        },
        {
            "Bat & Bowl": "22, 3, 4/5",
            "Ground": "Manchester",
            "Match Date": "22 Jul 2018",
            "Opposition": "v Lancashire",
            "Scorecard": "FC",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "51*",
            "Ground": "Manchester",
            "Match Date": "20 Jul 2018",
            "Opposition": "v Lancashire",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "100*",
            "Ground": "Leeds",
            "Match Date": "17 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "ODI # 4018",
            "Team": "England"
        },
        {
            "Bat & Bowl": "113*",
            "Ground": "Lord's",
            "Match Date": "14 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "ODI # 4016",
            "Team": "England"
        },
        {
            "Bat & Bowl": "3, 0/9",
            "Ground": "Nottingham",
            "Match Date": "12 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "ODI # 4014",
            "Team": "England"
        },
        {
            "Bat & Bowl": "9",
            "Ground": "Cardiff",
            "Match Date": "6 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "T20I # 688",
            "Team": "England"
        },
        {
            "Bat & Bowl": "0",
            "Ground": "Manchester",
            "Match Date": "3 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "T20I # 684",
            "Team": "England"
        },
        {
            "Bat & Bowl": "35",
            "Ground": "Birmingham",
            "Match Date": "27 Jun 2018",
            "Opposition": "v Australia",
            "Scorecard": "T20I # 679",
            "Team": "England"
        }
    ]
}