{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "28.00",
            "Ct": "0",
            "HS": "28",
            "Inns": "1",
            "Mat": "1",
            "NO": "0",
            "Runs": "28",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "8",
            "50": "49",
            "6s": "",
            "Ave": "21.26",
            "Ct": "157",
            "HS": "135",
            "Inns": "503",
            "Mat": "306",
            "NO": "23",
            "Runs": "10206",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "1",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "44",
            "Econ": "6.68",
            "Inns": "",
            "Mat": "306",
            "Runs": "49",
            "SR": "-",
            "Wkts": "0"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155616.html"
    ],
    "latest_photos": [],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nFebruary 9, 1855, Thornton Heath, Surrey "
        ],
        "Died": [
            "July 5, 1920, Blackheath, London (aged 65 years 147 days) "
        ],
        "Full name": [
            "John Shuter"
        ],
        "Major teams": [
            "England,",
            "Kent,",
            "Surrey"
        ]
    },
    "profile_info": [
        null,
        "The sudden death on July 5th at his home at Blackheath, of John Shuter came as a shock to the general body of cricketers. On the previous Friday he was at the Oval and to all appearances in good health. His intimate friends knew, however, that the attack of hemorrhage that killed him was not the first of the kind from which he had suffered. It was in September 1919, when Mr. Findlay went to Lord's, that he took up the post of secretary to the Surrey Club. He was, perhaps, a little too old for such an onerous position, but everyone hoped he had several years of work before him. Any way it was only fitting that he should to the end have been closely associated with Surrey cricket. His name will be remembered as long as the Surrey Club exists, as it was under his leadership that Surrey won back the first place among the counties in 1887, and enjoyed for the next five seasons a period of unexampled success. John Shuter belonged to Surrey by birth--he was born at Thornton Heath on February 9, 1855--but living at Bexley he was in his young days connected with club cricket in Kent. He was in the Winchester eleven in 1871, 1872, and 1873 being captain and the best bat in the team in his last year. In 1873 he played a fine innings of 52 but it was only in 1871 that he had the good fortune to be on the winning side. It was in that year and 1870 that G. S. Raynor--anticipating modern bowlers--demoralised the Eton batsmen by his bewildering swerve. After leaving Winchester John Shuter played in a county match for Kent--against Lancashire at Maidstone--in 1874, and in the following year he played for the County eleven against the Kent Coldts at Catford Bridge. However, his potential value as a batsman was not realised, and after a time he threw in his lot with Surrey, playing in three matches for his native county in 1877. No success rewarded him that year, but in 1878 he took a very decided step to the front, and left no doubt as to his class.",
        "To the end of his life Mr. Shuter recalled with some pride--he was talking about the matter last summer--that when the Australians were seen for the first time at the Oval he scored 39 against Spofforth. I remember the occasion very well for some of the Australians--flushed with the triumph over the M.C.C. at Lord's--said in their innocence that Shuter was the best bat in England! I am not quite sure when Mr. Shuter became permanently captain of Surrey--the books are rather vague on the point, but he was, I think, firmly installed when the great revival began in 1883. From that time the improvement went on almost without check. The season of 1886, marked by a double victory over the Australians, saw Surrey practically as good a side as Notts, and in 1887 came the full reward of long-continued effort. For the first time since 1864 Surrey stood at the top of the tree. Mr. Shuter had long before this made himself a first-rate captain and he had a splendid eleven under his command, George Lohmann's bowling and W. W. Read's batting being of course the main elements of strength. Once on top Surrey did not look back till 1893. They were first in 1888, tied with Lancashire and Notts in 1889, and were first in 1890, 1891 and 1892. Then came a change of fortune in 1893, but as some compensation for falling behind in purely county cricket, Surrey won both their matches with the Australians. After the season of 1893, Mr. Shuter, to everyone's regret, was compelled by stress of business to resign the captaincy of the eleven. He was succeeded by Mr. K. J. Key and as all lovers of cricket will remember Surrey under their new leader won the championship in 1894, 1895 and 1899.",
        "In thinking of John Shuter as the Surrey captain one is apt to forget what a fine batsman he was--good enough for any eleven. For so short a man--he stood only 5ft. 6ins.--he had a singularly graceful style, and his punishing power on the off side was remarkable. He did not care for averages or personal glory. His one idea was to win the match for his side. Among all his doings in the cricket field there was nothing he recalled with keener pleasure than a fight against time in a match between the M.C.C. and the Australians at Lord's in 1890. The M.C.C. were left with only 111 to get, but they had to beat the clock as well as the Australians, eighty-five minutes remaining for play. W. G. Grace took Shuter in with him and, with Turner and Ferris bowling, 32 runs were scored in a quarter of an hour. In an hour the match was over, the M.C.C. winning by seven wickets. Mr. Shuter played nine times for Gentlemen v. Players, but little or no success rewarded him, his best score being 41, and his aggregate of runs in fifteen innings only 182. All his best work was done for Surrey. He played once for England against Australia--at the Oval in 1888. In the long years between his resignation of the captaincy and his appointment in 1919 as secretary of the club Mr. Shuter was always in closest touch with Surrey cricket. I find from Bat v. Ball that he made nine scores of over a hundred for Surrey. The first was 110 against Sussex at Brighton in 1879, and the last 117 against Essex at the Oval in 1890. His best score against the Australians was 71 for the Gentlemen of England at Lord's in 1888. S.H.P.",
        null
    ],
    "recent_matches": [
        {},
        {}
    ]
}