{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "10.62",
            "Ct": "3",
            "HS": "24",
            "Inns": "10",
            "Mat": "6",
            "NO": "2",
            "Runs": "85",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "40",
            "50": "129",
            "6s": "",
            "Ave": "33.18",
            "Ct": "247",
            "HS": "294",
            "Inns": "845",
            "Mat": "535",
            "NO": "105",
            "Runs": "24557",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "1",
            "5w": "1",
            "Ave": "21.50",
            "BBI": "5/76",
            "BBM": "8/164",
            "Balls": "999",
            "Econ": "2.32",
            "Inns": "9",
            "Mat": "6",
            "Runs": "387",
            "SR": "55.5",
            "Wkts": "18"
        },
        {
            "": "First-class",
            "10": "17",
            "4w": "",
            "5w": "82",
            "Ave": "24.52",
            "BBI": "8/65",
            "BBM": "",
            "Balls": "68269",
            "Econ": "2.67",
            "Inns": "",
            "Mat": "535",
            "Runs": "30461",
            "SR": "54.9",
            "Wkts": "1242"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155473.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154784.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/102004/055272.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/102004/055272.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nJuly 19, 1876, Hucknall Torkard, Nottinghamshire "
        ],
        "Died": [
            "August 21, 1963, Basford, Nottinghamshire (aged 87 years 33 days) "
        ],
        "Full name": [
            "John Richmond Gunn"
        ],
        "Major teams": [
            "England,",
            "London County,",
            "Nottinghamshire"
        ]
    },
    "profile_info": [
        "\nJohn Richmond Gunn, who died in hospital at Nottingham on August 21, aged 87, was a member of a celebrated Nottinghamshire cricketing family. Nephew of William Gunn and elder brother of George, he was uncle of G.V., all of whom, like himself, played for the county. A fine all-rounder, John Gunn made his first appearance for Nottinghamshire in 1896 and continued his professional career with the county till 1925. In that time he scored 24,601 runs, average 33.19, took 1,243 wickets at 24.50 runs each and held 233 catches. \n",
        "A left-hander possessing both sound defence and well-varied powers of hitting, he registered 41 centuries, the heighest being 294 in less than four and a half hours against Leicestershire at Trent Bridge in 1903 when he and William Gunn, in adding 369, established a Nottinghamshire third-wicket record which still stands. That season was the first of four in succession in which John Gunn scored over 1,200 runs and took more than 100 wickets. Two years later, against Essex at Leyton, he and A. O. Jones added 361 for the fourth wicket, which also remains a record for the county.",
        "As a left-arm slow-medium bowler with skilful variation of flight and spin, he achieved some notable successes, among them 14 wickets for 132 runs (eight for 63 and six for 69) against Surrey at the Oval and 14 for 174 runs (six for 53 and eight for 121) against Essex at Leyton, both in the same week in 1903, his most notable summer as an all-rounder with 1,665 runs (average 42.69) and 118 wickets (average 19.34). He performed the hat-trick at the expense of Derbyshire at Chesterfield in 1904 and of Middlesex at Lord's in 1899 and in 1921 at Nottingham he dismissed three Lancashire batsmen, all leg before, in four balls. He excelled as a fieldsman at cover-point, where, clever in anticipation, he had few superiors.",
        "He made six appearances for England. His one visit to Australia was in 1901-2 with that unfortunate team led by A. C. MacLaren which, after winning the first of the Test matches in a single innings, suffered defeat in the other four. He played once against Australia in England, at Trent Bridge under F. S. Jackson in 1905. He represented Players v. Gentlemen on 13 occasions.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}