{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "2",
            "6s": "14",
            "Ave": "19.78",
            "Ct": "12",
            "HS": "66",
            "Inns": "41",
            "Mat": "28",
            "NO": "8",
            "Runs": "653",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "18",
            "6s": "",
            "Ave": "16.08",
            "Ct": "257",
            "HS": "79",
            "Inns": "527",
            "Mat": "412",
            "NO": "71",
            "Runs": "7333",
            "St": "0"
        },
        {
            "": "List A",
            "100": "0",
            "50": "0",
            "6s": "",
            "Ave": "7.25",
            "Ct": "0",
            "HS": "19",
            "Inns": "4",
            "Mat": "4",
            "NO": "0",
            "Runs": "29",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "1",
            "4w": "7",
            "5w": "5",
            "Ave": "20.39",
            "BBI": "7/36",
            "BBM": "12/89",
            "Balls": "6597",
            "Econ": "1.89",
            "Inns": "52",
            "Mat": "28",
            "Runs": "2080",
            "SR": "64.6",
            "Wkts": "102"
        },
        {
            "": "First-class",
            "10": "29",
            "4w": "",
            "5w": "134",
            "Ave": "18.97",
            "BBI": "9/25",
            "BBM": "",
            "Balls": "102626",
            "Econ": "2.04",
            "Inns": "",
            "Mat": "412",
            "Runs": "35027",
            "SR": "55.5",
            "Wkts": "1846"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "21.40",
            "BBI": "2/21",
            "BBM": "2/21",
            "Balls": "227",
            "Econ": "2.82",
            "Inns": "",
            "Mat": "4",
            "Runs": "107",
            "SR": "45.4",
            "Wkts": "5"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/940809/we-re-such-jolly-good-fellows",
        "http://www.espncricinfo.com/magazine/content/story/600342.html",
        "http://www.espncricinfo.com/india-v-england-2012/content/story/593771.html",
        "http://www.espncricinfo.com/magazine/content/story/422934.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154610.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/052004/052110.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/052004/052110.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/052004/052110.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nJanuary 8, 1923, Ardsley, Yorkshire "
        ],
        "Bowling style": [
            "Slow left-arm orthodox, Slow left-arm chinaman"
        ],
        "Died": [
            "July 23, 1985, Hatfield, Doncaster, Yorkshire (aged 62 years 196 days) "
        ],
        "Full name": [
            "John Henry Wardle"
        ],
        "Major teams": [
            "England,",
            "Cambridgeshire,",
            "Yorkshire"
        ]
    },
    "profile_info": [
        "\nJohnny Wardle was one of the most skilful left-arm spinners the game has seen. Though he usually bowled in the orthodox tradition, as preferred by Yorkshire, he sometimes bowled wrist-spinners (with a bemusing googly - the `chinaman'), especially when on overseas duty for England. It was his misfortune that his career coincided with that of the more aggressive Tony Lock of Surrey, who was preferred to him for many Tests during the 1950s. \n",
        "Still, Wardle played 28 times for England and took 102 wickets at only 20.39, five times taking five wickets in an innings. His best figures were 7 for 36 (12 for 89 in the match) at Cape Town during the tied 1956-57 series in South Africa, when he took 26 wickets in four Tests at a mere 13.81, missing the last Test through a cartilage operation. On the tour he took 90 wickets at a dozen runs apiece, and caused Jim Laker to remark some years later that Wardle had produced the best displays of spin bowling he had ever seen.",
        null,
        "Born in Ardsley, near Barnsley, on January 8, 1923, Wardle began his working life as a colliery fitter, working from 6 am to 2.30 pm so that he had plenty of time for cricket. Yorkshire signed him from league cricket just after the war, and within a short period he was touring West Indies with MCC, playing in the Trinidad Test, but being given only three overs by Gubby Allen in an innings which reached 497. His reputation with Yorkshire was soon soundly established, with 148 wickets in 1948 and 100 or more in each of the following nine seasons, with 172 in 1950 his best. But his Test calls were few, with a wide range of English spinners in contention. At the top level he did at least show his steadiness, as with figures of 49-21-77-1 against South Africa at Trent Bridge in 1951. He played in three of the Tests against Australia in 1953, toying with the opposition in the closing stages at Old Trafford, taking 4 for 7 as the tourists slipped to 35 for 8. His two Tests that winter in the Caribbean brought scant success, though his 66 in the final Test was of vast importance in setting up a series-saving victory. Here Wardle helped his captain, Len Hutton (205), put on 105 for the seventh wicket.",
        null,
        "The next time he faced the Australians, in the Lord's Test of 1956, he bagged a pair. But that winter he went off to his triumphs in South Africa, where he carved his name resoundingly into Test annals at last. He had been part of an England side which never lost a series from 1951 until 1958-59. Wardle's presence on that Australian tour, when England went down four-nil, may well have made a critical difference.",
        "He took 1537 wickets for Yorkshire at 17.67, placing himself eighth in the county's honour roll. Of all his many wonderful returns, the 9 for 25 he took on a rain-affected pitch in the Roses match at Old Trafford in 1954 was the best statistically. Earlier that season he had taken 9 for 48 (with catches missed) against Sussex at Hull, finishing with 16 for 112 in the match. Many a batsman must have had nightmares before going out to face Wardle, Trueman, Appleyard and Co.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}