{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "1",
            "6s": "4",
            "Ave": "24.30",
            "Ct": "3",
            "HS": "73*",
            "Inns": "12",
            "Mat": "9",
            "NO": "2",
            "Runs": "243",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "4",
            "50": "65",
            "6s": "",
            "Ave": "18.30",
            "Ct": "345",
            "HS": "149",
            "Inns": "989",
            "Mat": "640",
            "NO": "121",
            "Runs": "15891",
            "St": "0"
        },
        {
            "": "List A",
            "100": "0",
            "50": "0",
            "6s": "",
            "Ave": "10.51",
            "Ct": "26",
            "HS": "36",
            "Inns": "68",
            "Mat": "93",
            "NO": "21",
            "Runs": "494",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "56.38",
            "BBI": "3/36",
            "BBM": "3/60",
            "Balls": "2162",
            "Econ": "2.03",
            "Inns": "15",
            "Mat": "9",
            "Runs": "733",
            "SR": "166.3",
            "Wkts": "13"
        },
        {
            "": "First-class",
            "10": "8",
            "4w": "",
            "5w": "75",
            "Ave": "23.18",
            "BBI": "8/59",
            "BBM": "",
            "Balls": "113417",
            "Econ": "2.21",
            "Inns": "",
            "Mat": "640",
            "Runs": "41904",
            "SR": "62.7",
            "Wkts": "1807"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "1",
            "5w": "0",
            "Ave": "29.14",
            "BBI": "4/12",
            "BBM": "4/12",
            "Balls": "3612",
            "Econ": "3.77",
            "Inns": "",
            "Mat": "93",
            "Runs": "2273",
            "SR": "46.3",
            "Wkts": "78"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/918335.html",
        "http://www.espncricinfo.com/ci/content/story/719047.html"
    ],
    "latest_photos": [],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMay 14, 1933, Southmead, Bristol "
        ],
        "Bowling style": [
            "Right-arm offbreak"
        ],
        "Died": [
            "February 13, 2014 (aged 80 years 275 days) "
        ],
        "Full name": [
            "John Brian Mortimore"
        ],
        "Major teams": [
            "England,",
            "Gloucestershire"
        ]
    },
    "profile_info": [
        "\nJohn Mortimore was a lean and stately offspinner, who was a staple of the Gloucestershire side for a quarter of a century and also won nine England caps at the height of his prowess.  \n",
        "If he never entirely convinced at Test level, where he averaged 24 with the bat and 58 with the ball, his partnership with his fellow offspinner David Allen at Gloucestershire was acknowledged as one of the most respected double acts on the county circuit. Mortimore spun the ball less sharply than Allen but he possessed cunning and accuracy.",
        "Mortimore's career highlight for Gloucestershire, his native county, was taking four wickets in five balls against Lancashire at the Cheltenham Festival in 1962. His first-class career spanned 26 seasons from 1950 to 1975 and he also captained Gloucester between 1965 and 1967. He took 100 or more wickets in a season three times, scored 1,000 runs or more in a season five times, and in 1959, 1963 and 1964 he did both in the one season: the coveted double.",
        "But it was his part in one of county cricket's great folklore moments that will be remembered as fondly as anything. He was also bowling when Lancashire's David Hughes launched his famous twilight assault - 24 off an over - in the Gillette Cup semi-final of 1971 at Old Trafford. It was so dark that Hughes had wondered before his assault whether the light was adequate. \"You can see the moon,\" responded the umpire Arthur Jepson. \"How far do you want to see?\"",
        "The first of Mortimore's nine Test appearances came when he was sent out as a replacement for Peter May's struggling team in the 1958-59 Ashes series. He topped the batting averages, somewhat freakishly, by virtue of being dismissed only once in the series. It was a productive time for England offspinners and the presence of the likes of Raymond Illingworth, Fred Titmus and Allen, all of whom were stronger batsmen, meant that his call ups were irregular.",
        "Mortimore toured India in 1963-64, playing three Tests in a notoriously slow-scoring series. In the fifth Test at Kanpur, on the deadest of surfaces, he endured a marathon stint of 72 overs and returned remarkable figures of 1 for 67. ",
        "He had the misfortune to be brought into the England side on another batsman-friendly surface when England met Auastralia in the Old Trafford Test in 1964. Only 18 wickets fell for 1271 runs and Mortimore, among those wicketless, never played Test cricket again.",
        "His highest score came against Nottinghamshire at Nottingham in 1963, when he scored 149, \"a brilliant maiden Championship century by Mortimore in two hours twenty minutes\", according to Wisden.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}