{
    "batting_averages": [
        {
            "": "Tests",
            "100": "1",
            "50": "6",
            "6s": "0",
            "Ave": "29.15",
            "Ct": "9",
            "HS": "119",
            "Inns": "35",
            "Mat": "23",
            "NO": "2",
            "Runs": "962",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "26",
            "50": "107",
            "6s": "",
            "Ave": "27.90",
            "Ct": "365",
            "HS": "210*",
            "Inns": "1035",
            "Mat": "651",
            "NO": "156",
            "Runs": "24531",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "2",
            "5w": "1",
            "Ave": "33.02",
            "BBI": "5/46",
            "BBM": "5/46",
            "Balls": "2812",
            "Econ": "3.17",
            "Inns": "37",
            "Mat": "23",
            "Runs": "1486",
            "SR": "62.4",
            "Wkts": "45"
        },
        {
            "": "First-class",
            "10": "23",
            "4w": "",
            "5w": "113",
            "Ave": "23.32",
            "BBI": "9/47",
            "BBM": "",
            "Balls": "83528",
            "Econ": "3.17",
            "Inns": "",
            "Mat": "651",
            "Runs": "44160",
            "SR": "44.1",
            "Wkts": "1893"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/1062861/initial-fascination",
        "http://www.espncricinfo.com/magazine/content/story/571939.html",
        "http://www.espncricinfo.com/magazine/content/story/275637.html",
        "http://www.espncricinfo.com/magazine/content/story/214145.html",
        "http://www.espncricinfo.com/wcm/content/story/144310.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=11927"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/031998/001473.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/031998/001473.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/031998/001473.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nSeptember 3, 1882, Clapton, London "
        ],
        "Bowling style": [
            "Right-arm fast-medium"
        ],
        "Died": [
            "December 19, 1930, seven miles south of the Laeso Trindel Lightship, Denmark (aged 48 years 107 days) "
        ],
        "Full name": [
            "John William Henry Tyler Douglas"
        ],
        "Major teams": [
            "England,",
            "Essex,",
            "London County"
        ]
    },
    "profile_info": [
        "\nJohnny Douglas was said to be the fittest cricketer of his day. The body was taut and muscular. He would not have been remotely out of place in a 21st-century dressing room where a player's physical condition is too easily a fetish rather than a healthy consideration. Douglas looked more like a boxer than a Test allrounder. And that was what he was, of course. Those who yawned at his unwaveringly wearisome batting approach argued with some validity that he was worth watching only when he stepped into the ring. \n",
        "That was a cutting comment on someone who captained his country at cricket and led it to success against the Australians before the First World War. Yet he was never a batsman to ignite a schoolboy's imagination or stir a wing-collared Edwardian scribe to flights of purple prose.",
        "One of the endless fascinations of cricket is the extent of dichotomy among its practitioners. It is the sport in which the brawny blacksmith, romantic icon of rural rampage, does not bowl fast at all but instead pedantically blocks out the last half-hour to earn an honourable draw. It is the bespectacled accountant, pallid of features and delicate of forearm, who crashes four boundaries in an over. In Douglas's case he batted as if losing a competitive stroll with a tortoise - and flung his fists in ferocious combinations of punches to excite black-tied audiences, baying for blood after port, at the National Sporting Club.",
        "He came from a family steeped in the noble art. His father, Johnny H Douglas, was a famous personality in the annals of boxing, a familiar figure at the old Covent Garden Club. Brother `Pickles' Douglas was a renowned referee, handling title fights. At Felsted School Johnny's own boxing prowess was a matter of approving debate among his fellow fifth-formers. There was never any likelihood of him fighting for money but he boxed proudly for the family name.",
        "In the ringside seats his family shouted encouragement and liked the way, with a pair of boxing gloves, he could look after himself. The dour countenance that he was apt to convey at the crease was a good deal less evident when he was trading blows, usually with some style. He became the best amateur middleweight in England and was crowned Olympic champion in 1908 when he beat Reginald `Snowy' Baker on points. The fight was so close that a popular myth sprang up (and remains to this day) that the judges could reach no decision and the gold was finally awarded by the referee - Douglas's father. But Douglas senior was not refereeing at all. He was ringside only so that he could present the medals in his capacity as president of the Amateur Boxing Association.",
        "JWHT Douglas, to allow him his full flourish of initials (the printers gave him the works on the boxing billboards), was also a referee. They used to say he was a martinet as he danced round the two fighters. He was always sparing with his smiles; in the ring, whether boxing or adjudicating, he remained grim-faced, his sleek middle-parting hair unruffled. So he needed to be when handling two adversaries not averse to villainy on the referee's blind side. In 1914 he had whispered a few cautions to George `Digger' Stanley, once a world bantamweight champion and well known for a range of dark-alley tricks. By the 13th round Douglas had seen enough and disqualified Digger. The defeated boxer's noisy mates, many from the gipsy community from where he came, turned on the referee. But that did not bother Douglas. He played and judged his sport by the letter.",
        "That was why he once rounded on Wally Hammond when captaining an Essex game against Gloucestershire. He and his team-mates were convinced that the `prince', as Hammond was known in the West Country, was caught in the covers by Laurie Eastman off a ball from the slow left-armer Joe Hipkin. Douglas led the protests when Hammond did not walk. The umpire, caught in a mid-afternoon reverie and uncertain what had happened, spluttered that it had been a bump-ball.",
        "Douglas was seething. At the close of play he went into the Gloucestershire dressing room. He had already offered a few choice words of anger at Wally on the pitch. Now he demanded to know where he was. Reg Sinfield, who was present, recounted with a chuckle that Hammond remained out of sight behind the door. Next morning, when Essex were batting and Douglas was at the crease, Hammond pointedly asked for a bowl, a request captain Bev Lyon heard less and less in those days. \"He went on and hurled them down faster than I'd ever seen from him before,\" said Sinfield. \"He left poor old Johnny black and blue and I felt pretty sorry for him. Yet what courage.\"",
        "The boxer's pluck was rarely far away. It made up for a somewhat saturnine character and no natural or easy affinity with the players. They still knew he would battle for them, not wantonly prepared to give his wicket away or be needlessly generous to the other side. The competitive aspect to his play was equally apparent in his not insignificant soccer career, during which he won an amateur international cap.",
        "But his cricket, whatever the groans about his painfully limited batting repertoire, should not be disregarded. He played in 23 Tests and, with SF Barnes gobbling up the wickets, he led England to an Ashes triumph in 1911-12, having taken over the captaincy when Plum Warner was ill. He played for Essex from 1901 to 1928, scoring 24,531 runs and 26 hundreds. His bowling, with its lateral movement, brought 1,893 wickets. The boxer's sturdy fists held on to 365 catches. The pundits of the day went off his Test captaincy after the 1914-18 war and the records appear to bear that out. But he achieved the season double - 100 wickets and 1,000 runs - five times.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}