{
    "batting_averages": [
        {
            "": "Tests",
            "100": "1",
            "50": "2",
            "6s": "0",
            "Ave": "18.11",
            "Ct": "12",
            "HS": "121",
            "Inns": "50",
            "Mat": "33",
            "NO": "5",
            "Runs": "815",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "10",
            "50": "58",
            "6s": "",
            "Ave": "18.27",
            "Ct": "258",
            "HS": "186",
            "Inns": "826",
            "Mat": "535",
            "NO": "55",
            "Runs": "14092",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "4",
            "4w": "4",
            "5w": "9",
            "Ave": "17.75",
            "BBI": "8/11",
            "BBM": "15/28",
            "Balls": "5332",
            "Econ": "2.35",
            "Inns": "49",
            "Mat": "33",
            "Runs": "2095",
            "SR": "45.1",
            "Wkts": "118"
        },
        {
            "": "First-class",
            "10": "52",
            "4w": "",
            "5w": "200",
            "Ave": "15.95",
            "BBI": "10/55",
            "BBM": "",
            "Balls": "100144",
            "Econ": "2.12",
            "Inns": "",
            "Mat": "535",
            "Runs": "35430",
            "SR": "45.0",
            "Wkts": "2221"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/blogs/content/story/684257.html",
        "http://www.espncricinfo.com/wisdencricketer/content/story/209163.html",
        "http://www.espncricinfo.com/ci/content/story/138732.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155759.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154830.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/032004/050943.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/032004/050943.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nOctober 3, 1862, Sutton-in-Ashfield, Nottinghamshire "
        ],
        "Bowling style": [
            "Slow left-arm orthodox"
        ],
        "Died": [
            "January 11, 1902, Heald Green, Cheadle, Cheshire (aged 39 years 100 days) "
        ],
        "Full name": [
            "John Briggs"
        ],
        "Major teams": [
            "England,",
            "Lancashire"
        ],
        "Nickname": [
            "Boy"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        "Johnny Briggs died on January 11. The last reports as to the condition of Briggs's health had been so discouraging that the news of his death did not cause much surprise. Though he rallied so wonderfully from his seizure at Leeds, during the Test match in 1899, as to bowl with nearly all his old skill and success throughout the season of 1900, it was known that his ailment -- a form of epilepsy -- admitted of no permanent cure, and was liable to recur at any time. He had another attack sooner than had been expected; was compelled to go back to Cheadle Asylum; and took no part in the cricket of 1901. Five or six weeks before his death it was announced that he had again rallied after a serious relapse, but this time the improvement was of very brief duration. Briggs had a long career, but at the time of his death he was only a little over thirty-nine. Like so many other famous professional cricketers, he was a  Nottingham man, being born at Sutton-in-Ashfield, on October 3rd, 1862. While still a child, however, he went to live in Lancashire, and all his cricket was learnt in the county for which, during more than twenty years, he did such brilliant work. He must have shown great promise while very young, as he was given a trial in the Lancashire eleven before he was seventeen. He played in five matches for the county in 1879, and though he met with little success his aptitude for the game was so obvious that no doubt was felt as to his future. In those early days he was played chiefly for his fielding, his quickness and energy making him from the first a special favourite with the crowds at Old Trafford. The popularity that he thus gained as a lad remained with him to the end, and wherever he went the public took the keenest interest in his doings. For two or three seasons he was not much more than a splendid field, but from 1883 his batting rapidly improved, and a little later, without much warning, he blossomed out as one of the great slow bowlers of his day. In 1885 he headed the bowling averages for Lancashire, with seventy-nine wickets for 10½ runs each, but, though this was a very fine record, his fame as a bowler really dated from the England and  Australia match, at Lord's, in 1886 -- the memorable game in which Shrewsbury played his innings of 164. The opening day's cricket was interfered with by rain, and the England eleven, who had won the toss, did not finish their innings till the second day, their total being 353. When the  Australians went in against this formidable number, Jones and Scott scored so freely that an even match seemed in prospect. Suddenly, however, the character of the cricket underwent a complete change. Mr. A. G. Steel, who captained England, put Briggs on as first change, and the Australians, though their score stood at 45 when the first wicket went down, were all out all for 121, Briggs bowling 34 overs, 22 maidens, for 29 runs and 5 wickets. His success caused great surprise, as he had played for  England a fortnight before at Manchester without being called upon to bowl at all. When the Australians followed on, he took six wickets for 45 runs, and England won the match in a single innings. Thenceforward, Briggs's reputation as a left-handed slow bowler was firmly established and, as everyone knows, he remained in the front rank, with, of course, the fluctuations of fortune to which all cricketers are subject, till his unhappy seizure at Leeds in 1899.",
        "He jumped to the top of the tree at a very opportune moment in 1886 -- Peate being then almost done with -- and for many seasons his only rival in his own particular style was Peel. There is no need to go into details of his work year by year, but it is interesting to note that, according to the figures given in Bat v. Ball, he took in first-class matches, from 1885 to 1899 inclusive, 2034 wickets for less than 16 runs each. He had a bad season in 1898, but in 1900, after his first illness, he came out again in such form that 127 wickets fell to him for something over 17½ runs each. During all his years of success Briggs was much more than a mere bowler. He was always a dangerous bat, likely at any time to get his fifty runs, and in the field he retained all the energy and nearly all the speed of his young days. Though the greater part of this work was done for Lancashire, he was in the truest sense of the word a representative cricketer, being picked over and over again for England and the Players, and being nearly as well known on Australian grounds as in this country. He paid six visits to the Colonies, going out with Shaw and Shrewbury's teams in 1884-85, 1886-87, and 1887-88; with Lord Sheffield's team in 1891-92, and with Mr.  Stoddart's elevens in  1894-95, and 1897-98. As it happened, he went once too often, proving a sad failure for Stoddart's second team. In the other trips, however, he did himself full justice. Among all his Australian experiences the most remarkable was the famous 10 runs win at Sydney, in December, 1894, when Australia suffered defeat after playing a first innings of 586. The Australians only had to get 177 in the last innings, and at the close of the fifth day they had scored 113, with two men out. After drenching rain in the night, however, Peel and Briggs secured the eight outstanding wickets for 53 runs, gaining for  Stoddart's side perhaps the most sensational victory in the history of cricket. Briggs, as a slow bowler, had nearly every good quality. His beautifully easy action enabled him to stand any amount of work; he had plenty of spin, and no one was more skilful in tempting batsmen to hit on the off-side. For a few seasons he bowled a particularly good fast ball, but in this respect he fell off in later years."
    ],
    "recent_matches": [
        {},
        {}
    ]
}