{
    "batting_averages": [
        {
            "": "Tests",
            "100": "4",
            "50": "9",
            "6s": "3",
            "Ave": "30.75",
            "Ct": "16",
            "HS": "138",
            "Inns": "55",
            "Mat": "31",
            "NO": "1",
            "Runs": "1661",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "86",
            "50": "193",
            "6s": "",
            "Ave": "40.66",
            "Ct": "359",
            "HS": "295*",
            "Inns": "994",
            "Mat": "608",
            "NO": "62",
            "Runs": "37897",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "31",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "70.33",
            "BBI": "1/4",
            "BBM": "",
            "Balls": "296",
            "Econ": "4.27",
            "Inns": "",
            "Mat": "608",
            "Runs": "211",
            "SR": "98.6",
            "Wkts": "3"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/248617.html",
        "http://www.espncricinfo.com/cricketer/content/story/261300.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155647.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154794.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/031998/001473.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/031998/001473.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/031998/001473.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nNovember 22, 1873, Roe Green, Worsley, Lancashire "
        ],
        "Died": [
            "November 27, 1930, Monton, Salford, Lancashire (aged 57 years 5 days) "
        ],
        "Full name": [
            "John Thomas Tyldesley"
        ],
        "Major teams": [
            "England,",
            "Lancashire"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        null,
        "Altogether in the course of his brilliant career he scored 37,803 runs in first-class matches with an average of nearly 41, and made eighty-six separate centuries. He played frequently in  Gentlemen v. Players matches and in 1901 made 140 at  Lord's. He also took a leading part in Test match cricket between 1899 and 1909, appearing for England in sixteen games in this country and going out to Australia with A. C. MacLaren's team in 1901-02 and with the M.C.C.'s side two years later. In England he made three hundreds against  Australia, scoring 138 at Birmingham in 1902 (after the side had started in disastrous fashion), 100 at Leeds in  1905, and 112 not out at The Oval in the latter year. In all he scored 1,661 runs in Test Matches with an average of 30. Tyldesley was a member of the team Lord Hawke took out to South Africa in the winter of 1898-99. He scored 742 runs during the tour with an average of 32. Among his innings was one of 112 in a Test match at Cape Town. There were few batsmen more attractive to watch than John Tyldesley. He was exceptionally quick on his feet and so always appeared to have plenty of time in which to make his strokes. Essentially a batsman of enterprise, when he went forward to the ball it was nearly always to hit. He also possessed a very strong defence and had at his command practically all the strokes in the game. His ability to adapt himself to circumstances was emphasised in a Test match at The Oval in 1905, when Armstrong, bowling well outside the leg-stump with an offbreak, reduced to impotence a number of batsmen, but not Tyldesley, who drew back and cut him. One of the best of outfieldsmen, he was very fast, picked the ball up cleanly, and had a very accurate return, in addition to being a very sure catch.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}