{
    "batting_averages": [
        {
            "": "Tests",
            "100": "5",
            "4s": "413",
            "50": "19",
            "6s": "22",
            "Ave": "39.24",
            "BF": "6348",
            "Ct": "150",
            "HS": "167*",
            "Inns": "96",
            "Mat": "56",
            "NO": "6",
            "Runs": "3532",
            "SR": "55.63",
            "St": "8"
        },
        {
            "": "ODIs",
            "100": "6",
            "4s": "212",
            "50": "7",
            "6s": "41",
            "Ave": "50.30",
            "BF": "1863",
            "Ct": "23",
            "HS": "141*",
            "Inns": "47",
            "Mat": "51",
            "NO": "8",
            "Runs": "1962",
            "SR": "105.31",
            "St": "2"
        },
        {
            "": "T20Is",
            "100": "0",
            "4s": "33",
            "50": "2",
            "6s": "15",
            "Ave": "24.75",
            "BF": "315",
            "Ct": "23",
            "HS": "60*",
            "Inns": "22",
            "Mat": "27",
            "NO": "6",
            "Runs": "396",
            "SR": "125.71",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "23",
            "4s": "",
            "50": "60",
            "6s": "",
            "Ave": "46.15",
            "BF": "",
            "Ct": "436",
            "HS": "246",
            "Inns": "272",
            "Mat": "167",
            "NO": "32",
            "Runs": "11078",
            "SR": "",
            "St": "19"
        },
        {
            "": "List A",
            "100": "9",
            "4s": "370",
            "50": "17",
            "6s": "100",
            "Ave": "41.28",
            "BF": "3739",
            "Ct": "73",
            "HS": "174",
            "Inns": "108",
            "Mat": "118",
            "NO": "14",
            "Runs": "3881",
            "SR": "103.79",
            "St": "8"
        },
        {
            "": "T20s",
            "100": "1",
            "4s": "116",
            "50": "6",
            "6s": "64",
            "Ave": "24.61",
            "BF": "1304",
            "Ct": "56",
            "HS": "102*",
            "Inns": "84",
            "Mat": "96",
            "NO": "17",
            "Runs": "1649",
            "SR": "126.45",
            "St": "10"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "56",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "ODIs",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "51",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "T20Is",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "27",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "6",
            "Econ": "1.00",
            "Inns": "1",
            "Mat": "167",
            "Runs": "1",
            "SR": "-",
            "Wkts": "0"
        },
        {
            "": "List A",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "118",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "T20s",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "96",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/1155383.html",
        "http://www.espncricinfo.com/ci/content/story/1155053.html",
        "http://www.espncricinfo.com/ci/content/story/1154053.html",
        "http://www.espncricinfo.com/ci/content/story/1153496.html",
        "http://www.espncricinfo.com/blogs/content/story/1153338.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=297433"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/279200/279265.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/279200/279265.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/279200/279265.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nSeptember 26, 1989, Bradford, Yorkshire "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Current age": [
            "28 years 326 days"
        ],
        "Fielding position": [
            "Wicketkeeper"
        ],
        "Full name": [
            "Jonathan Marc Bairstow"
        ],
        "Major teams": [
            "England,",
            "England Lions,",
            "England Performance Programme,",
            "Peshawar Zalmi,",
            "Yorkshire,",
            "Yorkshire 2nd XI"
        ],
        "Playing role": [
            "Middle-order batsman"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nJonny Bairstow, the son of the former England wicketkeeper David Bairstow, is a combative wicketkeeper-batsman who has become a cricketer to be reckoned with in England's middle order. The journey was far from easy for Bairstow, especially with Jos Buttler in contention for the gloves, but prolific run-making for Yorkshire eventually made a case that England's selectors could not ignore. Galvanised by his selection, runs flowed. \n",
        "Bairstow's wicketkeeping has rarely met with universal approval and, much to his chagrin, the debate as occasional chances have been spurned about whether he might be better playing as a specialist batsman has never been silenced. But from the moment that he delivered an emotional maiden Test century in Cape Town, where his father has strong off-season links, and the aggressive batting that Yorkshire prized so highly has become a regular feature of the England scene, with only regular appearances in T20 eluding him.",
        "He has had to fight against a tendency to play across the line and, to that end, he stands tall, bat held aloft, adding to his pugnacious image. Driven and independently minded, he is very much his own man. Intensive work with Bruce French, England's wicketkeeping coach, has also made his keeping more secure.",
        "He was a talented all-round sportsman at an early age, even having trials with Leeds United as a right back. But it was cricket which soon dominated. An early starter with Yorkshire's Under-15s, he was named Young Wisden Schools Cricketer of the Year in 2007, having already played for Yorkshire's Second XI and their Academy side and represented England Under-17. In October 2008, he followed in his father's footsteps by signing a full-time contract with Yorkshire.  He was eight-years-old when his father took his own life. Merely to play the game, and for the same county was courageous enough.",
        "He made an impressive first-class debut against Somerset in June 2009, cracking 82 in his second innings and soon secured his place in the first XI and further honours followed when he was picked up by England's Performance Programme and included in the England Lions successful tour of the Caribbean in January 2011.",
        "By now Yorkshire's first-choice keeper, he registered his maiden first-class hundred against Nottinghamshire at Trent Bridge in May of that year. Having previously passed fifty 17 times in 34 first-class matches without reaching three figures, just to emphasise his breakthrough, he made it a double. During his brilliant attacking innings, he was joined by England's recently retired opening bowler Ryan Sidebottom, in a record ninth wicket partnership for Yorkshire against Nottinghamshire (which had stood since 1899) of 151. Bairstow and Sidebottom were sons of two of Yorkshire's best-loved former players, David Bairstow and Arnie Sidebottom. The passing of talent between the generations could not have been more satisfactorily captured.",
        "Many suspected that, long term, Bairstow would become a specialist batsman and his debut innings in one-day internationals backed up that theory as he hit an unbeaten 41 off 21 balls against India at Cardiff before a tough tour of India showed the realities of international cricket. However, further development followed with a match-winning T20 innings against Pakistan in the UAE and after a strong start to the 2012 season he was handed a call-up to the Test squad to face West Indies.",
        "It was not a happy series for Bairstow, whose problems against some hostile short bowling from Kemar Roach gained much media attention, and after a modest return of 38 runs at 12.66 he was left out of the opening Test of the South Africa series as England went with Ravi Bopara. Confirmation that he had slipped back in the selectors' thinking came when Bopara withdrew from the second Test for personal reasons and James Taylor was preferred.",
        "But after Kevin Pietersen was dropped in extraordinary circumstances for the third Test at Lord's, another opportunity arose for Bairstow to which he responded magnificently. Confidence bolstered by a century for England Lions against Australia A, he led an England fightback from 54 for 4 in their first innings on day two with a brilliant 95, emerging from a peppering with short deliveries to play some fluent attacking shots in an innings former England captain Michael Vaughan said would have been the finest maiden Test century he had witnessed had his fellow Yorkshireman not been bowled by Morne Morkel.",
        "His increasing international involvement restricted his appearances for Yorkshire, although he did find time to hit 182 - his second biggest first-class score - to set up a crushing win over Leicestershire at Scarborough in the Championship and a match-winning 68 not out against Sussex in the semi-finals of the FLt20.",
        "Bairstow retained his place for England's winter schedule, beginning with the World Twenty20 in Sri Lanka. He was unable to make a significant contribution and his participation in the India Test series was also limited before he was granted leave to return home because of a family illness, missing the subsequent ODI series.",
        "Thereafter his bit-part status congealed - he lost his spot in the T20 team following the New Zealand tour and, after returning to the Test team during the Ashes as England dropped Nick Compton and moved Joe Root up the order, he was abruptly left out at The Oval. He spent much of the summer running 12th man errands at a crucial stage in his development. A squad member for the return tour of Australia, he played in the last two Tests, replacing the out-of-form Matt Prior, but did not unearth the performances to promote his worth as Prior's long-term successor and had to buckle down to the county circuit the following summer.",
        "That 2015 season promised to be the making of him as he struck 1108 first-class runs at 92.33, allowed by Yorkshire to play as he saw fit. Nothing was more emphatic than his 366-run alliance with Tim Bresnan at Chester-le-Street, both players making carer-bests, Yorkshire's fifth highest stand of all time. England were receptive. A combative 83 not out at Chester-le-Street after a late summons settled a weather-hit ODI against New Zealand in England's favour and the faltering form of Buttler brought a Test recall against Australia.",
        "It was Cape Town, though, where Bairstow really broke through, as the summer of 2016 testified. Bairstow's second Test ton was reserved for his home crowd against Sri Lanka: 140, batting at No. 7, out of 298. On a challenging surface, he played with a certainty not given to others. England's top order was repeatedly found wanting in Test cricket, but the belligerence of Bairstow and co down the order constantly dug them out of a hole, and another hundred at Lord's followed.",
        null
    ],
    "recent_matches": [
        {
            "Bat & Bowl": "1c/0s, 93, 1c/0s",
            "Ground": "Lord's",
            "Match Date": "9 Aug 2018",
            "Opposition": "v India",
            "Scorecard": "Test # 2315",
            "Team": "England"
        },
        {
            "Bat & Bowl": "70, 0c/0s, 28, 5c/0s",
            "Ground": "Birmingham",
            "Match Date": "1 Aug 2018",
            "Opposition": "v India",
            "Scorecard": "Test # 2314",
            "Team": "England"
        },
        {
            "Bat & Bowl": "0, 2c/0s, 82, 3c/0s",
            "Ground": "Manchester",
            "Match Date": "22 Jul 2018",
            "Opposition": "v Lancashire",
            "Scorecard": "FC",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "30",
            "Ground": "Leeds",
            "Match Date": "17 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "ODI # 4018",
            "Team": "England"
        },
        {
            "Bat & Bowl": "38",
            "Ground": "Lord's",
            "Match Date": "14 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "ODI # 4016",
            "Team": "England"
        },
        {
            "Bat & Bowl": "38",
            "Ground": "Nottingham",
            "Match Date": "12 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "ODI # 4014",
            "Team": "England"
        },
        {
            "Bat & Bowl": "25",
            "Ground": "Bristol",
            "Match Date": "8 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "T20I # 690",
            "Team": "England"
        },
        {
            "Bat & Bowl": "28",
            "Ground": "Cardiff",
            "Match Date": "6 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "T20I # 688",
            "Team": "England"
        },
        {
            "Bat & Bowl": "0",
            "Ground": "Manchester",
            "Match Date": "3 Jul 2018",
            "Opposition": "v India",
            "Scorecard": "T20I # 684",
            "Team": "England"
        },
        {
            "Bat & Bowl": "14*",
            "Ground": "Birmingham",
            "Match Date": "27 Jun 2018",
            "Opposition": "v Australia",
            "Scorecard": "T20I # 679",
            "Team": "England"
        }
    ]
}