{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "5",
            "50": "0",
            "6s": "0",
            "Ave": "46.00",
            "BF": "216",
            "Ct": "0",
            "HS": "36",
            "Inns": "3",
            "Mat": "2",
            "NO": "2",
            "Runs": "46",
            "SR": "21.29",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "34",
            "4s": "",
            "50": "142",
            "6s": "",
            "Ave": "29.92",
            "BF": "",
            "Ct": "240",
            "HS": "202",
            "Inns": "920",
            "Mat": "547",
            "NO": "79",
            "Runs": "25171",
            "SR": "",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "2",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "3",
            "4w": "",
            "5w": "27",
            "Ave": "28.51",
            "BBI": "8/68",
            "BBM": "",
            "Balls": "39309",
            "Econ": "2.98",
            "Inns": "",
            "Mat": "547",
            "Runs": "19532",
            "SR": "57.3",
            "Wkts": "685"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdencricketer/content/story/230229.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155705.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154772.html"
    ],
    "latest_photos": [],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMay 15, 1875, Willingdon, Sussex "
        ],
        "Bowling style": [
            "Legbreak"
        ],
        "Died": [
            "April 25, 1946, Aldrington, Hove, Sussex (aged 70 years 345 days) "
        ],
        "Full name": [
            "Joseph Vine"
        ],
        "Major teams": [
            "England,",
            "London County,",
            "Sussex"
        ],
        "Other": [
            "Coach"
        ]
    },
    "profile_info": [
        null,
        "Joe Vine might have been more prominent in representative cricket but for the role he usually undertook of subduing himself to the needs of a steady batsman as partner to C. B. Fry and the still more brilliant K. S. Ranjitsinhji. How well he and Fry succeeded as an opening pair is proved conclusively by their putting up three figures thirty-three times. In 1901 Vine scored 1,190 runs and took 113 wickets, the first double done for  Sussex.",
        "Born on May 15, 1875, he ripened as a cricketer rather slowly, and though good in every sense from his start in first-class cricket at 21, he did not earn the highest honours until 1911, when he toured Australia with the team, captained by J. W. H. T. Douglas, which won four of the Test matches. Vine played in two of these, and in the fifth contest at Sydney he and Frank Woolley set up a seventh wicket record for England against Australia by making 143. Vine, number 8 in the batting order, claimed only a modest 36; Woolley, who went in number 7, took out his bat for 133, his first century against Australia.",
        "Originally a forcing batsman, Vine curbed his natural instincts while in company with brilliant hitters, but as late as 1920 he gave evidence of hitting powers in his biggest innings by scoring 202 in five hours against Northamptonshire at Hastings. This, compared with 55 not out and 57 for which he batted over seven hours in 1901 at Hove, conveys a correct idea of his versatility. Perhaps his best bowling performance was in that same season of his special all-round ability when, at Trent Bridge, he opened the attack and took fifteen wickets for 161 runs.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}