{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "4.83",
            "Ct": "1",
            "HS": "20",
            "Inns": "17",
            "Mat": "15",
            "NO": "5",
            "Runs": "58",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "2",
            "6s": "",
            "Ave": "8.32",
            "Ct": "84",
            "HS": "97*",
            "Inns": "201",
            "Mat": "168",
            "NO": "59",
            "Runs": "1182",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "1",
            "4w": "6",
            "5w": "3",
            "Ave": "28.65",
            "BBI": "6/96",
            "BBM": "10/179",
            "Balls": "3932",
            "Econ": "2.62",
            "Inns": "27",
            "Mat": "15",
            "Runs": "1719",
            "SR": "65.5",
            "Wkts": "60"
        },
        {
            "": "First-class",
            "10": "8",
            "4w": "",
            "5w": "44",
            "Ave": "21.45",
            "BBI": "8/38",
            "BBM": "",
            "Balls": "32397",
            "Econ": "2.74",
            "Inns": "",
            "Mat": "168",
            "Runs": "14805",
            "SR": "46.9",
            "Wkts": "690"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/240634.html",
        "http://www.espncricinfo.com/magazine/content/story/145124.html",
        "http://www.espncricinfo.com/magazine/content/story/137985.html",
        "http://www.espncricinfo.com/ci/content/story/128709.html",
        "http://www.espncricinfo.com/wcm/content/story/242280.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=12812"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/265400/265439.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/265400/265439.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/265400/265439.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJuly 8, 1911, Leytonstone, Essex "
        ],
        "Bowling style": [
            "Right-arm fast"
        ],
        "Died": [
            "October 20, 1941, Chipping-Warden, Oxfordshire (aged 30 years 104 days) "
        ],
        "Education": [
            "Cambridge University"
        ],
        "Full name": [
            "Kenneth Farnes"
        ],
        "Height": [
            "\n6 ft 4 in "
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Essex"
        ]
    },
    "profile_info": [
        "\nKen Farnes, the  Cambridge,  Essex and  England fast bowler, was killed during the night of October 20, when the plane in which he was pilot crashed. His death at the age of 30 came as a great shock to countless friends and the whole world of cricket.After training in Canada he desired to become a night-flying pilot, and within four weeks of his return to England he met his disastrous end. \n",
        "Discovered when 19 years of age by Mr. Percy Perrin in an Essex Club and Ground match against Gidea Park in 1930,  Kenneth Farnes took five  Kent wickets for 36 runs in his second county match and was welcome in the  Essex team whenever available. After three years in the  Cambridge Eleven, he went as a master to Worksop College, and consequently his appearances in first-class cricket were limited. His University experiences brought continuous improvement. In  1933 his work for  Cambridge showed 41 wickets at 17.39 runs apiece, and he was by far the most effective amateur bowler in the country with a record of 113 wickets at 18.38 each. In a drawn match with  Oxford seven wickets fell to him at a cost of 71 runs. His best performance that season--11 wickets for 114 runs, 7 for 21 in the  second innings--enabled  Essex to beat  Surrey by 345 runs at Southend, their first success against these opponents since  1914. In ten matches for the County,  Farnes claimed 67 wickets at an average cost of 16.07, and this form  brought him the honour of representing  England in the  first Test against  Australia in  1934. Despite his fine performance -- ten wickets for 179 runs -- England lost by 238 runs. Strangely enough, when  England won by an innings and 38 runs at  Lord's,  Farnes did not meet with any reward, Verity taking the honours.  Farnes was not called upon again in that series, but in  1938 he took most wickets in Tests against  Australia -- 17 at 34.17 each.",
        "In  1934 he was largely responsible for the first victory of  Essex over  Yorkshire since  1911 by taking 11 wickets for 131, Southend again proving a favourable ground for him. Thanks to  Farnes dismissing seven men for 59 in the final stage,  Essex brought about a great triumph by an innings and 46 runs. After a tour in West Indies knee trouble prevented  Farnes from playing in  1935, but next season, for the  Gentlemen at  Lord's, he created a sensation by bowling Gimblett, Hammond and Hardstaff in quick succession, a stump being sent flying in each case. With four men out for 33, the  Players were in danger of defeat, but, after the complete loss of Wednesday owing to rain, there was not time to reach a finish in two days. This fine work influenced the choice of  Farnes to tour Australia with the team captained by G. O. Allen in the winter of  1936. Never did he bowl better than in the last Test, when he took six wickets for 96 runs in a total of 604;  Australia won by an innings and 200 -- a result that decided the rubber.",
        " Farnes bowled well in Test trials at  Lord's. In  1938 he gave special proof of being in great form by dismissing eight  Players for 43 runs in the  first innings and three in the second for 60, so doing a lot towards the  Gentlemen winning by 133 runs--their second victory in this encounter since the last war. In the following winter he went with the England touring team to South Africa, where he was second in Test bowling to Verity. His 16 wickets cost 32.43 each, while in the whole tour 44 wickets fell to him at 27.43 a piece. He did the best bowling of the  third Test, the only one brought to a definite finish, which gave W. R. Hammond's side the rubber. With four wickets for 29,  Farnes was mainly instrumental in making  South Africa follow on, and he dismissed three men for 80 in their  second innings of 353, which left  England still 13 runs to the good after a declaration with only four men out. Paynter, 243 -- a South African record -- and Hammond, 120, were the great batsmen on that occasion; their stand realised 242.",
        " Farnes made his first appearance of the season in  1939 for the  Gentlemen, and showed his fondness for  Lord's by disposing of the last three  Players in the course of six balls. This final effort by  Farnes at headquarters recalls how well he bowled in University matches; but in  1932 he disfigured an analysis of five wickets for 98 runs by being  called 21 times. The discipline then brought to bear was effective in correcting a faulty approach to the crease. Nearly six feet five inches tall,  Farnes, taking a comparatively short and easy run, brought the ball down from a great height with the inevitable effect of sharp lift, which made him extremely difficult to time when retaining a good length. Altogether in first-class cricket  Farnes took 720 wickets at an average of 20.55 each.",
        "A very good fielder near the wicket,  Farnes reached many catches that would have been impossible for a man of medium height. He had no pretension as a batsman, but in  1936, at Taunton, hit up 97 not out in two hours, Wade helping to add 149 for the last wicket; dismissing six men in the match,  Farnes was largely responsible for  Essex winning by an innings and 66 runs. He laughed at just failing to get a century--the ambition of every batsman.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}