{
    "batting_averages": [
        {
            "": "Tests",
            "100": "20",
            "50": "35",
            "6s": "27",
            "Ave": "58.67",
            "Ct": "58",
            "HS": "256",
            "Inns": "131",
            "Mat": "82",
            "NO": "15",
            "Runs": "6806",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "76",
            "50": "170",
            "6s": "",
            "Ave": "45.63",
            "Ct": "514",
            "HS": "256",
            "Inns": "831",
            "Mat": "533",
            "NO": "136",
            "Runs": "31714",
            "St": "0"
        },
        {
            "": "List A",
            "100": "0",
            "50": "3",
            "6s": "",
            "Ave": "33.25",
            "Ct": "5",
            "HS": "70*",
            "Inns": "14",
            "Mat": "14",
            "NO": "2",
            "Runs": "399",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "44.82",
            "BBI": "3/4",
            "BBM": "5/111",
            "Balls": "2715",
            "Econ": "2.87",
            "Inns": "50",
            "Mat": "82",
            "Runs": "1300",
            "SR": "93.6",
            "Wkts": "29"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "8",
            "Ave": "32.61",
            "BBI": "7/40",
            "BBM": "",
            "Balls": "17301",
            "Econ": "3.08",
            "Inns": "",
            "Mat": "533",
            "Runs": "8905",
            "SR": "63.3",
            "Wkts": "273"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "33.00",
            "BBI": "3/41",
            "BBM": "3/41",
            "Balls": "108",
            "Econ": "7.33",
            "Inns": "",
            "Mat": "14",
            "Runs": "132",
            "SR": "27.0",
            "Wkts": "4"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/662021.html",
        "http://www.espncricinfo.com/magazine/content/story/552035.html",
        "http://www.espncricinfo.com/magazine/content/story/422353.html",
        "http://www.espncricinfo.com/england/content/story/422490.html",
        "http://www.espncricinfo.com/magazine/content/story/414769.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=9014"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/160500/160513.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/160500/160513.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/160500/160513.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nNovember 24, 1930, Reading, Berkshire "
        ],
        "Bowling style": [
            "Legbreak"
        ],
        "Died": [
            "March 14, 1981, Needham's Point, Bridgetown, Barbados (aged 50 years 110 days) "
        ],
        "Full name": [
            "Kenneth Frank Barrington"
        ],
        "Major teams": [
            "England,",
            "Surrey"
        ]
    },
    "profile_info": [
        null,
        null,
        null,
        "To my mind, the story of Ken's death is as heroic as so many of his innings. It came as a great shock in the spring of 1969 to learn that the chest pains which had led him to withdraw from a double-wicket competition in Melbourne had in fact been a heart attack. After due reflection, taking into account not only his family but the fact that, at 38, batting in Test matches, always Ken's particular forte, was not going to get easier, Ken Barrington retired. Immediately the cares of carrying England's rickety batting through the uncertain and far from satisfying sixties slipped off his shoulders, like some leaden cloak. As he took to the village greens of charity cricket and to the golf courses where his game was good enough to be successfully competitive - and therefore a source of pleasure to a man who hated to be beaten - Ken Barrington's step seemed lighter and his stature in cricket enhanced. His admirers, both far and near, began to realise just how much private effort had gone into coping with chuckers and bouncers, as well as the vagaries of form and the whims of selectors.",
        "None the less, a heart attack is a warning, a red light that never joins with amber and turns to green. Although he had managed tours to India, Pakistan and New Zealand, and indeed had had the well-deserved honour of leading the England party at the Melbourne Centenary Test, nothing in his managerial career had tested him quite like this final West Indian ordeal. As a player he had not only plundered bowlers on the great Indian sub-continent but, the son of a soldier who might well in other times have done tours in India of a different nature, he established such a good-humoured relationship there that win or lose, come triumph or disaster, the pressures of touring were easily absorbed. In Australia, where the results mattered more, his role was that of coach, so that the burdens were shared first with Doug Insole and then with Alec Bedser.",
        "He was playing that same familiar part in the West Indies. Ironically, he had not been one of the early selections, but as an old player scarred in earlier wars against Hall and Griffith, he knew better than most the perils that a new manager, Alan Smith, and an inexperienced captain, Ian Botham, were flying into as they took on the world champions with their fast bowling quartet in the increasingly stormy Caribbean. In Guyana the heavy and persistent rain meant that the practice sessions which were his charge were suspended. They had been difficult in smaller islands like Antigua and St. Vincent in the early weeks of the tour. And then he had to take the team, badly defeated in the first Test and now with their morale increasingly affected by the start of the Jackman affair, as well as their collective lack of practice and form, to the one-day beating at Berbice, while Alan Smith began to play one of his best innings with the politicians. The events of those few days deeply disturbed Barrington. He was also worried about Ann's imminent arrival if the tour was to be cancelled.",
        "But once the party arrived safely in Barbados he seemed to relax. My own last, long and treasured conversation with him was in the happy atmosphere of a Cunarder's bridge, a party in the harbour which he himself had organised. Whatever he felt, he was full of hope for the more distant future, his absolute faith in the ability of Botham and Gatting made more significant by the summer of '81. He knew there were gaps in the England side, but he was old enough in the ways of cricket to know that they are not easily filled.",
        "It was a little thing, at least in the context of that global conversation, that piled all the pressure back on to this caring man. At fielding practice it was Barrington who hit the ball that split Gooch's hand. Gooch was due to bat that day, and in fact played better than anyone - as he told me, without too much discomfort. However, Ken took it badly, as he was bound to do, but it was the way in which he said to Bernard Thomas, \"I didn't mean to hurt him,\" that in retrospect gave the party's medical superintendent the first indication that events were getting out of proportion, upsetting the nervous balance. It was that night, with the Barringtons ready for bed, that the attack struck Ken down. Ann Barrington summoned Bernard Thomas, who was next door, and he knew at once that the attack had been instantaneously fatal. Next morning, when the team stood in Ken's memory, there were many tears.",
        null,
        null,
        "It is with his career in cricket during the last ten years of his life that this eulogy is chiefly concerned. It was at Adelaide during the difficult Australian tour of 1974-75 that Barrington first began to believe that he had a contribution to make as a coach at the highest level. He was brought up in a generation which believed as an act of faith that once a cricketer had played at Test level he knew it all. How else could he have been selected? Furthermore, and this is still a more prevalent attitude than Barrington liked, a player who makes as much of a fetish about practising as Boycott is regarded as a freak. As one who had to work out his technique, to subordinate under a layer of discipline the stroke-making ability he had acquired in his early days, Barrington by the time he retired was a batsman who, if he never knew it all, was a scholar (as well as a gentleman) compared to the players he now saw trying to cope with Lillee and Thomson at their devastating best. More than once Barrington himself had had to change his approach both in style and mind, and so he was ideally suited to the task of developing younger talent and skills.",
        "Not every captain appreciates the need for such a rôle; or knows how to put such available experience to its best use. Ironically, it was on his last tour that Barrington really came to fulfil himself in this the last, and to my mind, most difficult of his cricketing lives. By that time he had mastered the art of subordinating self and position without losing respect or the power to contribute. He would get me a cup of tea, suggest something which I'd reject probably because I was tired, but then I'd do it and usually it worked. This was Ian Botham during his apprentice days as captain. To the generation that is coming to full maturity Ken Barrington had become as important as the maypole; something solid. He was the Colonel around whom a team of cricketers could revolve while playing no part in the dance himself.",
        "Like the maypole he was, too, a source of great happiness, with that rare gift of turning events into comic sketches as they happened. The rat hunt in the Ritz at Hyderabad is now part of cricketing legend. Some wretched rodent, unaware of niceties of protocol, had eaten the shoulder out of the manager's England blazer in its search for nesting materials. By the time the Colonel's army was assembled, the entire staff of the hotel and all its brushes and brooms were ready to go into action. The villain was struck but not apprehended, and after such a warning honour was seen to have been satisfied on all sides.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}