{
    "batting_averages": [
        {
            "": "Tests",
            "100": "3",
            "50": "2",
            "6s": "2",
            "Ave": "25.97",
            "Ct": "39",
            "HS": "104",
            "Inns": "41",
            "Mat": "23",
            "NO": "3",
            "Runs": "987",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "25",
            "50": "75",
            "6s": "",
            "Ave": "25.61",
            "Ct": "546",
            "HS": "257*",
            "Inns": "752",
            "Mat": "432",
            "NO": "57",
            "Runs": "17801",
            "St": "1"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "1",
            "5w": "3",
            "Ave": "38.51",
            "BBI": "8/81",
            "BBM": "9/87",
            "Balls": "3805",
            "Econ": "2.85",
            "Inns": "38",
            "Mat": "23",
            "Runs": "1810",
            "SR": "80.9",
            "Wkts": "47"
        },
        {
            "": "First-class",
            "10": "16",
            "4w": "",
            "5w": "80",
            "Ave": "27.28",
            "BBI": "9/41",
            "BBM": "",
            "Balls": "53709",
            "Econ": "3.39",
            "Inns": "",
            "Mat": "432",
            "Runs": "30398",
            "SR": "48.2",
            "Wkts": "1114"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/1087906/an-eleven-for-fielding-heaven",
        "http://www.espncricinfo.com/magazine/content/story/628233.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155502.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154795.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/052004/052470.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/052004/052470.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nOctober 18, 1875, Clewer, Berkshire "
        ],
        "Bowling style": [
            "Legbreak"
        ],
        "Died": [
            "December 23, 1955, Putney Common, London (aged 80 years 66 days) "
        ],
        "Full name": [
            "Leonard Charles Braund"
        ],
        "Major teams": [
            "England,",
            "London County,",
            "Somerset,",
            "Surrey"
        ],
        "Other": [
            "Umpire"
        ]
    },
    "profile_info": [
        null,
        "A fine bat on all kinds of pitches, a beautiful field in the slips and a clever leg-break bowler, Braund showed such form directly he appeared in Championship matches for Somerset that in 1901 he scored 1,064 runs for them, with three hundreds and an average of 35, besides taking 78 wickets. His bowling successes included ten Yorkshire wickets at Taunton, eleven Kent wickets at Catford -- five for 23 runs in the first innings -- and seven Gloucestershire wickets for 70 in the second innings at Bristol. In a memorable match at Leeds, 222 of 238 arrears were hit off by L. C. H. Palairet and Braund before a wicket fell and the Somerset total reached 630.  Palairet made 173, Braund 107 and F. A. Phillips 122. Then  Yorkshire, set to make 393, failed so completely that they were all out for 113, suffering by 279 runs their only Championship defeat of the summer. Sharing the bowling honours with B. Cranfield, Braund took four wickets for 41.",
        " Braund played for Somerset until 1920, six times registering over 1,000 runs in a season and four times taking more than 100 wickets. On three occasions, from 1901 to 1903, he achieved the cricketers' double. His bowling record in 1902 was 172 wickets for less than 20 runs each and in the following year 134 for just over 21 runs apiece, and each season he exceeded 1,400 runs. Altogether during his career he made 17,801 runs, average 25.61, took 1,101 wickets, average 27.45, and held no fewer than 508 catches.",
        "His slip-catching was phenomenal. In the  1901 Gentlemen v. Players match at Lord's he dismissed C. B. Fry with the catch of the season and in the 1902 Test match at Birmingham he disposed of Clem Hill with a long talked-about effort which helped Rhodes and George Hirst dispose of Australia for 36 -- the smallest total for which they have been dismissed in a Test. Anticipating a leg-glance by the left-handed Hill off Hirst, the fast left-arm bowler, Braund darted across from slip to the leg-side and held an amazing catch. Braund played in all that series of five Test matches. At Manchester he joined F. S. Jackson when five wickets were down for 44 and shared in a partnership of 141, of which his share was 65. Wonderful bowling by W. H. Lockwood subsequently left England on the second evening with victory in sight, but following a heavy fall of rain during the night Australia snatched a win by three runs. Had F. W. Tate caught J. Darling, whose 37 was top score in a  second innings total of 86, off Braund, the result must have been different, for four wickets would have been down for 16. By holding two catches at slip off  S. F. Barnes, Braund was responsible for Darling getting a pair in the Test at Sheffield.",
        "With the teams led by A. C. MacLaren in 1901-02, P. F. Warner in 1903-04 and A. O. Jones in 1907-08, Braund went to Australia three times and on his first visit, when he made 103 not out at  Adelaide, his batting average for the Test matches was 36 and he took twenty-one wickets. During the next tour he scored 102 at Sydney when R. E. Foster, with 287, created a record, but on his third trip he fared moderately. Against the famous South African attack of 1907, Braund hit 104 at  Lord's, this being one of the two centuries obtained in Test matches against the bowling combination which included Aubrey Faulkner, R. O. Schwarz, A. E. Vogler and Gordon White.",
        "After giving up active cricket, Braund became a first-class umpire, discharging his duties with marked ability until the end of the 1938 season. In 1943 it became necessary for his right leg to be amputated and three years later he lost the other, but his cheerfulness and his enthusiasm for cricket remained undiminished and for some years he watched cricket at Lord's seated in a bath chair. He was one of the twenty-six retired professional cricketers who in 1949 were given honorary membership of  M.C.C.",
        "C. B. Fry, the former England captain, said of Braund: He was one of the greatest all-round cricketers -- and to think that Surrey let him go! The thing about Len Braund was that he was a big-match player. I have never seen a better slip fieldsman. He had such a delicate hand. He would push it out and the ball would stick. Archie MacLaren would never take the field without him. He was a most valuable member of the England team and as cool as a cucumber.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}