{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "4",
            "6s": "0",
            "Ave": "31.36",
            "Ct": "6",
            "HS": "74*",
            "Inns": "12",
            "Mat": "9",
            "NO": "1",
            "Runs": "345",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "19",
            "50": "66",
            "6s": "",
            "Ave": "23.33",
            "Ct": "172",
            "HS": "217",
            "Inns": "759",
            "Mat": "477",
            "NO": "38",
            "Runs": "16828",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "6",
            "Econ": "1.00",
            "Inns": "1",
            "Mat": "9",
            "Runs": "1",
            "SR": "-",
            "Wkts": "0"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "54.10",
            "BBI": "3/50",
            "BBM": "",
            "Balls": "3756",
            "Econ": "4.75",
            "Inns": "",
            "Mat": "477",
            "Runs": "2976",
            "SR": "68.2",
            "Wkts": "55"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/1083160.html",
        "http://www.espncricinfo.com/wisdencricketer/content/story/244713.html",
        "http://www.espncricinfo.com/magazine/content/story/220042.html",
        "http://www.espncricinfo.com/magazine/content/story/214145.html",
        "http://www.espncricinfo.com/magazine/content/story/96508.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=21499"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/082001/029543.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/082001/029543.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/082001/029543.icon.jpg"
    ],
    "personal_info": {
        "Also known as": [
            "succeeded as 3rd Baron Tennyson in 1928"
        ],
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nNovember 7, 1889, Westminster, London "
        ],
        "Bowling style": [
            "Right-arm fast"
        ],
        "Died": [
            "June 6, 1951, Bexhill-on-Sea, Sussex (aged 61 years 211 days) "
        ],
        "Full name": [
            "Lionel Hallam Tennyson"
        ],
        "Major teams": [
            "England,",
            "Hampshire"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nTENNYSON, THE THIRD BARON (LIONEL HALLAM TENNYSON), who died at Bexhill-on-Sea on June 6, aged 61, was a grandson of the poet and succeeded his father in the title in 1928. Intimately identified with Hampshire cricket from 1913 to 1936, he captained the county team for fourteen years from 1919 onwards. During his career he scored 16,828 runs, average 23.63, including nineteen centuries. His highest innings was 217 against the West Indies at Southampton in 1928, when, after the fall of five Hampshire wickets for 88, he and J. Newman (118) shared in a partnership of 311. \n",
        "While never a really dependable batsman, he was, at his best, a splendid hitter and represented in a striking way the spirit of adventure on the cricket field. He knew no fear, and the more desperate the position the more likely was he to accomplish something brilliant. Gregory and McDonald, the famous Australian fast bowlers who frightened so many of our professional batsmen in 1921, held no terrors for him. He scored 74 not out in the second innings of the Test match at Lord's that year and was chosen to succeed J. W. H. T. Douglas as captain of England in the three remaining contests with Australia. At Leeds, while fielding in the first Test of this series, he damaged his hand badly enough to have justified him in forgoing his innings. That course made no appeal to him. Wearing a basket guard, he duly went in to bat and, though suffering great pain with every contact of bat and ball, faced Gregory and McDonald in such plucky and resourceful fashion that he made 63 and 36. Altogether he played nine times for England, appearing in all five Tests when touring South Africa with J. W. H. T. Douglas's side in 1913-14. He also took several teams to India, the West Indies and South Africa.",
        "Born on November 7, 1889, Tennyson went to Eton and, as a fast bowler, gained a place in the XI in 1907 and 1908. Three years later he entered the Army as a subaltern in the Coldstream Guards, transferring twelve months later to the Rifle Brigade, with whom he served in the first Great War, being three times wounded and twice mentioned in despatches. By the time he began to play for Hampshire his powers as a bowler had largely deserted him. On the other hand, he developed as a batsman, and in the summer of 1913 he and Lieut. C. H. Abercrombie, who lost his life in the Battle of Jutland, scored so well that the achievements of the two young men went a long way to make up for the loss of the services of C. B. Fry.",
        "On his first appearance in first-class cricket, for M.C.C. against Oxford University at Lord's, Tennyson scored 110 in the second innings, and he hit centuries against Essex at Leyton and Nottinghamshire at Trent Bridge. When county cricket was resumed in 1919, he followed E. M. Sprot as Hampshire captain and, although his batting remained an uncertain quantity, he gave many a fine display of free hitting. Such power did he put into his strokes that on one occasion at Southampton he drove a ball from Fairservice, of Kent, over the Pavilion into an adjoining garden, a distance of almost 140 yards. He gave another example of fierce hitting when, against Gloucestershire on the same ground in 1927, he scored 102 not out in fifty-five minutes.",
        "Under his inspiring leadership, Hampshire accomplished some remarkable performances, the most notable being that in the match with Warwickshire at Birmingham in 1922. Then Hampshire, after being dismissed for 15, followed-on, put together a total of 521 and gained an extraordinary victory by 155 runs. Later in the same season, in a game against Yorkshire on a most difficult pitch at Bradford, where the average score was less than nine, he went in first and knocked up 51 out of 64, a fearless display which decided the issue.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}