{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "1",
            "6s": "0",
            "Ave": "29.00",
            "Ct": "2",
            "HS": "52",
            "Inns": "6",
            "Mat": "4",
            "NO": "1",
            "Runs": "145",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "11",
            "50": "55",
            "6s": "",
            "Ave": "26.85",
            "Ct": "190",
            "HS": "176",
            "Inns": "395",
            "Mat": "224",
            "NO": "23",
            "Runs": "9990",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "32",
            "Econ": "5.43",
            "Inns": "2",
            "Mat": "4",
            "Runs": "29",
            "SR": "-",
            "Wkts": "0"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "1",
            "Ave": "23.44",
            "BBI": "5/57",
            "BBM": "",
            "Balls": "3446",
            "Econ": "3.06",
            "Inns": "",
            "Mat": "224",
            "Runs": "1758",
            "SR": "45.9",
            "Wkts": "75"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/604449.html",
        "http://www.espncricinfo.com/magazine/content/story/320591.html",
        "http://www.espncricinfo.com/magazine/content/story/244384.html",
        "http://www.espncricinfo.com/magazine/content/story/241118.html",
        "http://www.espncricinfo.com/magazine/content/story/228980.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=14077"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/154200/154283.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/154200/154283.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/154200/154283.icon.jpg"
    ],
    "personal_info": {
        "Also known as": [
            "succeeded as 4th Lord Harris in 1872"
        ],
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nFebruary 3, 1851, St Anne's, Trinidad "
        ],
        "Died": [
            "March 24, 1932, Belmont, Faversham, Kent (aged 81 years 50 days) "
        ],
        "Education": [
            "Eton College; Oxford University"
        ],
        "Full name": [
            "George Robert Canning Harris (Lord Harris)"
        ],
        "Major teams": [
            "England,",
            "Kent,",
            "Oxford University"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        "A great batsman and a brilliant field in his younger days, and all his life a commanding figure in the world of cricket, Lord Harris, who died on March 24, was born at St. Anne's, Trinidad on February 3, 1851, and so, at the time of his death had entered upon his 82nd year. ",
        "As a boy, he had a private tutor in town and in this way saw a lot of Lord's where he enjoyed the benefit of considerable coaching with the result that, even before he went to Eton, he knew a good deal about batting. At that famous school his cricket education advanced, under the direction of R. A. H. Mitchell and the Rev. G. R. Dupuis, and he obtained his place in the Eleven in 1868 and the two following years. On leaving Eton, he was sent up to Oxford and secured his blue as a Freshman. He also played against  Cambridge in 1872 and 1874, and would, no doubt, have played in 1873 but early that season he bruised his hand so badly when practising catching in the longfield that he found himself compelled to stand down.   ",
        "Prior to his career with Oxford there had commenced that close association with Kent which during the rest of his life commanded so much of Lord Harris's energy and enthusiasm. Indeed, so far back as 1870 he played for Kent, and was elected to the Committee of the County Club -- his father at that time being President -- and in 1874 he succeeded to the honorary secretaryship which for 25 years previously had been held by W. de Chair Baker.   ",
        "Twelve months later, he became captain of the Eleven and so continued for fifteen seasons, resigning after the summer of 1889 on his appointment to the Governorship of Bombay which kept him out of England from 1890 to 1895. Even after the five years in India, he, when in the middle forties, played occasionally for Kent in 1896 and 1897. He was president of that county so far back as 1875 when he also officiated as secretary and captain. During the latter years of his life, he was not only a trustee but also chairman of the County Club.   ",
        "Almost as close as the connection with Kent was that of Lord Harris with the Marylebone Club. First elected to the committee in 1875, he was president in 1895, and was chosen in 1906 as one of the Trustees, a position he resigned ten years later when, on the death of the Hon. Sir Spencer Ponsonby-Fane, he became treasurer of the club.  ",
        "Lord Harris -- at that time the Hon. George Harris -- was a member of the side which under the leadership of R. A. Fitzgerald, secretary of the M.C.C., visited Canada in 1872, and in the autumn of 1878 he took a team out to Australia.   ",
        "   This latter undertaking came about in the first place as the result of an invitation issued by the Melbourne Club to the Gentlemen of England. A thoroughly representative band of amateurs could not be collected to make the trip, and so George Ulyett and Tom Emmett, two famous Yorkshire professionals, were called upon to complete the side. The two professionals were the only regular bowlers, yet of five eleven-a-side matches -- the full programme comprised 13 fixtures -- Lord Harris's team, if badly beaten by the Australians who had visited  England in the summer of 1878, won and lost against  Victoria and New South Wales.   ",
        "In the second game with New South Wales, there occurred over an umpire's decision a disturbance of so disgraceful a nature that the Australians, on the occasion of their second visit to  England in 1880, could secure scarcely any fixtures with first-class sides. Of recent years it has been urged that the failure of the Australians to arrange a first-class programme came about through the neglect of the tourists to enquire beforehand whether their visit would be welcome. The lack of courtesy shown in this way had, no doubt, some effect in leading most of the counties to decline fixtures but, equally, it may be asserted the deplorable affair on the Sydney ground had a big influence in reducing the tour largely to engagements with local eighteens. Whatever the dominating cause of this cold reception, the fact remains that at the end of August the Australians had taken part in only five eleven-a-side games. Such wonderful work with the ball against those local eighteens, however, stood to the credit of Spofforth, Boyle and Palmer that public opinion demanded the tourists should be given a real trial of strength. Accordingly -- Sussex agreeing to the postponement of a fixture -- Lord Harris got up a team and there was decided at The Oval, in the early days of September, the first real Test Match, Lord Harris captained not only the side victorious on that occasion but four years later, when for the first time in this country the number of Test Matches was increased to three, led England at Lord's and at The Oval.   ",
        " While his work for Kent cricket, into the improvement of which he threw himself heart and soul -- he had his reward in seeing that county carry off the Championship on four occasions -- was his great monument,  Lord Harris will always be remembered for the splendid stand he made against unfair bowling. Thanks largely to his efforts, cricket today is practically free from that evil, but in the early eighties the practice of throwing obtained to no inconsiderable extent in first-class cricket and threatened to become more and more pronounced.   ",
        "The situation, particularly as the authorities failed to deal firmly with the trouble, called for drastic action and this was forthcoming on the part of Lord Harris. At that time,  Lancashire played two professionals -- Crossland and Nash -- whose delivery of the ball was, outside that county, generally recognised as unfair.   ",
        "Umpires, though more than once reminded by the powers of those days to carry out the strict letter of the law, did not move in the matter, so Lord Harris, after participating in a match with  Lancashire at Old Trafford, wrote to the Kent Committee urging that, as a protest against the Lancashire bowlers, Kent should scratch the return match with the northern county. The Kent Committee duly adopted this course. Crossland later in the season was found to have broken his qualification for Lancashire and Nash dropped out of the eleven, so fixtures were renewed the following year. While circumstances thus prevented a prolonged breach, there can be no doubt the action of Lord Harris, even if it did not entirely remove the throwing evil, had a very healthy effect on the game.   ",
        null,
        "So far back as 1886, Lord Harris, at a meeting of the M.C.C., brought forward a proposal that the period necessary to give a residential qualification to play for a county should be reduced to twelve months. That is the rule today and has been so for over a year but Lord Harris, when he urged the alteration from two years to one, was in front of his time and the motion was lost by 14 votes to 3.   ",
        "A batsman of very high class, possessed of an excellent style and great punishing powers and full of pluck, Lord Harris was never afraid of a rough wicket -- he played, when suffering from a damaged or broken finger, an heroic innings against  Derbyshire on a vile pitch at Derby in 1884. In 1882 and in each of the following years he had a batting average of over thirty -- no small achievement in those days -- that of  1884 being 33 with an aggregate of 1,417.   ",
        "In the opinion of some of his contemporaries, Lord Harris was one of the finest batsmen ever seen against fast bowling on a fiery wicket. Good driving-power, both to the off and to the on were at his command and he was a master of the  square cut. Indeed he possessed practically all the recognised strokes and, if a bowler kept an immaculate length, he would jump in, make a half-volley of the ball and lift it over mid-off or mid-on. G. G. Hearne has placed the fact on record that when batting with him against Jack Crossland of Lancashire, one of the fastest bowlers in the country, Lord Harris drove in such tremendous form that  Crossland was compelled to have two men in the long field.  The only time I had ever seen it to that pace bowling, added George Hearne.   ",
        "Lord Harris first appeared for  Gentlemen against Players in 1875 in the famous match in which W. G. Grace (152) and A. J. Webbe (65) made in the  second innings 203 for the first wicket. He fielded admirably anywhere and especially in the outfield. Lord Harris was also a particularly able captain as he showed in the England v. Australia match at Lord's in 1884 when, although Peate was bowling an admirable length and worrying the Australian batsmen, he noticed that the pitch, just short of where Peate dropped the ball, was wearing. To the surprise of most people present, he took Peate off in favour of George Ulyett, coming to the conclusion that  Ulyett, if able to find the particular spot, would, with his pace, be particularly nasty. Ulyett did find the spot and took seven wickets for 36 runs, England winning by an innings and five runs.   ",
        "Lord Harris's highest innings for Kent was 176 against Sussex in 1882, when he and Lord Throwley made 208 for the first wicket. Altogether, he scored 7,806 runs for Kent with an average of 30 -- a figure he exceeded in nine different seasons -- and for that county played nine separate innings of a hundred or more.   ",
        "A great figure at the Canterbury week over a period of 60 years, Lord Harris first participated in the Festival in 1870 when, appearing for the Gentlemen of Kent against the  M.C.C., he was in each innings bowled for eight by F. C. Cobden who, a few weeks earlier, performing the hat-trick when Oxford, wanting three runs for victory, had three wickets to fall, had snatched a memorable victory for  Cambridge. Later in the same Canterbury Week the Hon. George Harris -- as Lord Harris was then -- made top score -- 64 -- for I Zingari against the Gentlemen of Kent.  ",
        "Always keenly interested in the Cricketers' Fund Friendly Society, he had been President of that body for many years to the time of his death.   ",
        "Lord Harris was the author of three books - A History of Kent County Cricket, A Few Short Runs, and (in conjunction with Mr. F. S. Ashley Cooper) Lord's and the M.C.C.   ",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}