{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "7.85",
            "Ct": "3",
            "HS": "30",
            "Inns": "8",
            "Mat": "5",
            "NO": "1",
            "Runs": "55",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "13",
            "50": "69",
            "6s": "",
            "Ave": "20.15",
            "Ct": "209",
            "HS": "166",
            "Inns": "936",
            "Mat": "633",
            "NO": "105",
            "Runs": "16749",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "5",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "20",
            "Econ": "4.80",
            "Inns": "",
            "Mat": "633",
            "Runs": "16",
            "SR": "-",
            "Wkts": "0"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/639869.html",
        "http://www.espncricinfo.com/magazine/content/story/453610.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154759.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/98000/98000.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/98000/98000.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/98000/98000.icon.jpg"
    ],
    "personal_info": {
        "Also known as": [
            "succeeded as 7th Baron Hawke in 1887"
        ],
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nAugust 16, 1860, Willingham Rectory, Gainsborough, Lincolnshire "
        ],
        "Died": [
            "October 10, 1938, West End, Edinburgh, Midlothian, Scotland (aged 78 years 55 days) "
        ],
        "Full name": [
            "Martin Bladen Hawke (Lord Hawke)"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Yorkshire"
        ]
    },
    "profile_info": [
        "\nLord Hawke strode the cricketing world like a colossus for half a century, as a player and administrator, and one who played a major part in the modernisation of the game.  He was a keen advocate of overseas tours, a strict disciplinarian, and a determined upholder of the games traditions. \n",
        "Hawke's life was cricket. He captained Yorkshire for 28 seasons during which time they won eight Championships, and was the county's president for 40 years (despite having been born in Lincolnshire, he fiercely advocated that all players should be born in Yorkshire). He was MCC president from 1914 to 1919, its treasurer and a trustee between 1932 and 1938, and a national selector from 1899 to 1909 and again in 1933.  He was no mean batsman  either, winning Blues for Cambridge, and leading England in Tests in South Africa.",
        "In a era where professionals were looked down on, Hawke did much to improve their lot. He introduced winter pay - until then they were only paid in the summer months - and a scheme whereby a proportion of benefit income was invested on their behalf.  But he was hard on any threat to the spirit of the game. His treatment of a drunken Bobby Peel has gone into the game's folklore - he escorted him off the field and, as Peel himself sarcastically noted: \"Lord Hawke put his arm round me and helped me off the ground - and out of first-class cricket. What a gentleman!\"",
        "Held in respect and awe while alive, posterity has been less kind to Hawke's memory. Benny Green said that he is remembered \"for a succession of monumental blunders which 50 years of apologia from his admirers have done nothing to excuse.\"",
        null,
        null,
        "It may not be generally known how Lord Hawke's strength of character was tested when, as a young man on leaving Cambridge, he undertook the responsibility of captaining the Yorkshire side, composed at that time of elements that were not entirely harmonious. Owing to his tact, judgment and integrity, he moulded the XI into the best, and probably the most united county team in England. He regarded Yorkshire as his home by adoption, and wherever he went he hailed Yorkshiremen as his friends. He always played to win, but whatever the game, he was a generous opponent and never harboured resentment. The writer recollects running him out when Cambridge University were playing Surrey at The Oval - a bad  run-out. The offence was forgiven but it is doubtful if it was forgotten.",
        "Through the long and anxious years of the Great War, Lord Hawke was president of MCC. The ground was being used for military purposes, training and recreation. Problems frequently arose, and he was the greatest help in giving wise counsel towards their solution. After the war he followed Lord Harris as treasurer of MCC, and only resigned shortly before his death. Like Lord Harris, he was devoted to MCC and believed that the wellbeing of cricket depended on the allegiance given to the club by its members, by the county clubs, and by the judicial impartial administration of its committee.",
        "Lord Hawke was a member of the I Zingari committee, and in recent years many of its meetings were held at his house in Belgrave Square, where the committee had the privilege of accepting his hospitality - a great experience. It has been said that candidates for election had a better chance of being selected after luncheon than before.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}