{
    "batting_averages": [
        {
            "": "Tests",
            "100": "1",
            "50": "1",
            "6s": "0",
            "Ave": "20.19",
            "Ct": "8",
            "HS": "104",
            "Inns": "22",
            "Mat": "11",
            "NO": "1",
            "Runs": "424",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "69",
            "50": "187",
            "6s": "",
            "Ave": "33.40",
            "Ct": "396",
            "HS": "221",
            "Inns": "1161",
            "Mat": "741",
            "NO": "70",
            "Runs": "36440",
            "St": "1"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "11",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "1",
            "Ave": "28.91",
            "BBI": "5/42",
            "BBM": "",
            "Balls": "1681",
            "Econ": "3.50",
            "Inns": "",
            "Mat": "741",
            "Runs": "983",
            "SR": "49.4",
            "Wkts": "34"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155519.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154774.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/032005/058552.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJuly 4, 1874, Thornes, Wakefield, Yorkshire "
        ],
        "Bowling style": [
            "Right-arm medium-fast"
        ],
        "Died": [
            "February 16, 1950, Thornes, Wakefield, Yorkshire (aged 75 years 227 days) "
        ],
        "Full name": [
            "David Denton"
        ],
        "Major teams": [
            "England,",
            "Yorkshire"
        ],
        "Other": [
            "Umpire"
        ]
    },
    "profile_info": [
        "\nDavid \"Lucky\" Denton, one of the liveliest of batsmen and a superb field, died suddenly at his home at Wakefield on February 17. He was 75. Denton made his first appearance for Yorkshire in 1894 and concluded his career as an active cricketer in 1920. He did little as a batsman when he first played with the county, but in the following year, coming off early in the summer against both Cambridge University and Lancashire, he made his place secure. For twenty-one seasons his record exceeded 1,000 runs, his aggregate reaching 2,000 in five summers, and in 1905 amounting to 2,405, with an average of 42. For twenty years this stood as the highest Yorkshire aggregate until surpassed by Herbert Sutcliffe. \n",
        "Possessed of very flexible wrists, Denton made strokes all round the wicket with considerable hitting power, while he played forward so hard that he always made the ball travel. On fast wickets he seized every opening to score on the off side, cutting in particularly brilliant fashion, and when the ground was slow he employed the pull and the hook with fine effect. The force of his strokes was surprising as he was below medium height and lightly built. He batted in exceptionally good style and never lost any time in getting to work. Going out for runs immediately he arrived at the wicket, he naturally gave many chances and was sometimes referred to as the luckiest of cricketers. Certainly he often enjoyed a liberal share of good fortune, but if let off he would settle down to hitting as clean and well-timed as it was continuous.",
        "Brilliantly as he batted, Denton attained to even higher excellence as a fieldsman, especially in the deep and at third man. Indeed, he held a place almost alone as an outfield, no one chasing the ball at a greater speed, picking it up more clean or returning it more quickly. A rare judge of a high catch in the long field, he established among his colleagues such a firm belief in his abilities that on one memorable day at Lord's when he committed two blunders the whole Yorkshire team were upset.",
        "In the course of his career he scored 36,520 runs in first-class matches with an average of 33. He put together 69 three-figure innings--61 of these for Yorkshire--his highest being 221 against Kent at Tunbridge Wells in 1912, 209 not out against Worcestershire at Worcester in 1920, and 200 not out against Warwickshire at Birmingham in 1912. Three times he registered two separate hundreds in the same match--107 and 109 against Nottinghamshire at Trent Bridge in 1906, 131 and 121 against the M.C.C. at Scarborough in 1908, and 139 and 138 against the Transvaal at Johannesburg for the English team which went out to South Africa in 1909-10. These last two scores he immediately followed with 104 against South Africa, and so played three successive three-figure innings. This feat was accomplished on the occasion of his second visit to South Africa, where he went first in the winter of 1905-6. Denton never went to Australia. Presumably it was feared he might not enjoy at the hands of the Australians the luck which generally favoured him in this country and that the match-winning qualities he possessed in being able to score so rapidly would lose their value in games played without a time limit. On the other hand, his fielding must have been an asset to any side. On his one Test appearance against Australia at Leeds in 1905 he accomplished little, but he played in ten Tests in South Africa.",
        " Denton figured in many Gentlemen and Players matches, and for the professionals at Scarborough in 1906 he scored 157 not out. Twice he took part in a stand of more than three hundred runs, putting on 312 in company with George Hirst against Hampshire at Southampton in 1914 and 305 with J. W. Rothery against Derbyshire at Chesterfield in 1910. As his benefit he was given the Yorkshire v. Lancashire match at Leeds in 1907, and the contest yielded a profit of nearly £2,000. Following upon his retirement from active participation in the game, Denton fell into bad health and for a time acted as scorer for Yorkshire, but, undergoing an operation performed by Sir Berkeley Moynihan, he recovered so completely that from 1925 onwards he found himself able to perform the duties of an umpire in first-class cricket.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}