{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "1",
            "Ave": "7.40",
            "Ct": "1",
            "HS": "15",
            "Inns": "6",
            "Mat": "4",
            "NO": "1",
            "Runs": "37",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "1",
            "50": "6",
            "6s": "",
            "Ave": "12.11",
            "Ct": "202",
            "HS": "100*",
            "Inns": "324",
            "Mat": "270",
            "NO": "42",
            "Runs": "3416",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "1",
            "5w": "1",
            "Ave": "34.07",
            "BBI": "5/61",
            "BBM": "9/93",
            "Balls": "1244",
            "Econ": "2.30",
            "Inns": "6",
            "Mat": "4",
            "Runs": "477",
            "SR": "88.8",
            "Wkts": "14"
        },
        {
            "": "First-class",
            "10": "8",
            "4w": "",
            "5w": "51",
            "Ave": "19.42",
            "BBI": "8/19",
            "BBM": "",
            "Balls": "55360",
            "Econ": "2.11",
            "Inns": "",
            "Mat": "270",
            "Runs": "19542",
            "SR": "55.0",
            "Wkts": "1006"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/124677.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154595.html"
    ],
    "latest_photos": [],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nAugust 2, 1928, Chadderton, Lancashire "
        ],
        "Bowling style": [
            "Slow left-arm orthodox"
        ],
        "Died": [
            "July 8, 1990, Oldham, Lancashire (aged 61 years 340 days) "
        ],
        "Full name": [
            "Malcolm Jameson Hilton"
        ],
        "Major teams": [
            "England,",
            "Lancashire"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nMalcolm Hilton was the best slow left-arm bowler that Lancashire produced since the turn of the century. In May 1948 he became for a short time the most-discussed young man in the cricket world when, in only his third first-class match, he twice dismissed Bradman at Old Trafford. In the Australians' first innings the 19-year-old Hilton bowled the great man for 14, and in the second he had him stumped after beating him with his three previous deliveries. Thereafter, fearing that all the brouhaha might spoil him, Lancashire gradually withdrew him from the front line, but not before he had claimed 41 wickets at 21.07.  \n",
        "A year later they sensibly decided to confine Hilton's activities to 2nd XI cricket, in which, so well did he absorb the advice of the coaching staff, he dominated the Minor Counties Championship by taking 103 wickets. In 1950 he came right to the front, putting his trust more in his ability to impart sharp spin than in subtle variations of pace and flight. So impressed were the England selectors that, without any more ado, they picked him for the final Test against West Indies at The Oval. This was a tough baptism, made tougher still when Brown lost the toss, and in a total of 503 he bowled 41 wicketless overs for 91 runs. Berry, his fellow-Lancastrian, was preferred to him for Australia, but it must have been a close thing. Hilton's record of 135 wickets at less than 17 apiece was the more impressive of the two, but Berry's ability on firm pitches undoubtedly influenced the selectors. ",
        "However, a similar record in 1951 earned Hilton a Test recall against South Africa at Headingley, where the pitch proved to be lifeless, a handicap to batsmen and bowlers alike. The South Africans, largely through the stolid Eric Rowan, ground out 538, and England followed suit with 505 before rain mercifully intervened. Hilton bore much of the burden, taking 3 for 176 in 61.3 overs, but he joined a skittish Trevor Bailey in a last-wicket stand of 60, of which his own share was 9. This included a mighty six off Athol Rowan. In the winter of 1951-52 he toured India with MCC, but took a long time to settle down and did not come into the Test side until the penultimate match at Kanpur, where conditions proved to be more favourable to spin than in any precious match. England won by eight wickets and Hilton seized his chance magnificently and was one of the leading figures in the success with match figures of 9 for 93. At Madras he disposed of Hazare and Phadkar but could not prevent India from gaining their first-ever Test victory.",
        "A moderate season in 1952 was followed by a disastrous one in Coronation year, when for the first time he was afflicted by a serious loss of control, a bowler's nightmare. He had to sit out the monsoons of 1954 in the pavilion, but when cricket was possible he took nearly 100 wickets at 20 apiece, although at times he looked vulnerable. He passed the coveted figure for the third time in 1955, yet probably had even more satisfaction from his maiden century, 100 not out at Northampton, which was compiled with his unusual repertoire of robust strokes. By 1956 he was well and truly back to his best, claiming 158 wickets at 13.96 with the excellent strike-rate of 45.56 and finishing third in the national averages. He considered his 14 for 88 in August at Weston-super-Mare to be the highlight of his season. For Somerset, his younger brother, Jim, took eight wickets with his offspinners. A week later, there were red faces at The Oval when Surrey were bowled out for 96 by Hilton and Tattersall; and even more embarrassment was caused early in September when, in the Champion County's match against The Rest, Surrey were again dismissed on the same ground by the Lancashire pair, losing twenty wickets for a combined total of 143. Hilton captured 6 for 10 in the first innings, spinning the ball viciously from leg in helpful conditions, and the Oval faithful were reminded that there were other spinners around, apart from Lock and Laker. He was chosen as one of the Five Cricketers of the Year for the 1957 edition of Wisden.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}