{
    "batting_averages": [
        {
            "": "Tests",
            "100": "14",
            "4s": "831",
            "50": "29",
            "6s": "42",
            "Ave": "43.79",
            "BF": "10685",
            "Ct": "95",
            "HS": "219",
            "Inns": "143",
            "Mat": "76",
            "NO": "10",
            "Runs": "5825",
            "SR": "54.51",
            "St": "0"
        },
        {
            "": "ODIs",
            "100": "12",
            "4s": "528",
            "50": "21",
            "6s": "41",
            "Ave": "37.37",
            "BF": "5087",
            "Ct": "49",
            "HS": "137",
            "Inns": "122",
            "Mat": "123",
            "NO": "6",
            "Runs": "4335",
            "SR": "85.21",
            "St": "0"
        },
        {
            "": "T20Is",
            "100": "0",
            "4s": "23",
            "50": "2",
            "6s": "1",
            "Ave": "55.33",
            "BF": "131",
            "Ct": "2",
            "HS": "72",
            "Inns": "3",
            "Mat": "3",
            "NO": "0",
            "Runs": "166",
            "SR": "126.71",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "66",
            "4s": "",
            "50": "124",
            "6s": "",
            "Ave": "41.78",
            "BF": "",
            "Ct": "540",
            "HS": "284",
            "Inns": "654",
            "Mat": "379",
            "NO": "36",
            "Runs": "25825",
            "SR": "",
            "St": "0"
        },
        {
            "": "List A",
            "100": "28",
            "4s": "",
            "50": "63",
            "6s": "",
            "Ave": "37.28",
            "BF": "",
            "Ct": "149",
            "HS": "184",
            "Inns": "357",
            "Mat": "372",
            "NO": "29",
            "Runs": "12229",
            "SR": "",
            "St": "0"
        },
        {
            "": "T20s",
            "100": "2",
            "4s": "304",
            "50": "17",
            "6s": "80",
            "Ave": "28.81",
            "BF": "1569",
            "Ct": "29",
            "HS": "108*",
            "Inns": "87",
            "Mat": "89",
            "NO": "5",
            "Runs": "2363",
            "SR": "150.60",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "155.00",
            "BBI": "1/34",
            "BBM": "1/34",
            "Balls": "300",
            "Econ": "3.10",
            "Inns": "10",
            "Mat": "76",
            "Runs": "155",
            "SR": "300.0",
            "Wkts": "1"
        },
        {
            "": "ODIs",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "54.75",
            "BBI": "2/7",
            "BBM": "2/7",
            "Balls": "232",
            "Econ": "5.66",
            "Inns": "13",
            "Mat": "123",
            "Runs": "219",
            "SR": "58.0",
            "Wkts": "4"
        },
        {
            "": "T20Is",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "3",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "43.08",
            "BBI": "4/36",
            "BBM": "",
            "Balls": "2704",
            "Econ": "3.44",
            "Inns": "",
            "Mat": "379",
            "Runs": "1551",
            "SR": "75.1",
            "Wkts": "36"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "1",
            "5w": "0",
            "Ave": "28.84",
            "BBI": "4/50",
            "BBM": "4/50",
            "Balls": "2010",
            "Econ": "4.90",
            "Inns": "",
            "Mat": "372",
            "Runs": "1644",
            "SR": "35.2",
            "Wkts": "57"
        },
        {
            "": "T20s",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "89",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/1145235.html",
        "http://www.espncricinfo.com/county-cricket-2017/content/story/1119845.html",
        "http://www.espncricinfo.com/county-cricket-2017/content/story/1099022.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/1090804.html",
        "http://www.espncricinfo.com/county-cricket-2017/content/story/1089157.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=21585"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/268500/268566.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/268500/268566.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/268500/268566.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nDecember 25, 1975, Keynsham, Somerset "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Current age": [
            "42 years 236 days"
        ],
        "Education": [
            "Sir Bernard Lovell School"
        ],
        "Fielding position": [
            "Occasional wicketkeeper"
        ],
        "Full name": [
            "Marcus Edward Trescothick"
        ],
        "Height": [
            "\n6 ft 3 in "
        ],
        "Major teams": [
            "England,",
            "Somerset"
        ],
        "Nickname": [
            "Banger, Tresco"
        ],
        "Playing role": [
            "Opening batsman"
        ]
    },
    "profile_info": [
        "\nA brutal left-handed opening batsman, Marcus Trescothick was one of the finest opening batsmen to play for England and also stood in as captain for two Tests and 10 ODIs.  He was an automatic choice from the turn of the century until a stress-related illness intervened with him not much past his 30th birthday and forced his international retirement in 2008. The anxiety attacks he suffered, particularly when having to contend with long periods away from home and family, brought the issue of depression and stress in sport into sharp focus in the English game and there was general delight when he continued his county career at Somerset where his genial biffing of county attacks brought much entertainment at Taunton and elsewhere. Somerset sought his services beyond his 40th birthday, confirming him as one of the great stalwarts of the English game in any era. \n",
        "Capacious of build and comfortable of movement, he had a benign air at the crease which meant that when he bullied attacks, which he did often, he bullied them gently. Not particularly mobile in the field, he turned himself into a safe slip fielder. He was a key factor in England's change in fortunes and, most notably, spearheaded an aggressive approach against Australia in the Ashes win of 2005. ",
        "There was something biblical about Trescothick's early career: seven years of plenty as a schoolboy, seven years of famine when he reached the Somerset 1st XI. And lo, it came to pass in 1999 that he batted on a pacey pitch at Taunton against Glamorgan while Duncan Fletcher was their coach, and made a storming 167, with five sixes, when the next-best score was 50. When England needed a stand-in one-day opener in 2000, Fletcher, by then elevated to the England job, remembered Trescothick. He took to international cricket immediately. A true opener, he formed a habit of starting a series well with a mixture of expert leaves, crisp cover-drives, spanking pulls and fearless slog-sweeps.",
        "Hefty, genial, and at ease on the big stage, Trescothick's first four England hundreds came in a losing cause, confirming his ability to keep his head while all around were losing theirs. Opening in Tests with Mike Atherton, Trescothick acquired the air of a senior player as if by osmosis - he joined the management committee on his first tour. All that stood between him and the highest level was a tendency to get out when well set, to make a breezy 20 or 30. He seemed to have conquered this with a domineering home season in 2002, but it reappeared - like so many English frailties - as soon as the team landed in Australia. Trescothick endured fluctuating fortunes over the next couple of seasons. He showed glimpses of his blazing best against South Africa in 2003, when he capped his season with a determined 219 (and 69 not out) in the astonishing series-levelling victory at The Oval, but his form slid away drastically in the Caribbean that winter.",
        "The selectors never lost faith with him and, having stood in as captain for the first Test of the 2004 season, Trescothick cracked a pair of hundreds against West Indies at Edgbaston. At Johannesburg in 2004-05, he set up England's series victory with a brutal 180 on the final morning, and carried his domineering form into the home season. Having bullied 345 runs in two innings against the Bangladeshis, he made 431 runs against Australia in a memorable summer of 2005, as he - and England - finally got the better of the one nation that really mattered. He cracked 90 in the second Test at Edgbaston, underlining that this England side was not lying down. It ignited the summer, a hope-laden innings from a player who was widely praised as the most selfless of cricketers.",
        "But his winter was cut short when he returned home suddenly from India under a cloak of secrecy, and after an indifferent summer it was announced he would miss the Champions Trophy as he was still recovering from a stress-related illness. He was included in the Ashes squad for the 2006-07 campaign Down Under but lasted less than two weeks before he was again boarding a flight back home with a recurrence of his illness.",
        null,
        "The book had a cathartic effect. In 2009 he enjoyed one of his most prolific seasons yet, scoring nearly 3,000 runs for Somerset in all competitions. He was named captain following Justin Langer's decision not to return for 2010 and even overcame his reservations to take part in the county's Champions League campaign in India that October, although he flew home after the group stages.",
        "Already enshrined in Somerset folklore, with a stand named in his honour, he nearly delivered the ultimate prize in 2010. His 1,397 runs at 58.20 helped Somerset enter the final day of the season knowing victory at Durham would be enough to win them their maiden County Championship. But time ran out on Somerset and Nottinghamshire achieved the bonus point they needed with three wickets after tea to snatch the title. Seemingly getting better with age, Trescothick plundered 1,673 runs in 2011 at a career-best season's average of 79.66. He also led Somerset to the finals of both the Friends Life t20 and Cyldesdale Bank 40, only to lose both. A year later, injury and poor weather resulted in a less-than-prolific season but, undeterred by his advancing years, Trescothick signed a new three year deal with Somerset in November 2012 but failed to score a century in any competition in 2013 - the first time in his career he has gone through a season without a three figure score. He recovered, in the first-class game at least, rattling up a formidable 1284 runs at 45.86 to help offset Somerset's relegation fears in 2015, including 210 not out in a vital late-season draw against Sussex at Hove.",
        "He must have felt as he passed his 40th birthday on Christmas Day that his chances of leading Somerset to that elusive Championship title had diminished. But he could not have imagined the agonising miss that befell Somerset in 2016 when they wrapped up a win in their final game at Taunton with a day to spare, went top of the table, but watched Middlesex and Yorkshire - both with title aspirations of their own - manufacture a positive result at Lord's. Trescothick had a wonderful personal season to look back on: 1,239 Championship runs and four more hundreds, capped by 218 against Nottinghamshire at Trent Bridge, an innings made on a stonkingly hot day which took him alongside Harold Gimblett as Somerset's most prolific century-maker in first-class cricket. He entered 2017 amid hopes in the West Country that the record would come his way at Taunton with the Quantocks shimmering in the haze and the chance to raise a glass to it with a post-match cider in the Ring of Bells. It duly arrived in May, bringing delight to an otherwise drab rain-affected draw against Warwickshire.",
        null
    ],
    "recent_matches": [
        {
            "Bat & Bowl": "6, 71",
            "Ground": "Worcester",
            "Match Date": "22 Jul 2018",
            "Opposition": "v Worcs",
            "Scorecard": "FC",
            "Team": "Somerset"
        },
        {
            "Bat & Bowl": "37, 90",
            "Ground": "Southampton",
            "Match Date": "17 Jul 2018",
            "Opposition": "v Hants 2nd XI",
            "Scorecard": "Other",
            "Team": "Smrst 2nd XI"
        },
        {
            "Bat & Bowl": "126",
            "Ground": "Taunton",
            "Match Date": "11 Jul 2018",
            "Opposition": "v Sussx 2nd XI",
            "Scorecard": "Other",
            "Team": "Smrst 2nd XI"
        },
        {
            "Bat & Bowl": "100",
            "Ground": "Manchester",
            "Match Date": "4 May 2018",
            "Opposition": "v Lancashire",
            "Scorecard": "FC",
            "Team": "Somerset"
        },
        {
            "Bat & Bowl": "4, 2",
            "Ground": "Taunton",
            "Match Date": "27 Apr 2018",
            "Opposition": "v Yorkshire",
            "Scorecard": "FC",
            "Team": "Somerset"
        },
        {
            "Bat & Bowl": "1, 43",
            "Ground": "Taunton",
            "Match Date": "20 Apr 2018",
            "Opposition": "v Worcs",
            "Scorecard": "FC",
            "Team": "Somerset"
        },
        {
            "Bat & Bowl": "37, 31",
            "Ground": "Taunton",
            "Match Date": "25 Sep 2017",
            "Opposition": "v Middlesex",
            "Scorecard": "FC",
            "Team": "Somerset"
        },
        {
            "Bat & Bowl": "65, 1",
            "Ground": "The Oval",
            "Match Date": "19 Sep 2017",
            "Opposition": "v Surrey",
            "Scorecard": "FC",
            "Team": "Somerset"
        },
        {
            "Bat & Bowl": "25, 21",
            "Ground": "Taunton",
            "Match Date": "12 Sep 2017",
            "Opposition": "v Lancashire",
            "Scorecard": "FC",
            "Team": "Somerset"
        },
        {
            "Bat & Bowl": "28, 119*",
            "Ground": "Birmingham",
            "Match Date": "5 Sep 2017",
            "Opposition": "v Warwickshire",
            "Scorecard": "FC",
            "Team": "Somerset"
        }
    ]
}