{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "4",
            "50": "0",
            "6s": "0",
            "Ave": "7.00",
            "BF": "131",
            "Ct": "0",
            "HS": "15",
            "Inns": "6",
            "Mat": "5",
            "NO": "2",
            "Runs": "28",
            "SR": "21.37",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "4s": "",
            "50": "4",
            "6s": "",
            "Ave": "14.66",
            "BF": "",
            "Ct": "54",
            "HS": "60",
            "Inns": "245",
            "Mat": "192",
            "NO": "52",
            "Runs": "2830",
            "SR": "",
            "St": "0"
        },
        {
            "": "List A",
            "100": "0",
            "4s": "",
            "50": "2",
            "6s": "",
            "Ave": "12.07",
            "BF": "",
            "Ct": "31",
            "HS": "56*",
            "Inns": "104",
            "Mat": "185",
            "NO": "38",
            "Runs": "797",
            "SR": "",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "45.16",
            "BBI": "3/48",
            "BBM": "4/152",
            "Balls": "1042",
            "Econ": "3.12",
            "Inns": "7",
            "Mat": "5",
            "Runs": "542",
            "SR": "86.8",
            "Wkts": "12"
        },
        {
            "": "First-class",
            "10": "3",
            "4w": "",
            "5w": "27",
            "Ave": "27.70",
            "BBI": "9/19",
            "BBM": "",
            "Balls": "35359",
            "Econ": "2.97",
            "Inns": "",
            "Mat": "192",
            "Runs": "17537",
            "SR": "55.8",
            "Wkts": "633"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "6",
            "5w": "1",
            "Ave": "26.39",
            "BBI": "5/21",
            "BBM": "5/21",
            "Balls": "8714",
            "Econ": "4.21",
            "Inns": "",
            "Mat": "185",
            "Runs": "6124",
            "SR": "37.5",
            "Wkts": "232"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/128544.html",
        "http://www.espncricinfo.com/ci/content/story/95451.html",
        "http://www.espncricinfo.com/england/content/story/93139.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/042001/025021.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042001/025021.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042001/025021.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nAugust 27, 1970, Watford, Hertfordshire "
        ],
        "Bowling style": [
            "Left-arm medium-fast"
        ],
        "Current age": [
            "47 years 356 days"
        ],
        "Full name": [
            "Mark Christopher Ilott"
        ],
        "Major teams": [
            "England,",
            "Essex"
        ]
    },
    "profile_info": [
        "\nA left-arm seamer, just over six feet tall, Mark Ilott became the perfect\nsuccessor to the left-arm swing of John Lever at Essex. Born in Watford in\nAugust 1970, he made his debut for the county in 1988, having previously\nimpressed for Hertfordshire Schools and Hertfordshire in 1987-88, at 16\nbeing the youngest player (at the time) to represent the minor county. \n",
        "Ilott established himself in the Essex team at the end of 1990 with a\nhaul of 5-34 against Derbyshire, impressing enough to earn a late call-up\nfor the A tour of Sri Lanka after Steve Watkin was ruled out through injury.\nAt the time he was playing his second season for East Torrens District in\nAdelaide. He did well on tour, and a bright future seemed assured. However a\nstress fracture of the back robbed him of almost the entire 1991 season, and\nan operation was necessary in August of that year. He bounced back with 64\nwickets in 1992, winning another A tour place, this time to Australia.",
        "1993 saw Ilott win his county cap and play his first Test cricket. As\n12th man for the first two Tests of a one-sided series, he saw England go\n2-0 down before he made his debut in a much-changed side along with\nLathwell, Thorpe and McCague. England drew the game and Ilott batted\nstubbornly and bowled with great heart to take 4-152 in the game. He proved\nhis stamina again in the next Test, taking 3-161 in 51 overs of hard graft\nas England lost by an innings. Another loss followed at Birmingham as Ilott,\nin common with the other English seamers, was unable to penetrate against\nthe strong Australian batting line-up.",
        "Relegated to another A tour, Ilott responded in fine style, taking 37\nwickets in South Africa at an average of just 15 (including 6-61 against\nTransvaal), and was 12th man for the first Test against New Zealand the\nfollowing summer before another inopportune injury again sidelined him.\nHowever 59 more first-class wickets earned him yet another A tour, but he\ncould manage only 12 overs in India as injury again intervened.",
        "Ilott bowled beautifully in 1995, taking 78 first-class wickets as Essex\nrelied heavily upon him. Career-best figures of 9-19, including a hat-trick\nof lbws, against Northants and match figures of 14-105 (gallingly Essex\nstill lost) were the best Essex figures ever for a single innings. The key\nappeared to be an excellent command of swing combined with increased\ncontrol, while a slightly altered action lessened the risk of injury. It was\nenough to warrant a recall to the Test squad for the tour to South Africa,\nwhere, playing in the rain-ravaged third Test he produced Test-best figures\nof 3-48. He bowled well, though without much luck, in the fourth Test but a\nthigh injury sidelined him halfway through and his tour was over.",
        "There has been no recall to Test colours. Ilott took another 50\nfirst-class wickets in 1996, but appeared to have lost his cutting edge at\ntimes, perhaps feeling the burden of carrying a weakened Essex seam attack.\n1997 began well, but a heel injury impeded his progress and he struggled to\nrecapture his rhythm. He was involved in an unsavoury, but in truth pretty\nharmless, pushing and finger-wagging incident with Robert Croft in the\ntension of a NatWest semi-final against Glamorgan. The presence of\ntelevision cameras did them no favours and a £1000 fine and suspended ban\nfollowed.",
        "A good 1998 season was followed by an injury-ravaged 1999 and 2000. Ilott\nfound himself well down in the pecking order for a Test place behind younger\ncontenders and a higher quality English seam attack than had been available\nfor at least a decade. Perhaps a little short of pace to trouble the best\nplayers on Test pitches, Mark Ilott remained one of the most consistent\nperformers in county cricket and, when fit, was still a tough proposition.\nHowever, as his fitness went through a difficult time he found it\nincreasingly difficult to maintain a place in the Essex side and, at the end\nof the 2002 season - his benefit year - he was released while he still had\nthe chance to find another county. Outside cricket he runs a co-operative\nhospitality firm and is a witty and likeable journalist, running his own\nwebsite: www.markilott.com (Copyright CricInfo October 2002)"
    ],
    "recent_matches": [
        {
            "Bat & Bowl": "0/27, 6*",
            "Ground": "Uxbridge",
            "Match Date": "28 Jun 2007",
            "Opposition": "v Lashings XI",
            "Scorecard": "Other OD",
            "Team": "Celebrasians"
        }
    ]
}