{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "14.00",
            "Ct": "0",
            "HS": "8*",
            "Inns": "3",
            "Mat": "5",
            "NO": "2",
            "Runs": "14",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "5",
            "6s": "",
            "Ave": "12.84",
            "Ct": "83",
            "HS": "64",
            "Inns": "203",
            "Mat": "179",
            "NO": "51",
            "Runs": "1953",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "1",
            "5w": "1",
            "Ave": "18.92",
            "BBI": "5/38",
            "BBM": "8/55",
            "Balls": "817",
            "Econ": "1.94",
            "Inns": "8",
            "Mat": "5",
            "Runs": "265",
            "SR": "58.3",
            "Wkts": "14"
        },
        {
            "": "First-class",
            "10": "3",
            "4w": "",
            "5w": "30",
            "Ave": "23.62",
            "BBI": "9/55",
            "BBM": "",
            "Balls": "34133",
            "Econ": "2.51",
            "Inns": "",
            "Mat": "179",
            "Runs": "14291",
            "SR": "56.4",
            "Wkts": "605"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155312.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/52300/52337.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMarch 23, 1906, Northwood, Middlesex "
        ],
        "Bowling style": [
            "Right-arm medium-fast"
        ],
        "Died": [
            "April 8, 1995, Dene Park, Shipbourne, Tinbridge, Kent (aged 89 years 16 days) "
        ],
        "Full name": [
            "Maurice James Carrick Allom"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Surrey"
        ],
        "Other": [
            "Administrator"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        " New Zealand, now 21 for 7, recovered to 112 but lost in just under two playing days, and Allom was aglow after taking 5 for 38 and 3 for 17, including the 10th hat-trick in Test history, which was watched by Hugh Trumble, then 62, who had taken two hat-tricks for Australia early this century.",
        "Born in Northwood, Middx on March 23, 1906, Allom was to play in only four more Tests, the other three in New Zealand and one in South Africa a year later, finishing with 14 wickets in 18.93. Between 1927 and 1937 he played in 100 matches for Surrey, though hardly any after 1933, and was appointed as the club's vice-captain. His most productive season was 1930, when he took 108 wickets at 23.33, twice getting Bradman. During those happy summers his bounce and movement through the air and off the pitch won him prize wickets with regularity, Ames, Hammond, Headley, Hendren, Hobbs, Leyland, Sandham and Woolley among them. He played in eight Gentlemen v Players matches.",
        null,
        "Educated at Wellington, Maurice James Carrick Allom was a Cambridge Blue in 1927 and'28, and secured his best figures when the university played the Army in 1927: 9 for 55. His 605 first-class wickets cost 23.62 each.",
        "Elevated a member of MCC in 1925, he was joint-senior member at the time of his death, on April 8, and it was his fate to be president of the club, and also chairman of the Cricket Council; during the storm over the proposed visit to England of the 1970 South African team, a tour which Lord's was compelled to cancel after pressure from Home Secretary Callaghan.",
        " Allom was also president of Surrey, for whom his son - who was even taller at 6ft 9ins - played one match in 1960. A jazz saxophonist in his undergraduate days, Maurice Allom was married for almost half-a-century to Pamela, and when she died in 1980 he married for the widow of pre-war Lancashire captain Peter Eckersley, who was killed on active service in 1940.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}