{
    "batting_averages": [
        {
            "": "Tests",
            "100": "9",
            "50": "10",
            "6s": "7",
            "Ave": "46.06",
            "Ct": "13",
            "HS": "187",
            "Inns": "65",
            "Mat": "41",
            "NO": "5",
            "Runs": "2764",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "80",
            "50": "154",
            "6s": "",
            "Ave": "40.50",
            "Ct": "246",
            "HS": "263",
            "Inns": "932",
            "Mat": "686",
            "NO": "101",
            "Runs": "33660",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "97.50",
            "BBI": "3/91",
            "BBM": "3/91",
            "Balls": "1103",
            "Econ": "3.18",
            "Inns": "27",
            "Mat": "41",
            "Runs": "585",
            "SR": "183.8",
            "Wkts": "6"
        },
        {
            "": "First-class",
            "10": "1",
            "4w": "",
            "5w": "11",
            "Ave": "29.31",
            "BBI": "8/63",
            "BBM": "",
            "Balls": "28971",
            "Econ": "2.82",
            "Inns": "",
            "Mat": "686",
            "Runs": "13659",
            "SR": "62.1",
            "Wkts": "466"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/bodyline/content/story/316843.html",
        "http://www.espncricinfo.com/bodyline/content/story/316838.html",
        "http://www.espncricinfo.com/ci/content/story/316652.html",
        "http://www.espncricinfo.com/bodyline/content/story/316500.html",
        "http://www.espncricinfo.com/bodyline/content/story/316173.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=16287"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/99900/99960.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/99900/99960.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/99900/99960.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nJuly 20, 1900, New Park, Harrogate, Yorkshire "
        ],
        "Bowling style": [
            "Slow left-arm orthodox"
        ],
        "Died": [
            "January 1, 1967, Scotton Banks, Harrogate, Yorkshire (aged 66 years 165 days) "
        ],
        "Full name": [
            "Morris Leyland"
        ],
        "Major teams": [
            "England,",
            "Maharaja of Patiala's XI,",
            "Yorkshire"
        ]
    },
    "profile_info": [
        "\nThe death of an illustrious cricketer is always sad ; it is doubly sad when the one who goes has long stood as a symbol of the game's combined strength and merriment. Maurice Leyland, who died on January 1, aged 66, was exactly as old as this part-worn century and his first-class career embraced the inter-war years in addition to the vital season afterwards. The body of English cricket in those years was built on firm bone and muscle, but, more often than not, Leyland was its spinal column. Your Yorkshire cricketer usually has, and admits to having, certain major qualities: sturdiness, independence and a refusal to consider defeat. Leyland had all these virtues and more; where he differed from many was that his fighting was done not grimly, but with a quizzical smile; the harder the battle, the stouter the resolution and the\nbroader the smile. \n",
        "Although he bothered little about his figures, they are none the less impressive. In all, he scored 33,660 runs ; of these 26,191 were for Yorkshire and 2,764 for England. These three totals give a general average of 40-50 ; for his county 41.05 and in his 41 Tests 46.06. If his average is higher for England than for Yorkshire, this was only partly significant. Assuredly the hardest task called out the best in the man and of his 80 centuries, nine were in Tests, seven of them against Australia but, while most cricketers regard England as an extension of their own counties, to Yorkshiremen England is a not unimportant part of Yorkshire. For Leyland, I suspect, a hundred\nagainst Australia was as richly satisfying as one in a Roses match - almost.",
        "Because so many of his grandest efforts have been made with his broad back against the wall, he has often been seen as his side's rescuer-in-chief, but his batting was by nature an attacking weapon. At Scarborough in 1932 he and Sutcliffe hit 102 off half a dozen overs and, under sun or cloud, his personal philosophy was evident: \"Watch out when you have to ; hit out whenever you can, and think on all the time what you're there for.\"",
        "Leyland anecdotes are innumerable, but different. Many cricket stories are apocryphal in the sense that they are traditional tales, buckled on to the most colourful character of the period, though, to be fair, legends do not become encrusted upon nonentities. But Leyland stories have a personal hallmark, never depending for their point on those words which are the life's blood of the BBC's television drama. His humour was good humour, with the turn of the jest, more likely than not, against himself. When Hutton in his first Yorkshire match was run out for a duck, Leyland said: \"Never mind, lad,\nyou've started at bottom.\" Four years later these two shared a partnership of 382 in what will always be known as Hutton's match. Hutton's 364 took 1321 minutes while Leyland's 187 lasted half that time. Reproved for his slowness, Leyland, who had been dropped in the previous Test, replied with a straight face: \"Well, you see, I was playing for my place.\" When Hutton's massive innings ended at last, there was an equally massive rush to celebrate and Leyland, winning the race to the bar by a short head, demanded two bottles of champagne.\"Why two bottles, Maurice ?\" \"One for thee, Len, and one for me.\"",
        "His modesty had a rueful smile. Reproved for getting out to a dolly catch off a near-wide, \"Well, now,\" he apologised, \"I don't get a lot o' practice against that sort.\"",
        "This modesty was a part of his quiet confidence. \"Nervous ? Of course I'm nervous. There you are, out in t' middle an there's 30,000 people all knowing better what to do than you do.\" Talking things over, after a bombing raid of bumpers, he reflected: \"Nobody likes 'em, but some of us don't let on.\"",
        "If he knew himself to have the measure of the great O'Reilly, who was no paper tiger, he also retained the respect of one master for another. Describing an over of fearsome hostility, he said: \"First he bowled me an off-break, then he bowled me a leg-break; then his googly, then a bumper, then one that went with his arm . . . .\"",
        "\"But that's only five, Maurice. What about the last\none ?\"",
        "\"Oh, that,\" said Maurice deprecatingly. \"That was a\nstraight 'un and it bowled me.\"",
        "The vintage Leyland story concerns a Test in which Australia had amassed a mammoth score and Leyland went in, bent on what seemed his regular task, to retrieve England's bad start. He did his duty faultlessly but, farm the bowling as he might, wicket after wicket fell and a quarter of an hour before the close England, with seven wickets down, were still some 300 behind. Batsman No. 9 hit his first ball into the covers and started on a nimble single. Leyland waved his eager partner back. \" Wait your hurry, Mr. Robins. We shan't get 'em all tonight.\"",
        "He tended to laugh at the notion of himself as a left-hand slow bowler in the county that gave birth to Rhodes, Kilner and Verity. Nevertheless, he came of bowling stock. His father, afterwards a dedicated groundsman, had been a prolific wicket-taker in club and minor counties cricket. Maurice, in fact, took more than 400 wickets for Yorkshire and in his last season he helped to clinch his county's championship with 7for 36 against Warwickshire. He was credited with the invention of the ball called \"The Chinaman,\" which was a left-hander's unexpected serenity. However depressed we might be, life seemed richer when we saw that burly figure striding to the crease: blue eyed, broad shouldered, fore-arms borrowed from a blacksmith, and cap tilted, not as much as Roy Kilner's, but more rakishly than Admiral Beatty's. England was back on the right road.",
        "In the rugged masculine world of Test cricket, nobody has to be liked, much less loved. Consider Plink, Plonk or, if you like, Plunk; we admire them for their splendid skills and not - bless my soul! - for their pretty ways. Men of principle can be harsh and stiff-necked; amiable companions can be anything but men of principle. But once in a generation comes a man whose unchallenged integrity and humorous friendliness are in perfect balance. Such a man was Maurice Leyland, whose epitaph  - and he would have made a rare joke of it - might link with that of Samson's lion: Out of the Strong came forth Sweetness . . . .",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}