{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "1",
            "Ave": "6.66",
            "Ct": "0",
            "HS": "18*",
            "Inns": "5",
            "Mat": "3",
            "NO": "2",
            "Runs": "20",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "16",
            "50": "83",
            "6s": "",
            "Ave": "25.37",
            "Ct": "257",
            "HS": "185",
            "Inns": "681",
            "Mat": "389",
            "NO": "49",
            "Runs": "16038",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "56.50",
            "BBI": "2/98",
            "BBM": "2/102",
            "Balls": "492",
            "Econ": "2.75",
            "Inns": "5",
            "Mat": "3",
            "Runs": "226",
            "SR": "123.0",
            "Wkts": "4"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "11",
            "Ave": "30.70",
            "BBI": "8/31",
            "BBM": "",
            "Balls": "22093",
            "Econ": "2.92",
            "Inns": "",
            "Mat": "389",
            "Runs": "10778",
            "SR": "62.9",
            "Wkts": "351"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155414.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/042002/035449.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJuly 5, 1923, Stockport, Cheshire "
        ],
        "Bowling style": [
            "Right-arm fast-medium"
        ],
        "Died": [
            "July 30, 1984, Southampton, Hampshire (aged 61 years 25 days) "
        ],
        "Full name": [
            "Maurice Fletcher Tremlett"
        ],
        "Major teams": [
            "England,",
            "Central Districts,",
            "Somerset"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nMaurice Tremlett, who died in a Southampton hospital on July 30 at the age of 61, was Somerset's first professional captain (1956-59) and, it could be argued, the best they ever had. Despite that almost languid, easy-going persona, his cricketing mind was sharp and unwavering. His tactical sense was intuitive, unconsciously backed by a rare, accumulated knowledge of the technical flaws of most of the opponents he was likely to meet. \n",
        "He was born in Stockport but was as Somerset in approach as Bicknoller's Harold Gimblett, who was at times a little wary, even jealous some implied, of Tremlett's glamorous reputation as a hitter and pilferer of headlines from the county's marvellous opening batsman. In fact, they had much in common, even if the younger man never really acquired the skills and refinements of Gimblett. But they both agonised.",
        "When Tremlett suddenly lost everything as a bowler -- rhythm, line, length and, of course, confidence -- he visibly despaired. He was still impressive fast-medium in the nets; on the field he was an embarrassing wreck. He was desperately depressed, and insensitive bellows from the boundary from those who didn't understand his psycho-logical battle compounded the misery. The trouble was that too many people, some in high places, had told him how he could become a better bowler. He listened to the varying counsel, became thoroughly confused and eventually decided to stick to batting, apart from a few token overs of offspin.",
        "Yet he must have been very nearly a fine bowler. He accounted for Len Hutton twice in a match and bowled the wonderful Frank Worrell for a 'duck' in a match against Jamaica. That was during the 1947-48 tour of West Indies. Tremlett played three times for his country. It was right that he should have been recognised, wrong that too many pundits, influenced by romantic West Country notions, were on the strength of his early impact talking of him absurdly as the next Maurice Tate.",
        "Everyone seems to remember his first county match, and quite right too. It was at Lord's in May, 1947, when Somerset beat Middlesex by one wicket. 'As noble a game of cricket as any man could ever hope to play in or any spectator to watch,' wrote The Times. It was Maurice Tremlett's match. He took eight wickets, including five in the second innings (there was a 5 for 8 spell) and won the game in the last-wicket stand with rotund Horace Hazell, the most reliable No. 11 in the business. Tremlett's perfunctory six into the members' stand off Young was the dramatic climax. Middlesex lined up to applaud him off the field.",
        "He grew up in Taunton, went to the local Priory School, and then took a clerical job at the county ground to be nearer his heroes. There was an opportunity for some cricket while in the army. Gubby Allen noted the name and would have liked to have seen this dashing allrounder playing for Middlesex. There was, indeed, an overture, but Tremlett's heart never really strayed too far from the Blackdown Hills and the Quantocks. He played for Somerset from 1947 to 1960 and scored 12 centuries for them. There were more than 16,000 runs (av 25.37) and 351 wickets.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}