{
    "batting_averages": [
        {
            "": "Tests",
            "100": "1",
            "50": "5",
            "6s": "14",
            "Ave": "25.48",
            "Ct": "11",
            "HS": "100*",
            "Inns": "52",
            "Mat": "39",
            "NO": "5",
            "Runs": "1198",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "23",
            "50": "93",
            "6s": "",
            "Ave": "25.04",
            "Ct": "283",
            "HS": "203",
            "Inns": "970",
            "Mat": "679",
            "NO": "103",
            "Runs": "21717",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "1",
            "4w": "7",
            "5w": "7",
            "Ave": "26.16",
            "BBI": "6/42",
            "BBM": "11/228",
            "Balls": "12523",
            "Econ": "1.94",
            "Inns": "68",
            "Mat": "39",
            "Runs": "4055",
            "SR": "80.7",
            "Wkts": "155"
        },
        {
            "": "First-class",
            "10": "44",
            "4w": "",
            "5w": "195",
            "Ave": "18.16",
            "BBI": "9/71",
            "BBM": "",
            "Balls": "150461",
            "Econ": "2.01",
            "Inns": "",
            "Mat": "679",
            "Runs": "50571",
            "SR": "54.0",
            "Wkts": "2784"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/751685.html",
        "http://www.espncricinfo.com/blogs/content/story/638394.html",
        "http://www.espncricinfo.com/bodyline/content/story/316843.html",
        "http://www.espncricinfo.com/bodyline/content/story/316838.html",
        "http://www.espncricinfo.com/ci/content/story/316652.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=21462"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/032004/051066.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/032004/051066.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/032004/051066.icon.jpg"
    ],
    "personal_info": {
        "Also known as": [
            "Chubby"
        ],
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMay 30, 1895, Preston, Brighton, Sussex "
        ],
        "Bowling style": [
            "Right-arm medium-fast, Right-arm medium, Right-arm offbreak"
        ],
        "Died": [
            "May 18, 1956, Wadhurst, Sussex (aged 60 years 354 days) "
        ],
        "Full name": [
            "Maurice William Tate"
        ],
        "Major teams": [
            "England,",
            "Sussex"
        ],
        "Playing role": [
            "Allrounder"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        "Maurice Tate was the son of Fred Tate, the Sussex and England cricketer whose name will ever be associated with the 1902 Test at Old Trafford, which England lost by three runs. Fred Tate missed a vital catch and was last out when England wanted only four runs to win. In his reminiscences, published in 1934, Maurice Tate wrote that his father's greatest ambition was to see his son playing for England and retrieving his own tragic blunder. How well the son atoned for the father's misfortune! Maurice Tate began as a slow off-break bowler and had been playing some years before he developed his fast-medium action which gave him a deceptive swerve and tremendous pace off the pitch. He was probably the first bowler deliberately to use the seam and many of the best batsmen of the day regarded him as the most dangerous bowler they had ever played against.",
        "He will be remembered as one of the greatest-hearted bowlers in the game -- and one of cricket's most lovable and colourful personalities. He was an inveterate fun-maker and wherever he went he found new friends. He could go on bowling for hours, keeping an immaculate length and seeming to enjoy every moment of the game. A large and amiable man, with many of the characteristics of the true rustic, his broad grin and large feet were a gift to contemporary cartoonists.",
        null,
        "\"Tate, I must say at once, was the greatest bowler our county has produced. Curiously, when I first played for Sussex, Maurice used the same run-up and style of delivery as his father -- a slow bowler! A sheer piece of luck caused Maurice to change his methods. Sussex had batted very badly in 1922, and when we had a day off the whole team practised at the nets. Maurice Tate bowled me several of his slow deliveries, then down came a quick one which spreadeagled my stumps. He did this three times. I went up to him and said: `Maurice, you must change your style of bowling immediately.' My hunch paid. In the next match against Kent at Tunbridge Wells, Maurice, in his new style as a quick bowler, was unplayable. He took three wickets in four balls and eight in the innings for 67. That was the turning-point in his career.\"",
        "In the Test Trial at Lord's in 1923, he took five wickets without a run being scored from him after The Rest had made 200 for four wickets. They were out for 205. The following year Maurice and I bowled out South Africa at Birmingham for 30 -- a day neither of us will ever forget. I was fortunate to take six for seven runs, and Maurice captured the other four for 12. In the second innings we shared nine wickets and England won by an innings. The tide flowed for Sussex bowlers about that time, for we had previously dismissed Surrey for 53 at The Oval, and in the Whitsuntide match at Lord's had disposed of Middlesex in their second innings for 41.",
        "Maurice was a member of my 1924-25 M.C.C. team to Australia and on this tour he beat Arthur Mailey's record of 36 wickets in a Test series by taking 38. He bowled  Mailey out to gain his 37th success! Besides being a great bowler, Maurice was a hard-hitting batsman with a wealth of strokes. He scored 17,518 runs (average 24.19) for the county and took 2,223 wickets (average 16.34). For seven consecutive seasons he did the double and in 1929 he took over 100 wickets for the county alone and scored more than 1,000 runs in first-class cricket. In fact, with the exception of 1933 when a damaged foot kept him out of the last three matches (he had taken 99 wickets), he never failed to take over 100 wickets for Sussex.",
        "In 1953 Alec Bedser beat Tate's Test record by taking 39 wickets in a series, and many times since I have been asked how I compare Bedser with Maurice. My answer is: `They are two very great bowlers.' Having said that, I still think that  Maurice Tate just stands out as the superior bowler of the two, bearing in mind the strength of the Australian batting in the 1924-25 series. But it is a very close thing indeed and one must not forget that Bedser had to contend with Bradman between 1946 and 1948.",
        " Tate played in 20 consecutive Test matches against Australia and represented  England in a further 19 Tests against South Africa, India and the West Indies. In all he took 155 Test wickets -- a feat excelled only by A. V. Bedser and S. F. Barnes.",
        "Tate was so consistently successful as a bowler that the quality of his batting is now often overlooked. Yet he was one of the best all-rounders of his generation. He scored 100 not out against South Africa in the Lord's Test in 1929. Eight times he completed the cricketers' double of 1,000 runs and 100 wickets in a season -- and in 1923, 1924 and 1925 his bag of wickets topped 200. Fourteen times he took over 100 wickets in a season.",
        "As a batsman, his best season was 1927, when he scored 1,713 runs, including five centuries. In 1922 he was the best all-rounder in the country, taking 118 wickets and scoring only 22 short of his 1,000. In 1921 he shared with Bowley a second wicket partnership of 385 against Northants -- a Sussex record.",
        "Tate was the first professional ever to captain Sussex -- the honour later fell to James Langridge -- and after his retirement he was elected an honorary life member of the County Club. He was also one of the former professionals similarly honoured by M.C.C. in 1949.",
        "When he retired from first-class cricket, Tate took over the licences of several Sussex inns and for a number of years coached the boys of Tonbridge School.",
        "Tributes included the following:",
        null,
        null,
        "A. E. R. Gilligan: His death has come as a great shock to everybody in Sussex, and in fact the whole of the cricket world. Not only was Maurice a great bowler; he was a very great sportsman. He played cricket for the real joy and fun of it. It was his life.",
        null,
        null,
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}