{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "1",
            "6s": "2",
            "Ave": "20.36",
            "Ct": "1",
            "HS": "61",
            "Inns": "13",
            "Mat": "9",
            "NO": "2",
            "Runs": "224",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "29",
            "50": "82",
            "6s": "",
            "Ave": "29.78",
            "Ct": "280",
            "HS": "233",
            "Inns": "626",
            "Mat": "388",
            "NO": "37",
            "Runs": "17544",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "9",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "88.75",
            "BBI": "1/4",
            "BBM": "",
            "Balls": "390",
            "Econ": "5.46",
            "Inns": "",
            "Mat": "388",
            "Runs": "355",
            "SR": "97.5",
            "Wkts": "4"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/315702.html",
        "http://www.espncricinfo.com/wcm/content/story/140810.html",
        "http://www.espncricinfo.com/ci/content/story/124731.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154690.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/032004/050635.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/032004/050635.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/032004/050635.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMarch 16, 1906, Cardiff, Glamorgan, Wales "
        ],
        "Bowling style": [
            "Right-arm offbreak"
        ],
        "Died": [
            "August 5, 1944, near Montchamp, France (aged 38 years 142 days) "
        ],
        "Full name": [
            "Maurice Joseph Lawson Turnbull"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Glamorgan,",
            "Wales"
        ]
    },
    "profile_info": [
        null,
        null,
        null,
        " Maurice was such a grand person. So often have I seen him go into action and never have I seen him rattled. He was always the same: quiet, confident, thinking always of his men and disregarding all danger to himself. A really great person. This extract from a letter written from France is a straightforward appreciation of him as a soldier; there are other and sometimes more fulsome tributes paid to him. But I choose this one because it also exactly describes his leadership of Glamorgan in the days of peace, and shows that in his greatest Test of all he did not alter his style but played his own game to the end.",
        "Maurice Turnbull played cricket for England and Rugby football and hockey for Wales; he also held the South Wales Squash Rackets Championship. He captained Cambridge at cricket, was a member of the Test Match Selection Committee, and Captain and Secretary of the Glamorgan Club since 1930. He was top scorer in his first innings for Glamorgan (40 v. Lancashire in 1924) and was again top scorer in his last innings (156 v. Leicestershire, 1939). In between those dates he made, in first-class cricket, nearly 18,000 runs, averaging 30 per innings, 29 centuries, and held over 300 catches.",
        "These are the bare statistics; as he was only 33 when the war broke out, they are formidable achievements fully entitling him to the position he held in the public estimation--a very prominent games-player. But to those of us who knew him well mere facts and figures do him scant justice. A great player he may have been, but an astute brain made him an even greater captain -- the best of his generation who never captained England -- and there is little doubt that he would have become one of the game's foremost administrators. And finally, what a grand fellow. ",
        "I first met Maurice in July 1924, when as a boy of 17, fresh from many triumphs at Downside, he came down to play against Lancashire at Swansea. In the nets at Cardiff the day before he batted so badly that he wondered if he ought not to stand down. Luckily he played, and by making 40 in the first innings and 16 in the second he contributed very largely to a Glamorgan victory - a sensation in those days. The wicket was never easy (153 was the highest total of the four innings), but he faced that celebrated trio of bowlers, McDonald, Parkin and R. Tyldesley, all at their best, with the assurance of one accustomed to meet them regularly and with success. It was not a case of novice's luck, but of sound and mature judgement worthy of one double his age. Which encourages me to  believe that, when a year or so later he sent for the majestic wine waiter of a London hotel and administered a rebuke on the quality of the claret, he was probably quite right!",
        "Glamorgan became a first-class county in 1921, but, except for one good season and one or two sensational victories, failed to live up to that high-sounding title. The side sadly lacked a regular captain, and by the close of the 1929 season, during which it had no less than seven leaders, it resembled a bedraggled flock without a shepherd. Moreover, no public likes seeing its side beaten too frequently: the English are annoyed while the Welsh are hurt, but both show their displeasure in the same way - they stay away. It is not surprising, therefore to find that Glamorgan, with little tradition and a very small membership, were in dire financial trouble.",
        "At this unpropitious moment Maurice took charge, comforted perhaps by the knowledge that any change he could bring about was almost bound to be for the better. And change there was, not only in the playing results but in the whole atmosphere: and this better spirit enabled the Club to overcome the financial disaster, which was shortly to face it.",
        "Noteworthy success did not come all at once, but by linking Monmouthshire with Glamorgan, running a Minor Counties side, and going all out to encourage local talent, he not only found players but widened the interest; and earned his reward in 1937 when Glamorgan won 13 matches in all and finished seventh in the County Championship.",
        "With all due respect, the general public is not frightfully interested in the doings of Boards of Control, Committees and Secretaries; it is far more concerned with what happens on the field of play between 11.30 and 6.30. But Maurice's administrative achievements were so great that they must be referred to here.",
        "Briefly, then, Glamorgan at the end of 1932 were in debt to the tune of about £5,000, and as something drastic had to be done, and quickly, an appeal was launched. Now Glamorgan knew all about appeals to the sporting public -- it had lived on them since 1921 -- but nothing like this one organised by Maurice ever happened before. Whereas a faithful few contributed time and again, on this occasion nobody was left out: every town and every village was encouraged to run a dance or similar function, and to each of these Turnbull made a point of going. If the figures were known, the number of miles he danced for Glamorgan might be favourably compared with the number of runs scored by some of the side! Anyhow, this big effort realised £3,500 and, maybe, gave him valuable ideas, for whenever subsequently funds ran low he found means to supplement them.",
        "He was indeed a most efficient Secretary: always on the job, and his suggestions were based on practical knowledge and experience. He went all out, successfully, for an increased membership and paid great attention to the comfort of the spectators. In short, by 1939 he converted a shambling, shamefaced, bankrupt into a worthy and respected member of society with a bank balance of £1,000.",
        "For a batsman who appeared in nine Tests and held for many years what amounted to a standing invitation for the Gentlemen v. Players, an average of 30 is moderate enough: honest toilers with no great gifts have attained better figures. The reason is that Maurice never made runs unnecessarily; he seldom indulged in those large, average-raising, but meaningless, innings which with everything in the batsman's favour might have been played by almost anybody who could bat at all. An innings by him invariably had some definite effect on the game, and he was at his best when others were failing or when runs were required at a pace to beat the clock. He always looked a class batsman and was always attacking the bowler.",
        "In his early days an on-side player, he soon developed all the recognised strokes and a few of his very own, which, though they did not appeal to the purist, were extremely good value for the ordinary spectator and poison to the bowler. Contrary to some belief, bowlers do not enjoy being hit any more than a fox enjoys being hunted; but if they must receive punishment, let it be correctly administered and according to the book. I only bowled against him once: it was most disquieting!",
        "From all of which it can be gathered that an innings by him was a delight to watch; it contained that element of impudence and unorthodoxy which added spice to the rather stolid pudding of accepted county batmanship.",
        "It is difficult to state with certainty which were his best seasons or his best innings, but his appearances in Tests were between 1930-1936, when he played against South Africa, five times, and New Zealand, once, abroad; and against New Zealand, West Indies and India in England. His most noteworthy innings, looked at in retrospect, was perhaps his double century (one of three he made altogether) against Larwood and Voce at Cardiff in the last match of 1932 season. Three months later this celebrated pair, bowling in exactly the same way, were causing a rumpus in Australia. In the same year, on a crumbling Swansea wicket, against Parker and Goddard, and incidentally the clock, he played a magnificent match-winnings innings of 119 which enabled Glamorgan to win with ten minutes to spare.",
        "I say No; but with the reservation that it is only human to get to appreciate highly that which you see often and at its best. Which may account, incidentally, for any element of truth in the cheap gibe that a cricketer must play for a fashionable county or do well at Lord's to gain official recognition. But he certainly was very good and must have been near to being selected to lead England: he did actually captain one of the sides in a Test trial match.",
        "Above all things Maurice was a quiet captain: there was no fuss, no gesticulating, no shouting on the field. He never got rattled or irritable and always contrived to make the bowlers feel that, although the score board said otherwise, they were really doing pretty well. A grand boss to work for: I always bowled much better for him than I ever did for myself or anybody else. As with his batting, he never played for safety, but so sound was his judgment that decisions which appeared almost foolhardy at the time turned out to have been extremely well-calculated risks.",
        "Needless to say, the professionals thought the world of him; and well they might, for nobody kept their interests more at heart or gave them sounder advice. The result was that he always got the best out of what was really a moderate side and did not have to contend seriously with those petty grievances and squabbles which may arise. For cricketers, like other public entertainers, can grow temperamental. Those who are not playing well, or are out of luck as it is politely called, become moody or depressed; others, while welcoming favourable notices, are deeply wounded by any hint of adverse criticism.",
        "The example he set in the field, of course, accounted largely for his beneficial influence. He could field anywhere, but short-leg was his real position: the risks he ran and the catches he caught there had to be seen to be believed. Sometimes he literally picked the ball off the defensively held bat and at others he would hang on to red-hot drives although standing but a few yards away from the batsman. Such efforts inspired the bowler and convinced the luckless batsman that there was indeed no justice in the world.",
        " Quiet, confident, thinking always of his men --yes, it is a good description.",
        null,
        "He will be sadly missed--by sport generally, by cricket in particular; but most of all by his friends. As one of them -- and, when you have knocked about England together as much as he and I did, you get to know each other pretty well -- I say farewell to a fine player, a great sportsman and a grand fellow.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}