{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "8.00",
            "Ct": "0",
            "HS": "8*",
            "Inns": "4",
            "Mat": "2",
            "NO": "1",
            "Runs": "24",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "0",
            "6s": "",
            "Ave": "10.16",
            "Ct": "32",
            "HS": "45*",
            "Inns": "129",
            "Mat": "88",
            "NO": "40",
            "Runs": "905",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "35.00",
            "BBI": "2/39",
            "BBM": "2/92",
            "Balls": "126",
            "Econ": "5.00",
            "Inns": "3",
            "Mat": "2",
            "Runs": "105",
            "SR": "42.0",
            "Wkts": "3"
        },
        {
            "": "First-class",
            "10": "9",
            "4w": "",
            "5w": "38",
            "Ave": "21.55",
            "BBI": "8/48",
            "BBM": "",
            "Balls": "14570",
            "Econ": "3.64",
            "Inns": "",
            "Mat": "88",
            "Runs": "8860",
            "SR": "35.4",
            "Wkts": "411"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154770.html"
    ],
    "latest_photos": [],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nOctober 10, 1884, Clapham, London "
        ],
        "Bowling style": [
            "Right-arm fast"
        ],
        "Died": [
            "March 3, 1935, Southborough, Surbiton, Surrey (aged 50 years 144 days) "
        ],
        "Full name": [
            "Neville Alexander Knox"
        ],
        "Major teams": [
            "England,",
            "Surrey"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nMajor Neville Alexander Knox, died at Surbiton, Surrey on March 3, at the age of 50. His cricketing career was brief but brilliant. Born on October 10, 1884, he played both cricket and Rugby Football for Dulwich College. He appeared for Surrey against Lancashire in 1904 and took four wickets. Next season he rose to fame in remarkable fashion and had a big share in winning back for Surrey, after a year of extreme depression, a high position among the counties. For the county he took 121 wickets, and in all matches dismissed 129 batsmen at an average of less than 22 runs apiece. In the following year he did even better, taking 144 wickets for 19.63 runs each and achieving a notable triumph for the Gentlemen against the Players at Lord's. By taking 12 wickets for 183, he had a large share in a victory for the Gentlemen by 45 runs; seven of his victims were clean bowled. It was astonishing how H. Martyn, the Oxford and Somerset wicket-keeper, stood up to his tremendously fast bowling. In the same game Arthur Fielder, the Kent fast bowler, performed the feat--never previously accomplished in this fixture--of taking, at a cost of 90 runs, all ten wickets in the Gentlemen's first innings. \n",
        "The first-class career of Knox ended in 1910. He developed an acute form of shin soreness, and had to struggle against chronic lameness. He often played when he ought to have been resting, and only sheer pluck and resolution enabled him to get through the work he did. Loose limbed and standing well over six feet, Knox made full use of his physical advantage. His long and peculiar run, starting from near deep mid-off, made the length and direction of the ball difficult to judge. He bowled at a great pace with undeniable off-break, and his good length deliveries often reared up straight.",
        "In 1907 he played for England against South Africa in the Second and Third Test Matches at Leeds and Kennington Oval, without, however, achieving much sucess. In last year's Almanack Hobbs, referring to fast bowlers, said:-- Being a member of the same county side, I only played against N. A. Knox in Gentlemen and Players matches and games of a similar description, when he was probably past his best, but I think he was the best fast bowler I ever saw.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}