{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "4",
            "6s": "0",
            "Ave": "25.37",
            "Ct": "14",
            "HS": "99",
            "Inns": "34",
            "Mat": "20",
            "NO": "2",
            "Runs": "812",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "27",
            "50": "83",
            "6s": "",
            "Ave": "31.17",
            "Ct": "328",
            "HS": "183*",
            "Inns": "658",
            "Mat": "446",
            "NO": "75",
            "Runs": "18173",
            "St": "1"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "33.66",
            "BBI": "3/67",
            "BBM": "5/117",
            "Balls": "1662",
            "Econ": "2.55",
            "Inns": "20",
            "Mat": "20",
            "Runs": "707",
            "SR": "79.1",
            "Wkts": "21"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "5",
            "Ave": "30.48",
            "BBI": "6/29",
            "BBM": "",
            "Balls": "21080",
            "Econ": "2.42",
            "Inns": "",
            "Mat": "446",
            "Runs": "8506",
            "SR": "75.5",
            "Wkts": "279"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/92745.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155344.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154631.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/64000/64064.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/64000/64064.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/64000/64064.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMarch 19, 1915, Gawber, Barnsley, Yorkshire "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "October 3, 1989, Lodge Moor, Sheffield, Yorkshire (aged 74 years 198 days) "
        ],
        "Full name": [
            "Norman Walter Dransfield Yardley"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Yorkshire"
        ],
        "Other": [
            "Administrator, Commentator, Author"
        ]
    },
    "profile_info": [
        "\nEngland's captain in succession to Wally Hammond, Norman Yardley, who died on Oct 4 after suffering a stroke, was the kindliest of men, gentle of demeanour, and one of the sadder casualties of Yorkshire's second ` Boycott revolt' in the mid-1980s, when he resigned as president in the wake of the no-confidence vote. \n",
        " Yardley's distinguished sporting life displayed many facets in his earlier days. At Cambridge he won Blues at cricket, squash, rugby fives and hockey, and was North of England squash champion six times. Having made a name as a schoolboy cricketer as St Peter's, York, he went on to play in the Varsity matches of 1935 to 1938, scoring 90 in the second match and 101 in the third. His great friend Paul Gibb made 122 in the fourth, when Yardley was skipper.",
        " Norman Walter Dransfield Yardley, born in Royston, near Barnsley on March 19, 1915, made his Yorkshire debut in 1936 and played his last match for the county in 1955, during which time he scored over 11,000 runs, average 31.95, with 17 centuries, a solid figure in the middle order who also bowled workmanlike medium-pacers to take 195 wickets at just below 30 apiece. Add to this his 220 catches and his captaincy, from 1948 to 1955, of a team containing some strong-willed characters, and his place among Yorkshire captains may be seen as pre-eminent. He led the White Rose county to the Championship in 1949 (shared with Middlesex) and to runners-up position four times in the next six years.",
        "Having toured India with Tennyson's side in 1937-38, he was chosen for MCC's tour of South Africa the following winter, and made his Test debut at Johannesburg in the opening Test, having been England's 12th man in the preceding home series against Australia. He scored only 7 at The Wanderers, and did not bowl, and that was the end of his Test cricket until after the war, during which he served in the Green Howards in the Middle East and Italy, being wounded in the Western Desert.",
        "Chosen at Hammond's vice-captain on the first post-war tour of Australia, Yardley earned enduring fame by capturing Bradman's wicket ( l. b. w., bowled, and c&b) in three successive innings - at Sydney when the Australian captain had made 234, and twice at Melbourne, when Yardley took five wickets in the match and scored 61 and 53 not out, the first England player to chain a pair of half-centuries to five wickets in a Test match.",
        "He did little else in the series, though with Hammond's indisposition before the final Test, at Sydney, Yardley became England captain. He led England through the next two home series, winning against South Africa (3-0) in 1947, when Compton and Edrich were so destructive with the bat, and losing 0-4 to the 1948 Australians. In the Nottingham Test against South Africa he had made his highest Test score: 99, caught by Tuckett off Ossie Dawson from a nervy stroke, ironic in that he was renowned for his leg-side play. His stand with Compton had been worth a record 237, and Evans went on to make 74 before Martin and Hollies added a vital 51 for the last wicket to put victory beyond South Africa's grasp. The earlier Springbok stand of 319 by Melville and Nourse was a Trent Bridge Test record for any wicket until this summer, when Marsh and Taylor made their 329.",
        "Business kept Yardley from the 1947-48 tour of West Indies, but in 1948 he led England with dignity as the Australian armoured division rolled through the defences. He contributed 150 runs in nine innings, and chipped in with nine wickets at 22.67 to head the averages.",
        "He had to miss the 1948-49 South African tour, and did not play in the 1949 home series against New Zealand, when F. G. Mann and F. R. Brown captained England in two Tests each. But in 1950 he led his country in the first three Tests against West Indies, the second of which was lost, at Lord's, giving the visitors their first victory on English soil. Brown took over for the fourth Test and went on to led England in Australia in 1950-51. Yardley, unavailable for Australia, had played his last Test.",
        "Despite the calls of business and the inconvenience of lumbago, he played on until he was 40, having been chairman of Test selectors in 1951 and 1952. Then came journalism and broadcasting, his tact only once deserting him: when Brian Close's rash dismissal in the Old Trafford Test of 1961 prompted his former captain to expostulate with some severity.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}