{
    "batting_averages": [
        {
            "": "Tests",
            "100": "7",
            "50": "21",
            "6s": "9",
            "Ave": "47.63",
            "Ct": "33",
            "HS": "205*",
            "Inns": "83",
            "Mat": "51",
            "NO": "9",
            "Runs": "3525",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "170",
            "50": "272",
            "6s": "",
            "Ave": "50.80",
            "Ct": "759",
            "HS": "301*",
            "Inns": "1300",
            "Mat": "833",
            "NO": "166",
            "Runs": "57611",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "31.00",
            "BBI": "1/27",
            "BBM": "1/27",
            "Balls": "47",
            "Econ": "3.95",
            "Inns": "2",
            "Mat": "51",
            "Runs": "31",
            "SR": "47.0",
            "Wkts": "1"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "1",
            "Ave": "54.76",
            "BBI": "5/43",
            "BBM": "",
            "Balls": "4830",
            "Econ": "3.19",
            "Inns": "",
            "Mat": "833",
            "Runs": "2574",
            "SR": "102.7",
            "Wkts": "47"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/714423.html",
        "http://www.espncricinfo.com/magazine/content/story/710639.html",
        "http://www.espncricinfo.com/wisdencricketer/content/story/347943.html",
        "http://www.espncricinfo.com/wisdencricketer/content/story/217362.html",
        "http://www.espncricinfo.com/cricketer/content/story/141260.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=14158"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/042004/051415.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042004/051415.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042004/051415.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nFebruary 5, 1889, Turnham Green, Middlesex "
        ],
        "Bowling style": [
            "Right-arm slow"
        ],
        "Died": [
            "October 4, 1962, Tooting Bec, London (aged 73 years 241 days) "
        ],
        "Fielding position": [
            "Occasional wicketkeeper"
        ],
        "Full name": [
            "Elias Henry Hendren"
        ],
        "Major teams": [
            "England,",
            "Middlesex"
        ],
        "Other": [
            "Coach"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        "\"Patsy,\" as, because of his Irish ancestry, he was affectionately known the world over, joined the Lord's groundstaff in 1905 and from his first appearance for Middlesex in 1909 he played regularly till 1937. Not always orthodox in style, this short, stockily-built batsman was celebrated for the power with which he invested his driving, for his cutting and for his courage in hooking fast bowlers. On pitches helpful to bowlers he used his feet with consummate skill. His ability as a deep fieldsman is illustrated to some extent by the number of catches he brought off, 725, but the number of runs he saved cannot be gauged.",
        "Apart from his achievements, \"Patsy\" was a \"character\" of a type sadly lacking in modern cricket. No game in which he was engaged could be altogether dull. If it looked like becoming so, Hendren could be relied upon at one time or another to produce some antic which would bring an appreciative chuckle from the onlookers. Furthermore, he was a first-rate mimic and wit, qualities which made him an admirable member of teams on tours, of which he took part in six -- three in Australia, one in South Africa and two in the West Indies. Altogether he played in 51 Test matches, 28 of them against Australia, scoring 3,525 runs.",
        "Of his seven centuries in Tests the highest was 205 not out against the West Indies at Port-of-Spain in 1930, when he and L. E. G. Ames (105) shared a fourth wicket stand of 237. \"Patsy's\" aggregate of 1,766, average 126.14, in that tour remains a record for a season in the West Indies. His highest innings in first-class cricket was 301 not out from the Worcestershire bowling at Dudley in 1933; on four occasions he put together a hundred in each innings of a match and he reached three-figures for Middlesex against every other first-class county. His best season was that of 1928 when he hit 3,311 runs, including 13 centuries, at an average of 70.44. In three summers he exceeded 3,000 runs; in 12 he made more than 2,000 and in 10 over 1,000. Among many big partnerships with his great friend and county colleague, J. W. Hearne, that of 375 against Hampshire at Southampton in 1923 was at the time a world record for the third wicket.",
        "In 1933 Hendren caused something of a sensation at Lord's by batting against the West Indies' fast bowlers wearing a special cap. Fashioned by his wife, this cap had three peaks, two of which covered the ears and temples, and was lined with sponge rubber. Hendren explained that he needed protection after being struck on the head two years earlier by the new-fashioned persistent short-pitched bouncers.",
        "Following his retirement from the field, he succeeded Wilfred Rhodes as coach at Harrow School and for four years held a similar post with Sussex. He was elected a life-member of M.C.C. in 1949 and also served on the Middlesex Committee. In 1952 he became scorer for Middlesex, continuing until ill-health compelled him to give up in 1960. In his younger days he was a fine Association football wing forward, playing in turn for Brentford, Queen's Park Rangers, Manchester City and Coventry City, and he appeared in a \"Victory\" International for England in 1919.",
        "Tributes included:",
        "Sir John Hobbs: \"Patsy was a great cricketer and great companion. He was the life and soul of the party on all our tours. In my opinion he was as good a player as anyone. He had beautiful strokes and he did get on with the game. I do not know of any bowlers who could keep him quiet on a good pitch and he was not so bad on the stickies. He was at his best after the 1914-18 War when he and Jack Hearne carried the Middlesex side.\"",
        null,
        null,
        "His hooking against the fast bowlers (the present High Commissioner for\nTrinidad and Tobago, Sir Leary Constantine will bear witness to this) and his footwork against the leg-spinner and googly bowler were both supreme. Having had the good fortune to be associated with him in a Middlesex stand on one or two occasions, I can say that I never saw him make a mistake against the latter.",
        "He was wonderful company, a great practical joker and could have been a\nstar on the stage had he chosen that profession.In 1938, he was appointed coach at Harrow and saw Harrow's first win against Eton for 31 years. To him much credit was due apart from the actual coaching. He instilled into that side enthusiasm and love of the game and it must have given him great pleasure to be called out on to the balcony on that memorable occasion.",
        "`Patsy' died in the Whittington Hospital, Highgate, not so very far from\nLord's where he spent 32 glorious years and where he scored, fittingly, the last of his 170 centuries. Born at Chiswick, he started on the Lord's ground staff as a match-card seller in 1905. A fine footballer, too, he became a `double' international as a professional winger with Manchester City, Brentford, Queen's Park Rangers and Coventry.",
        "Everyone who had the good fortune to play with or against him will never\nforget his charm and loveable personality.Their sympathy will be extended to his widow in the loss of a husband whose memory will abide for all time in the\nhistory of cricket, be it in England, Australia or the West Indies."
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}