{
    "batting_averages": [
        {
            "": "Tests",
            "100": "1",
            "50": "5",
            "6s": "12",
            "Ave": "28.90",
            "Ct": "32",
            "HS": "121",
            "Inns": "36",
            "Mat": "26",
            "NO": "4",
            "Runs": "925",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "27",
            "50": "75",
            "6s": "",
            "Ave": "31.97",
            "Ct": "356",
            "HS": "260",
            "Inns": "554",
            "Mat": "394",
            "NO": "44",
            "Runs": "16309",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "40",
            "Econ": "3.00",
            "Inns": "2",
            "Mat": "26",
            "Runs": "20",
            "SR": "-",
            "Wkts": "0"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "1",
            "Ave": "41.86",
            "BBI": "5/40",
            "BBM": "",
            "Balls": "1576",
            "Econ": "3.50",
            "Inns": "",
            "Mat": "394",
            "Runs": "921",
            "SR": "71.6",
            "Wkts": "22"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/923801.html",
        "http://www.espncricinfo.com/indveng/content/story/382317.html",
        "http://www.espncricinfo.com/ci/content/story/133382.html",
        "http://www.espncricinfo.com/ci/content/story/59701.html",
        "http://www.espncricinfo.com/wcm/content/story/70323.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=10705"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/240800/240803.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/240800/240803.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/240800/240803.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nSeptember 3, 1900, The Mount, Reading, Berkshire "
        ],
        "Died": [
            "September 16, 1961, Alton, Hampshire (aged 61 years 13 days) "
        ],
        "Education": [
            "Uppingham; Cambridge University"
        ],
        "Full name": [
            "Arthur Percy Frank Chapman"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Kent"
        ]
    },
    "profile_info": [
        "\nArthur Percy Frank Chapman, the former Kent and England captain and, at the height of his fame, one of the most popular cricketers in the world, died in hospital at Alton, Hampshire, on September 16 at the age of 61. He had been in ill-health for some years. An adventurous batsman, superlative fielder and brilliant captain, he was the embodiment of the debonair amateur who became\nthe idol of cricket crowds, nonchalantly aggressive on the field and warmly convivial off it. \n",
        "He was born at Reading on September 3, 1900, and was educated at Oakham and Uppingham, where his talents as an outstanding schoolboy cricketer soon brought him to the fore. He was in the Uppingham XI for four years (1916-19), in the last two years captaining the side and playing in the representative matches at\nLord's. At the age of only 16 he played an innings of 206 not out for his school and averaged 111.33 for the season, and in 1919 also headed the Uppingham bowling averages, so that by the time he went up to Pembroke, Cambridge, he was already a player of some experience as well as distinction.",
        "Despite the strength of Cambridge cricket in 1920, Chapman at once became a member of the XI and began his first-class career with a chanceless 118 against, Essex at Fenner's, gaining his blue as a Freshman and appearing for the Gentlemen at both Lord's and Scarborough: in the latter match he made a brilliant 101. In 1922 he scored a dazzling 102 not out against Oxford, and\nfollowed it a few days later with 160 for the Gentlemen against Players at Lord's: he completed a brilliant triology when he made 121 in the Lord's Test against Australia in 1930, thus becoming the first and only player to score a century at Lord's for his University, the Gentlemen, and for England. Whilst at Cambridge he played for his native Berkshire in the Minor Counties\nchampionship and, on qualifying for Kent, made his Championship debut for them in 1925.",
        "Chapman brought his own sparkling brand of cricket to the first-class game. His left-handed batting was daring and aggressive, always bold with attacking strokes, and able to turn many a match with 4 whirlwind burst of hitting. Whilst he often took risks; he could also play classically: his drive through the covers was as graceful as it was powerful. He was a huge, robust figure, standing 6 feet 3 inches, with a tremendous vitality for the game. His capacious hands made him a brilliant close-to-the-wicket fielder, and some of his catches were miraculous: he caught Bradman in both innings of the Test match at Lord's in 1930 with catches that are still spoken of. He had made his Test debut in 1924 against South Africa, but his greatest moment came in 1926 when, as a surprise choice, he was made captain against Australia in the vital last Test at the Oval, on which depended the Ashes. He was confident of victory, and\nled England to a resounding triumph amid great rejoicing. He captained England in 17 Tests, of which only two were lost, and led England on the successful\ntour of Australia in 1928-29: he had previously toured down-under with A. E. R. Gilligan's side four years earlier, and had been to Australasia under A. C.\nMacLaren in 1922-23. He ended his Test career by captaining England in South Africa in 1930-31. Altogether in his 26 Tests he scored 925 runs at an average of 28.90 and took 32 catches. He also visited Jamaica with Lord Tennyson's side early in 1932.",
        "To Kent cricket he brought much glory between the wars. He captained the side from 1931 to 1936, and he formed with Frank Woolley and Leslie Ames a trio that\nbrought large crowds to watch Kent play. The highest of his 27 first-class centuries was scored against Lancashire at Maidstone in 1927 - a wonderful innings of 260 scored in just over three hours against the County Champion's bowling, when he hit five 6s and thirty-three 4s and hit his last 60 in a quarter of an hour. On that occasion he and G. B. Legge, after five Kent wickets had fallen for 70, added 284 in 2J hours, still the record for Kent's sixth wicket and the highest partnership ever recorded on the Mote ground. In the same season, when he scored 158 against Worcestershire at Folkestone, he and Ames put on 155 for the sixth wicket in 65 minutes. In 1935 at Maidstone he scored 107 out of 130 in 85 minutes against Somerset, and although his batting declined as his weight increased, it always retained its immense strength and zest.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}