{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "2",
            "6s": "1",
            "Ave": "19.00",
            "Ct": "14",
            "HS": "60",
            "Inns": "21",
            "Mat": "13",
            "NO": "1",
            "Runs": "380",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "21",
            "50": "102",
            "6s": "",
            "Ave": "26.65",
            "Ct": "602",
            "HS": "185",
            "Inns": "783",
            "Mat": "557",
            "NO": "69",
            "Runs": "19034",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "1",
            "5w": "2",
            "Ave": "40.86",
            "BBI": "5/90",
            "BBM": "5/81",
            "Balls": "2178",
            "Econ": "3.26",
            "Inns": "22",
            "Mat": "13",
            "Runs": "1185",
            "SR": "75.1",
            "Wkts": "29"
        },
        {
            "": "First-class",
            "10": "16",
            "4w": "",
            "5w": "100",
            "Ave": "25.05",
            "BBI": "8/24",
            "BBM": "",
            "Balls": "96299",
            "Econ": "2.95",
            "Inns": "",
            "Mat": "557",
            "Runs": "47458",
            "SR": "50.8",
            "Wkts": "1894"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/675205.html",
        "http://www.espncricinfo.com/magazine/content/story/275637.html",
        "http://www.espncricinfo.com/magazine/content/story/263879.html",
        "http://www.espncricinfo.com/wisdencricketer/content/story/230226.html",
        "http://www.espncricinfo.com/england/content/story/146017.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=12828"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/62700/62727.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/62700/62727.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/62700/62727.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nAugust 22, 1892, Balham, London "
        ],
        "Bowling style": [
            "Right-arm medium, Legbreak"
        ],
        "Died": [
            "June 15, 1985, Exeter, Devon (aged 92 years 297 days) "
        ],
        "Education": [
            "St Paul's School"
        ],
        "Full name": [
            "Percy George Herbert Fender"
        ],
        "Major teams": [
            "England,",
            "Surrey,",
            "Sussex"
        ],
        "Nickname": [
            "Mossy"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nPercy Fender was the last survivor of those who had played county cricket regularly before the Great War: more important, he was one of the most colourful figures in the cricket world for many years after it and was widely regarded as the shrewdest county captain of his generation. In a career of 26 years he scored 19,034 runs with an average of 26.66, took 1,894 wickets at 25.05, made 21 hundreds and caught 599 catches. Six times he did the double. But he was not a cricketer who could be judged on figures. Wisden has never been a slave to statistics and, when in 1915 he appeared as one of the Five Cricketers of the Year, it was after a season in which both his bowling and batting averages had been approximately 23 and he had not scored 1,000 runs nor taken 100 wickets. Yet the honour was fully deserved. Surrey had won the Championship and Tom Hayward had said that Fender was the making of their XI. In a crucial match, for instance, against Kent, the reigning champions, at Lord's in August (The Oval was occupied by the military), going in on a pitch made for Blythe, who took nine for 97. with a scoreboard reading 147 for four, he made 48 in twenty minutes, thus securing Surrey a lead of 94: he also took in the match five for 43 and thus played a big part in his side's victory. But besides his batting and bowling, Surrey that year owed much to his superb slip fielding. Their bowling, not strong for a champion county, depended largely on Hitch, who was fast, and Rushby, who was fast-medium, and on the perfect Oval pitches a dropped slip catch could easily mean a lost match. \nThroughout his career Fender's policy was to hit fiercely, regardless of the state of the pitch, even of the quality of the bowling. He was a tremendous driver and also delighted in the pull, and he cut or slashed ferociously outside the off stump: he once slashed the ball over cover out of The Oval. It was difficult to set a field for him. His century in 35 minutes against Northamptonshire in 1920 remains a record, though it was equalled in farcical circumstances in 1983. His highest score, 185 against Hampshire in 1922, took 130 minutes and against Kent later that season he made 137 in an hour and a half, 52 of them off fourteen consecutive balls. It was not to be expected that one batting on these principles would be as consistent as a more sedate player, but in the very strong Surrey batting sides of those days another solid bat would have been neither here nor there: Fender the hitter was invaluable. \nHis attitude to bowling was the same. His object was to get the batsman out, and the tactics fostered by the modern one-day game would never have suited him. He had at his command a great variety of pace, spin and swing and all were fully employed. Inevitably his length sometimes suffered. Yet it was unwise to assume that because a batsman was out to a full toss it was a lucky wicket almost as likely as not it was bowled for that very purpose. Probably he was least expensive when he concentrated on leg-breaks and googlies. Whatever he was bowling he had a wonderfully sharp eye for a batsman's weak points. There can be no doubt that his best role was as the fourth or fifth bowler in a strong bowling side. Unluckily this was a part he was seldom able to play, and for much of his time in the Surrey team he had to do the work of a stock bowler. As such he did wonders, but to borrow a phrase used by W .G. in a different context, he \"never hadn't ought to have been put to it\". His most spectacular bowling performance was against Middlesex at Lord's in 1927, when his analysis read 5.3-2-10-7; eleven balls produced six wickets for 1 run.  \n",
        "Born at Balham, he was educated at St George's, Weybridge, and St Paul's, where he was three years in the XI, heading the batting averages in each of them and in the second representing the Public Schools at Lord's. His family was living in Sussex and it was for them that he first appeared in county cricket in 1910, his last year at school, but neither then nor in 1911 did he do much. It was a brilliant 133 not out against Oxford University at Horsham in 1912 that showed his possibilities and won him a prolonged trial. In 1913 he got his 1,000 runs and was picked for the Gentlemen at both Lord's and The Oval, but the next year he switched his allegiance to Surrey, for whom he continued to appear until 1935. In 1919, having served in the Royal Flying Corps during the war, he was kept out of cricket by a broken leg, but in 1920 he did well enough to gain a place in the M.C.C. team to Australia. There he headed the bowling averages for the Tests and twice in the course of them took five wickets in an innings, but the Australians did not think he had enough spin to be formidable on their pitches. In fact he proved only marginally a Test match player and this may have saved the selectors, who were thought never to favour him as a captain of England, an embarrassing problem. In only one series, in South Africa in 1922-23, did he keep his place throughout and South African cricket was then at a low ebb. In thirteen appearances for England between 1920 and 1929 he made 380 runs with an average of 19 and took 29 wickets at 40.86. Meanwhile in 1921 he had succeeded C. T. A. Wilkinson as captain of Surrey, a position which he held until he handed over to D. R. Jardine after 1931, and it was generally recognised that it was his captaincy more than anything else that kept a side so deficient in bowling so high in the table: twice they were second and only in his last three seasons did they fall below fifth. ",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}