{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "4",
            "6s": "0",
            "Ave": "27.46",
            "Ct": "3",
            "HS": "88",
            "Inns": "14",
            "Mat": "7",
            "NO": "1",
            "Runs": "357",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "67",
            "50": "141",
            "6s": "",
            "Ave": "42.11",
            "Ct": "342",
            "HS": "315*",
            "Inns": "810",
            "Mat": "555",
            "NO": "84",
            "Runs": "30573",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "7",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "92.50",
            "BBI": "1/5",
            "BBM": "",
            "Balls": "252",
            "Econ": "4.40",
            "Inns": "",
            "Mat": "555",
            "Runs": "185",
            "SR": "126.0",
            "Wkts": "2"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/299244.html",
        "http://www.espncricinfo.com/magazine/content/story/144328.html",
        "http://www.espncricinfo.com/ci/content/story/96029.html",
        "http://www.espncricinfo.com/cricketer/content/story/298007.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154731.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/012005/057977.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/012005/057977.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/012005/057977.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nNovember 25, 1886, Oakes, Huddersfield, Yorkshire "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "September 3, 1971, Marsh, Huddersfield, Yorkshire (aged 84 years 282 days) "
        ],
        "Full name": [
            "Percy Holmes"
        ],
        "Major teams": [
            "England,",
            "Yorkshire"
        ]
    },
    "profile_info": [
        "\nOver decades a Yorkshire batsman has been one of the two opening an England innings in Test matches, Rhodes with Hobbs, Sutcliffe with Hobbs, Hutton with Washbrook; now Boycott sustains the great tradition. But one of Yorkshire's most accomplished Number One (or Number Two) batsmen only once raised the curtain of an England innings v. Australia; his name Percy Holmes, a name as famous in Yorkshire during the 1920's and early 1930's, as Brown or Tunnicliffe, or Sutcliffe or Rhodes, or Boycott. \n",
        "Holmes opened for England at Trent Bridge against Gregory and McDonald, the fearsome bowlers of Warwick Armstrong's rough-riding team, which arrived in England in 1921, having defeated J. W. H. T. Douglas's hapless England contingent five times in five Test matches, in Australia, each played to a finish. And in 1921, blessed by a glorious English summer, Armstrong's conquerors proceeded to annihilate England in the first three Test matches, three-day engagements. And the victories were settled well within the allotted time span.",
        "Percy Holmes walked jauntily to the wicket at Trent Bridge on May 28, 1921, accompanied by D. J. Knight. England were all out for 112 and Holmes defended stoutly for ninety minutes, making top score, 30. Next innings he made no more than 8. The match was all over on the second afternoon. And this was the end of his Test match appearances until the South African season of 1927-28. He then went in first with Sutcliffe in five consecutive Test matches, at Johannesburg, Cape Town, and Durban; his scores were 0 and 15 not out; 9 and 88; 70 and 56; 1 and 63; and in the fifth game of this rubber 0 and 0.",
        "In 1932, ten days after Holmes and Sutcliffe had made 555 together at Leyton, Holmes once again, and for the last time, received recognition from the English Selection Committee; he went in first with Sutcliffe at Lord's v. India, scoring only 6 and 11. So, altogether this superb batsman played for England on seven occasions, and his modest record of 14 innings, 357 runs, average 27.46, is a complete falsification of what manner of cricketer and what manner of Yorkshire character Percy Holmes was, season after season.",
        "His name was household in Yorkshire, as closely and proudly linked with Sutcliffe's as Tunnicliffe's with Brown's. As everybody knows -- or should know -- Holmes and Sutcliffe surpassed the first-wicket stand and aggregate of 554, incredibly achieved by Brown and Tunnicliffe v. Derbyshire, at Chesterfield in 1898. Holmes was 44 years and troubled with lumbago in 1932, when he and Sutcliffe belaboured the Essex attack and after what the politicians call a recount, went beyond the Brown - Tunnicliffe scoreboard marathon.",
        "Holmes, seven years to the day older than Sutcliffe, technically was perhaps Sutcliffe's better. His range of strokes was wider; he was the more versatile and impulsive batsman of the two. But Sutcliffe knew that very rare secret, which is revealed to few men, whatever their vocation. Mastery comes to him who knows his technical limitations. Again, Holmes, as a temperament, was at Sutcliffe's extreme; he was volatile, unpredictable of mood, always alive by instinct, so to say, intent on enjoyment on the cricket field, or off it. He was always first to admit that, like the rest of humans, he was fallible.",
        "Sutcliffe seldom, if ever, admitted, as batsman, to ordinary mortal frailty. In other words, Sutcliffe found it hard to imagine that any bowler could get him out, whatever the state of the game or the cricket. One day, I saw Maurice Tate clean bowl Sutcliffe, at a game's outset -- Yorkshire v. Sussex. The ball was good enough to overwhelm Bradman. As Sutcliffe returned to the pavilion, I commiserated with him. \"Unlucky, Herbert, to get such a ball at the beginning of the morning.\" But Sutcliffe reacted to my sympathy in high dudgeon. \"I could have played it,\" he asserted, \"but a man moved in the stand, unsighting me. I could have played it,\" he repeated. I felt that I had offended Sutcliffe family pride.",
        "Holmes, as I say, was different. At Lord's, in 1925, he actually accumulated 315 v. Middlesex, in ten minutes under seven hours, with thirty-eight boundaries, as comprehensive an exhibition of stroke play as well could be imagined, all round the wicket, brilliant with late cuts and enchanting flicks to leg. Yet, when later he talked of this innings -- it broke a century-old record at Lord's -- and a year afterwards it was beaten by the Master Batsman of All (Sir Jack Hobbs) -- Holmes could not account for it, at least not for the first half hour of it. He exaggerated by reckoning he was morally out half-a-dozen times in the first few overs. One of the Middlesex bowlers who had to cope with Holmes, in these first few overs, confessed to me that he hadn't so and so noticed Holmes's insecurity. He never missed a ball he intended to play.",
        "Holmes was a great Yorkshire cricketer in one of the most historical periods of the country's many triumphant summers. From 1919, his real baptism to top-class cricket, till his last year of 1933, Yorkshire won the County championship eight times. And in his prime, Yorkshire were more or less invulnerable--1922 to 1925.",
        "These were the halcyon years, when Old Trafford, Leeds, Bradford and Sheffield would close gates at noon for a Yorkshire v. Lancashire match. Nearly 80,000 people watched Lancashire v. Yorkshire at Old Trafford, in 1926.",
        "Holmes was one of the characters, identifiable as soon as he took guard, twiddling his bat. Robertson-Glasgow, brilliant as observer as with his wit, rightly discerned in Holmes a certain aspect of an ostler inspired to cricket. There was a curious horsey stable-boy air about him; he seemed to brush an innings, comb it, making the appropriate whistling sounds. He was not of the broadly soily nature of Emmott Robinson and Rhodes. I doubt if Rhodes, in his heart of hearts, really approved of Holmes's delight in a late-cut. Cuts were never business strokes, quoth Wilfred. Roy Kilner, lovable as Maurice Leyland, would describe Percy as a bobby-dazzler. (By nature's law of compensation, there are usually one or two rich genial spirits in the Yorkshire XI, to allow cheerfulness occasionally to creep in.)",
        "Holmes really played cricket for fun. In a word, he was an artist, revelling in his batsmanship for its own sake. If he was furthering The Cause -- the Yorkshire will-to-win, all very well. But he set himself to drink deeply from the sparkling wine distilled in most innings he played. In his career he scored 30,574 runs, average 42.11, including sixty-seven centuries; and I'm pretty certain that the bulk of them, the ripe bin of them, were vintage stuff.",
        "Holmes and Sutcliffe made a most fascinating conjunction and contrast of character and technical method: Holmes was as spruce and eager to begin a Yorkshire innings as a jockey to mount his horse, using his bat as a sort of pliant persuasive whip to urge his innings along the course to the winning-post of a first-wicket century partnership.",
        "Sutcliffe was all relaxed as he took guard. Then, very likely, he would wave, with his bat, some obtrusive member in the pavilion, even at Lord's, out of his way, wave him into crawling oblivion -- and the poor exposed movable spectator could easily have been our Lord Chancellor. But, as soon as the bowler began his attacking run, Sutcliffe became almost stiff and angular with concentration. He scored with the air of a man keeping an appointment with a century, and must not be late.",
        "Holmes often appeared to improvise; he could change stroke whenever his first glance at a ball's length had deceived him. He might move forward anticipating a half-volley; if the ball dropped shorter than its first flight advertised, he would, on swift feet, move back and cut late exquisitely. There was a certain light-footedness in his batsmanship; he could defend as obstinately as most Yorkshiremen, but even then, he gave the impression that he was defending by choice, by compulsion. He was an artist, as I say, expressing himself through cricket.",
        "Sutcliffe, of course, was also an artist expressing himself in a different temperamental way. Never let it be thought that Sutcliffe was a tedious batsman; whether or not he was moving the score ahead, he remained an individual, lord of all that he surveyed. He was the image of supreme confidence, basking in it.",
        "Holmes was prepared to risk the mercy and indulgence of fortune. Sutcliffe was not only surprised but scandalised, if he was bowled; Holmes accepted such a downfall as part of the common lot of cricketers and of human nature in general.",
        "Some sixty-nine times Holmes and Sutcliffe rounded the hundred mark for Yorkshire's first wicket. Undoubtedly Holmes would, but for the omniscient presence of Hobbs, have opened for England with Sutcliffe against Australia, not once but perennially. Most of the achievements batsmen dream about came to Holmes -- a century in each innings v. Lancashire at Old Trafford in 1920; one thousand runs in a single month, June 1925, average 102.10; two thousand runs in a season seven times, over thirty thousand runs in his career.",
        "But the scoreboard could not tell of his personal presence and animation. He seldom seemed static; he was always in the game. Between overs, and in the field, he was, as they say, eye-catching; but not self-consciously `producing' himself. He was as natural as could be, not aware that, as Percy Holmes, he signed everything he did.",
        "His end as a cricketer arrived with an abruptness which, I am sure, tickled his mellow sense of humour. In 1932, he took part in the gigantic 555 first-wicket stand. The summer following, in 1933, he batted for Yorkshire 50 innings, scoring only 929 runs, average 19.25. This was the fall of the curtain for him. True, he was in his forty-sixth year; but somehow none of us suspected that age was on his heels and shoulders. He is a permanent chapter, not to say a whole volume of Yorkshire's cricket history.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}