{
    "batting_averages": [
        {
            "": "Tests",
            "100": "13",
            "50": "22",
            "6s": "12",
            "Ave": "46.77",
            "Ct": "42",
            "HS": "285*",
            "Inns": "106",
            "Mat": "66",
            "NO": "9",
            "Runs": "4537",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "85",
            "50": "127",
            "6s": "",
            "Ave": "51.00",
            "Ct": "282",
            "HS": "285*",
            "Inns": "618",
            "Mat": "388",
            "NO": "77",
            "Runs": "27592",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "66",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "102",
            "Econ": "2.88",
            "Inns": "",
            "Mat": "388",
            "Runs": "49",
            "SR": "-",
            "Wkts": "0"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/940809/we-re-such-jolly-good-fellows",
        "http://www.espncricinfo.com/magazine/content/story/702471.html",
        "http://www.espncricinfo.com/magazine/content/story/698651.html",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/657117/benaud-s-manchester-miracle",
        "http://www.espncricinfo.com/magazine/content/story/397665.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=16956"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/112004/055863.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/112004/055863.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/112004/055863.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nDecember 31, 1929, The Mount, Reading, Berkshire "
        ],
        "Died": [
            "December 27, 1994, Liphook, Hampshire (aged 64 years 361 days) "
        ],
        "Full name": [
            "Peter Barker Howard May"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Surrey"
        ],
        "Other": [
            "Referee"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        " Peter May was born at Reading on December 31, 1929. He was an instinctive cricketer, though there was no background of the game in his family. When he was 13, the headmaster of Charterhouse barred him from the First XI for his own good, but as a 14-year-old in 1944 he made 108 against Harrow, an innings that had an extraordinary impact on the school. In four years in the school First XI he made 1,794 runs, averaging 54.36. He was advised, but not all that much, by the former England player George Geary. By 1947, his last year at school, he was clearly the best schoolboy batsman in the country, scoring an unbeaten 183 against Eton and 148 and 146 in the representative matches at Lord's.",
        "He then had to do two years' national service as Writer May of the Royal Navy - the scorecard abbreviation Wtr puzzling at least one MCC member who thought he must be the mess waiter. By his second year, his clerical duties were being heavily interspersed with cricket and in 1949 he played enough to come third in the national averages behind Hardstaff and Hutton. That autumn he went up to Cambridge: in 1950 their batting side was as strong as any in the country and he was not immediately dominant, but he scored an unbeaten 227 against Hampshire, stepped into the Surrey team and quickly won his county cap.",
        "By 1951 he had made enough runs in every type of cricket - including a century for the Gentlemen- to be picked for the Fourth Test against South Africa at Headingley. He scored 138, an innings that seemed like a revelation. He played in all four Tests against India in 1952 and, though he was dropped for the three middle Ashes Tests of 1953, he returned to score 39 and 37, important in context, at the Oval and was picked for the West Indies tour, where he made his second Test century, a far more dogged 135 on a matting pitch at Port-of-Spain to earn a draw.",
        "This secured May's place once and for all, and he became a crucial member of two of the most successful teams English cricket has ever seen: Surrey, who won the Championship every year between 1952 and 1958, and an England team that never lost a series in the same period. May adapted his method and his mental approach to Test cricket and moved from being a promising batsman to a great one. Once Gubby Allen saw him get out at Fenner's and muttered: \"That was the most unconscious stroke I have ever seen.\" After his Headingley century Allen sent him a telegram: \"Charge of unconsciousness unconditionally withdrawn\".",
        "In Australia in 1954-55, May was Hutton's vice-captain, and the following year, when Hutton became ill, inherited the leadership. He captained England in 41 Tests, still a record despite the later growth of Test cricket, and was an unchallenged figure of authority. England won 20 of those Tests and lost only ten. May's stature as a batsman increased each year, even on the indifferent pitches of 1956. In the First Test at Edgbaston against West Indies in 1957, he scored 285 not out, sharing a stand of 411, England's highest ever, with Colin Cowdrey, saving the match and blunting Sonny Ramadhin's mastery of English batsmen once and for all. England went on to win the series 3-0. In 1958, in the wettest, most bowler-friendly summer of the century, he averaged almost 64, 17 more than any other batsman. In both these years, he followed on where Stuart Surridge had left off in 1956 and captained Surrey to the Championship.",
        null,
        " May became an insurance broker and underwriter at Lloyd's and concentrated on his growing family: four girls, all of them sharing their mother's love of horses, which their father, though no horseman, happily took on. For many years his cricketing involvement was low-profile, though he served as a Test selector from 1965 to 1968, and was president of MCC in 1980-81. However, in 1982 he agreed to return to the limelight by becoming chairman of selectors with a specific brief to get a grip on the players' behaviour. He never gained a rapport with a new generation of cricketers and did not seem to have much disposition to choose between them. Had he stuck to the original plan and retired after the 1985 Ashes series, his reputation would have been largely undamaged, but he stayed on until 1988, working through four captains in the last summer alone. By the end, players were being picked and dropped with bewildering rapidity.",
        " England were less strong relative to other countries in the 1980s than in the 1950s. Both as a batsman and as a captain, May had the advantage that the best bowlers were nearly always on his side. His failure against Heine and Adcock in South Africa in 1956-57 has led some to wonder whether he could have coped with the sustained battering that modern batsmen receive. But, 18 months earlier in England, he dealt with the same bowlers so effectively that he was close to a century in every match. Richie Benaud, perhaps his most formidable opponent, called him not merely the greatest English batsman to emerge since the war - which is the conventional judgment - but the only great one. As a captain, May was a hard but unfailingly courteous competitor. He was not an imaginative tactician but his resources meant this was not a serious disadvantage. He was helped too by the presence of a great chairman of selectors in Gubby Allen.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}