{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "9.00",
            "Ct": "8",
            "HS": "30",
            "Inns": "8",
            "Mat": "5",
            "NO": "1",
            "Runs": "63",
            "St": "3"
        },
        {
            "": "First-class",
            "100": "2",
            "50": "7",
            "6s": "",
            "Ave": "17.41",
            "Ct": "103",
            "HS": "150",
            "Inns": "139",
            "Mat": "85",
            "NO": "27",
            "Runs": "1951",
            "St": "47"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "5",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "85",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155661.html"
    ],
    "latest_photos": [],
    "personal_info": {
        "Also known as": [
            "birth registered as Hilton Philipson"
        ],
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJune 8, 1866, Tynemouth, Northumberland "
        ],
        "Died": [
            "December 4, 1935, Hyde Park, London (aged 69 years 179 days) "
        ],
        "Education": [
            "Eton College; Oxford University"
        ],
        "Fielding position": [
            "Wicketkeeper"
        ],
        "Full name": [
            "Hylton Philipson"
        ],
        "Major teams": [
            "England,",
            "Middlesex,",
            "Oxford University"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nPunch Philipson, died in London after a long illness, on December 4, in his 70th year. Born on June 8, 1866, at Tynemouth, he went to Eton and gaining a place in the eleven as a batsman in 1883, he subsequently kept wicket besides going in first. In his third year he scored 141 against Winchester; 53 and 27 against Harrow. Illness prevented Philipson from playing cricket in 1886, but next year he got his blue at Oxford, and in 1889 he captained the eleven instead of W. W. Rashleigh, who was studying for the Church. He played his highest innings of 150 in 1887 for Oxford against Middlesex, taking part in a seventh wicket stand of 340 with K. J. Key, who scored 281. \n",
        "Philipson created such an impression as wicket-keeper at Oxford that he played for the Gentlemen both at Lord's and the Oval in 1887. In these two games, the Gentlemen were very strong, and the Players had exactly the same eleven, all of whom played against Australia in England except Bates, who took part in the tour which brought back The Ashes by beating W. L. Murdoch's team twice in three matches. Bates contributed largely towards the triumph by taking 13 wickets for 102 runs in the second engagement. Included in this performance was the hat trick, Bates having as his victims three great batsmen: P. S. McDonnell, George Giffen and G. J. Bonnor. That was in January, 1883.",
        "Philipson was in G. F. Vernon's team which went to India in 1889, and he paid two visits to Australia. On the first occasion, in the winter of 1891, Gregor MacGregor was chief wicket-keeper in Lord Sheffield's side, but three years later, when A. E. Stoddart took his first team to Australia, Philipson, after the opening test, was preferred to L. H. Gay, and figured prominently in a memorable rubber which ended with England winning the fifth and deciding match by 6 wickets. When 297 were wanted for victory, Albert Ward, Lancashire, and J. T. Brown, Yorkshire, made 210 for the fourth partnership,",
        "These facts tell of Philipson's class. He was one of the very best wicket-keepers. Standing close to the stumps for most bowlers, he took the ball with easy grace and certainty. As a batsman he did not fulfil his early promise, but when in form he showed strong defence and could hit freely in front of the wicket. He played occasionally for Middlesex until 1898, and then for Northumberland, his native county.",
        "While most famous as a cricketer, Punch Philipson held a prominent place in many other games. He earned the title of Racquets Champion at Eton and represented Oxford against Cambridge both at Racquets and in the Tennis singles and doubles. He beat Percy Ashworth for the Racquets Amateur Championship in 1891. C. Wreford-Brown gave him his Association Football blue as full back in 1889; so altogether Philipson played for Oxford against Cambridge at four ball games.",
        "A contemporary and racquets partner considered Philipson the best all rounder he ever knew at Eton.",
        "Lord Hawke, of Eton and Cambridge; the M.C.C. Treasurer and former Yorkshire captain, paid this tribute:--",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}