{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "0",
            "50": "0",
            "6s": "0",
            "Ave": "6.00",
            "BF": "20",
            "Ct": "0",
            "HS": "6",
            "Inns": "1",
            "Mat": "1",
            "NO": "0",
            "Runs": "6",
            "SR": "30.00",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "16",
            "4s": "",
            "50": "63",
            "6s": "",
            "Ave": "25.69",
            "BF": "",
            "Ct": "178",
            "HS": "209*",
            "Inns": "696",
            "Mat": "430",
            "NO": "86",
            "Runs": "15674",
            "SR": "",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "61.50",
            "BBI": "1/51",
            "BBM": "2/123",
            "Balls": "378",
            "Econ": "1.95",
            "Inns": "2",
            "Mat": "1",
            "Runs": "123",
            "SR": "189.0",
            "Wkts": "2"
        },
        {
            "": "First-class",
            "10": "9",
            "4w": "",
            "5w": "66",
            "Ave": "24.49",
            "BBI": "9/111",
            "BBM": "",
            "Balls": "74556",
            "Econ": "2.31",
            "Inns": "",
            "Mat": "430",
            "Runs": "28734",
            "SR": "63.5",
            "Wkts": "1173"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/209720.html"
    ],
    "latest_photos": [],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nDecember 24, 1900, Benington, Stevenage, Hertfordshire "
        ],
        "Bowling style": [
            "Right-arm slow"
        ],
        "Died": [
            "March 17, 1988, Ham Green, Bristol (aged 87 years 84 days) "
        ],
        "Full name": [
            "Reginald Albert Sinfield"
        ],
        "Major teams": [
            "England,",
            "Gloucestershire"
        ],
        "Other": [
            "Coach"
        ]
    },
    "profile_info": [
        "\nSINFIELD, REGINALD ALBERT, was born on December 24, 1900, and died on March 17, 1988. At the time of his death he was England's oldest surviving Test cricketer, a distinction which then fell to R. E. S. Wyatt. His single appearance for England at Trent Bridge in the First Test of 1938 was the climax to a career which extended from 1921 to 1939 and was a fitting reward for years of loyal service to Gloucestershire. Sinfield was the epitome of the old type of English professional cricketer. In him were combined all those qualities which contributed so much to the development of the game at a time when its leadership was very much under the control of the amateur. \n",
        "His first appearances in cricket of any importance were for Hertfordshire, when he must have learnt much about the art of batting from watching C. H. Titchmarsh, a prolific scorer in the Minor Counties Championship. In 1921 he joined the groundstaff at Lord's, where he was to experience a torrid time in his first three first-class matches, which were for MCC against the two Universities. He managed just 3 runs in six innings including a  pair. However, his serene temperament helped him to survive these early setbacks, and others of a similar kind, after he had started playing for Gloucestershire in 1924. Among his early experiences of Championship cricket were a brace of pairs at the hands of Fred Root and George Macaulay. While all this was happening to him in his struggle to establish himself as batsman, he was being allowed a few overs without any conspicuous success. Many young professionals would not have had the resolution to pursue cricket as a career after such a discouraging start, but Sinfield went steadily about the business of acquiring the skills of his trade. He was soon an automatic choice for the county, and his willingness to fit in and adapt his play to the needs of the occasion were an invaluable asset to a succession of captains.",
        "Sinfield played throughout his career alongside Walter Hammond, and if Hammond held the centre of the stage, Sinfield was the ideal stage-manager. As opening batsman, he would arrange the props and set the scene for the great man to play the leading role; when batting in the middle order he would be a model member of the supporting cast.",
        null,
        null,
        null
    ],
    "recent_matches": [
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}