{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "0",
            "50": "0",
            "6s": "0",
            "Ave": "-",
            "Ct": "1",
            "HS": "2*",
            "Inns": "2",
            "Mat": "2",
            "NO": "2",
            "Runs": "3",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "4s": "",
            "50": "14",
            "6s": "",
            "Ave": "12.20",
            "Ct": "238",
            "HS": "75",
            "Inns": "884",
            "Mat": "595",
            "NO": "150",
            "Runs": "8956",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "2",
            "Ave": "32.27",
            "BBI": "5/100",
            "BBM": "6/199",
            "Balls": "829",
            "Econ": "2.56",
            "Inns": "3",
            "Mat": "2",
            "Runs": "355",
            "SR": "75.3",
            "Wkts": "11"
        },
        {
            "": "First-class",
            "10": "24",
            "4w": "",
            "5w": "143",
            "Ave": "24.07",
            "BBI": "9/40",
            "BBM": "",
            "Balls": "116074",
            "Econ": "2.77",
            "Inns": "",
            "Mat": "595",
            "Runs": "53766",
            "SR": "51.9",
            "Wkts": "2233"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wcm/content/story/245985.html",
        "http://www.espncricinfo.com/southafrica/content/story/392641.html",
        "http://www.espncricinfo.com/southafrica/content/story/392598.html",
        "http://www.espncricinfo.com/southafrica/content/story/392589.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/012005/057699.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/012005/057699.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nOctober 4, 1911, Hereford "
        ],
        "Bowling style": [
            "Right-arm fast-medium"
        ],
        "Died": [
            "November 22, 1977, Worcester (aged 66 years 49 days) "
        ],
        "Full name": [
            "Reginald Thomas David Perks"
        ],
        "Major teams": [
            "England,",
            "Worcestershire"
        ]
    },
    "profile_info": [
        "\nReginald Thomas David Perks, who died on November 22, aged 66, was by many good judges considered an under-estimated bowler. In 1939 he had played twice for England, in the notorious timeless Test at Durban and against the West Indies at The Oval, and had performed respectably without meeting with spectacular success. He was then twenty-eight. When cricket was resumed he was thirty-five and had missed the years when a bowler of his type would naturally be in his prime. Now he was perhaps just past it and had moreover Bedser to compete with. \n",
        "A tall man who made full use of his height, he bowled fast-medium right-hand, swinging the ball both ways, and was very steady, a great trier, endlessly cheerful and quite tireless. A left-handed bat, he started as a poor player but made himself into a useful tail-end hitter. Born at Hereford, he first appeared for Worcestershire in 1930 and his first victim was Jack Hobbs. By 1931 he had made a sufficient reputation to be picked for the Players at Lord's. He continued to play for the county until 1955 and, when he retired, had taken more wickets for them than any other bowler, 2,143 at an average of 23.73. In all first-class cricket his tally was 2,233 and in sixteen consecutive seasons he had taken over 100 wickets.",
        "The respect in which he was held was shown when in his last season he was appointed the first professional captain of Worcestershire. Later he was a valuable and outspoken member of the Committee. He had no warmer admirer than his old county captain, Lord Cobham, who only a couple of months before his own unexpected death, hearing of Perks's illness, drove at once twenty-five miles through the snow to visit him.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}