{
    "batting_averages": [
        {
            "": "Tests",
            "100": "1",
            "50": "4",
            "6s": "1",
            "Ave": "32.06",
            "Ct": "4",
            "HS": "119",
            "Inns": "15",
            "Mat": "10",
            "NO": "0",
            "Runs": "481",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "31",
            "50": "59",
            "6s": "",
            "Ave": "36.28",
            "Ct": "142",
            "HS": "247",
            "Inns": "393",
            "Mat": "237",
            "NO": "16",
            "Runs": "13681",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "10",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "97.00",
            "BBI": "1/5",
            "BBM": "",
            "Balls": "710",
            "Econ": "4.91",
            "Inns": "",
            "Mat": "237",
            "Runs": "582",
            "SR": "118.3",
            "Wkts": "6"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154777.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/092004/054753.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nOctober 21, 1880, Litherland, Lancashire "
        ],
        "Died": [
            "October 2, 1961, Lincoln (aged 80 years 346 days) "
        ],
        "Full name": [
            "Reginald Herbert Spooner"
        ],
        "Major teams": [
            "England,",
            "Lancashire"
        ]
    },
    "profile_info": [
        "\nReginald Herbert Spooner, whose name is linked with the greatest batsmen of Edwardian England, died in a nursing home at Lincoln on October 2, after a few\nweeks' illness, at the age of 80. One of the most beautiful stroke-makers known to the game, he adorned the cricketing scene as a player for Lancashire and England in an age of giants, when quality, style and skill were wedded as perhaps at no other time. \n",
        "He was born near Liverpool on October 21, 1880, and was educated at Marlborough, where he excelled as an outstanding schoolboy sportsman and established a fine reputation as a batsman of maturity and dominance. He was in the XI for three years from 1897 to 1899, and after scoring 139 against Rugby at Lord's in\n1898, he ended his school career in a blaze of triumph with 926 runs in 1899 at an average of 71.23, including innings of 69 and 198 against Rugby; he was captain of Marlborough that year, and he was at once marked out as a potentially great player. For Lancashire II at the age of 18 he scored a great 158 against Surrey II at Old Trafford, and within a few weeks made his debut in\nfirst-class cricket, appearing against Middlesex at Lord's in 1899 with scores of 44 and 83. He made an immediate impression, which was fully justified in later years, as an elegant artist who could open the innings not as a\ncraftsman but as a polished and ingenious stroke-player who was loved and admired by crowds on every ground.",
        "For three years Spooner was not seen on the first-class field due to his absence in South Africa on military service in the Boer War, in which he was unfortunately wounded. He returned to major cricket in 1903 and made the first of his 25 centuries for Lancashire and the highest score of his career-247 against Nottinghamshire at Trent Bridge. Later in the same month he and A. C.\nMacLaren shared an opening stand of 368 against Gloucestershire at Liverpool, still the highest for Lancashire's first wicket and a record for any wicket at\nAigburth. The tall and slim figure of Spooner, rhythmically stroking the ball with strong and flexible wrists, soon became synonymous with classical purity and apparently effortless elegance. He was as an aristocrat at the crease,\ngraceful, poised and confident. His off drive was a flashing joy and brought showers of admiration, though his skill on the leg-side was by no means negligible - as he demonstrated in a superbly-played innings of 114 for\nthe Gentlemen against the Players at Lord's in 1906. He could straight-drive the fastest bowlers with handsome strokes off the back foot, and was one of the earliest masters of googly bowling.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}