{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "18.00",
            "Ct": "4",
            "HS": "39",
            "Inns": "12",
            "Mat": "9",
            "NO": "1",
            "Runs": "198",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "1",
            "50": "40",
            "6s": "",
            "Ave": "22.23",
            "Ct": "213",
            "HS": "109",
            "Inns": "573",
            "Mat": "386",
            "NO": "120",
            "Runs": "10073",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "3",
            "5w": "1",
            "Ave": "34.31",
            "BBI": "5/116",
            "BBM": "9/290",
            "Balls": "2118",
            "Econ": "3.11",
            "Inns": "18",
            "Mat": "9",
            "Runs": "1098",
            "SR": "66.1",
            "Wkts": "32"
        },
        {
            "": "First-class",
            "10": "20",
            "4w": "",
            "5w": "92",
            "Ave": "23.64",
            "BBI": "8/62",
            "BBM": "",
            "Balls": "59571",
            "Econ": "3.11",
            "Inns": "",
            "Mat": "386",
            "Runs": "30945",
            "SR": "45.5",
            "Wkts": "1309"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/1095966.html",
        "http://www.espncricinfo.com/wisdencricketer/content/story/241966.html",
        "http://www.espncricinfo.com/wcm/content/story/140809.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154622.html"
    ],
    "latest_photos": [],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nNovember 24, 1918, Rainbow Hill, Worcester "
        ],
        "Bowling style": [
            "Legbreak googly"
        ],
        "Died": [
            "July 22, 1995, Worcester (aged 76 years 240 days) "
        ],
        "Full name": [
            "Roland Oliver Jenkins"
        ],
        "Major teams": [
            "England,",
            "Worcestershire"
        ]
    },
    "profile_info": [
        null,
        " Jenkins was the youngest of a family of ten, and was spotted playing in a knockabout on Worcester Racecourse. He made his debut in 1938, was capped in 1939 and, when cricket resumed, established himself as a gutsy middle-order batsman as well as a fierce spinner of the ball. He finished the 1948 season with 1,356 runs and 88 wickets and was just finalising plans for his wedding when he received a telegram asking him to replace Eric Hollies in the touring party for South Africa. The wedding was postponed and he had a hugely successful tour, dismissing Eric Rowan with his third ball in Test cricket, and topping the England bowling averages for the series. However, Jenkins did not play against New Zealand the following summer, though he took 183 wickets (including two hat-tricks in one match, against Surrey) and scored 1,183 runs: he may have made an ill-advised remark to someone important. Once, while batting with his captain, Bob Wyatt, who was alleged to be rather disdainful about calling, he said: Say something, even if it's only goodbye. I'll see you at lunch, Jenkins, came the stern reply.",
        null,
        "No English legspinner has ever returned all-round figures to rival those of Worcester's Roly Jenkins in the summer of 1949. With 183 victims, he was the country's leading wicket-taker, his \"dogged batting\" yielded 1,183 runs, and his \"live-wire fielding\" resulted in 27 catches, the majority of them off his own bowling. Wisden named him as one of their Cricketers of the Year, detailing also his outstanding success in South Africa the previous winter. \"Worcester people are proud of him,\" it wrote, \"the only man born in the city itself to be chosen by MCC for a tour.\"",
        "\"The keenest man playing first-class cricket today,\" the Guardian's Terence Prittie called him. \"He loves the game as much as any man living.\" Nine years on from his death, his widow Olive remembers his enthusiasm. \"He never stopped talking about cricket. Not long before he died, we were in the doctor's waiting room, and he met this chap. They were talking away for hours. In the end, the doctor came out. `Is one of you two going to come in?'\"",
        "As a bowler, always in his cap, he had a short, fidgety roll to the wicket, a distinctive mix of muscle and anxiety as he threw the ball high and spun it prodigiously. \"Spin for Roly,\" he would tell the ball, but his quest for perfection rarely left him satisfied.",
        "\"I've seen him take eight wickets and go straight into the nets,\" his team-mate Martin Horton says. \"He particularly hated batsmen sweeping him. He used to say to Bill Alley, `I hope your chickens all die.' Jim Parks used to sweep him first ball, whatever. `Haven't they got any proper batsmen today?' he'd say.\"",
        "One year in Glasgow he beat the Rev Jim Aitchison repeatedly but without success, and he came down the wicket. \"They say you're a vicar. Well, with your luck, you'll be the Archbishop of Canterbury.'\" Later, as he nursed a sore finger, he turned to the umpire: \"I'll borrow the one you're not using.\" He returned to Worcester in a state of nervous distress and did not bowl again for a month.",
        "\"He was always talking,\" Olive says. \"And he never bothered what he said. He just said it.\"",
        "During the Second World War he was admonished by an officer batting with him. \"Now listen, Jenkins, you don't say `come one,' you say `come one, sir.'\" And Roly, with his insistent Worcester vowels, had to have the last word: \"And if I'm wearing a cap, sir, should I salute when we cross?\"",
        "He wrote a piece on spin bowling for the Cricketer, and Walter Robins commended him. \"That was a very good article, Jenkins. Who wrote it for you?\" Quick as a flash he came back: \"I wrote it myself, sir. Who read it for you?\"",
        "But in May 1949 he made one remark too many and, for all his success in South Africa and during that golden summer, it cost him his Test place. The selectors picked six slow bowlers that summer - including three leg-spinners at The Oval - but there was no call-up for the man from Worcester.",
        "Olive produces eight pages of typed script from an envelope marked Unpublished Article: \"There are those who assert that he was omitted because of a frivolous (and harmless) remark made while batting for MCC in a friendly match. He was certainly carpeted at Lord's for his levity and, it seems, lost his Test place because of it.\"",
        "\"What on earth did he say?\"",
        "\"Ah well, I don't suppose it matters to repeat it now. He was batting on the last morning, and he said to this fancy cap, `I'm going to play as an amateur today. I want to catch the early train back to Worcester.'\"",
        "The irony is that no cricketer ever tried harder or took the game more seriously, ever looked after its spirit more lovingly. In his final radio interview, he read Lord Harris's famous words: \"`Cricket. It is a moral lesson in itself, and the classroom is God's air and sunshine. Foster it, my brothers, protect it from anything that will sully it, so that it will be in favour with all men.' What would he do in his grave,\" Roly added, \"if he could see what was going on today?\"",
        "But if there was no England place for Roly that summer, at least he had time for the wedding he had had to postpone during the winter. Worcester released him for a week in June, and he sent them a postcard from Llandudno: \"They say it's sunny outside.\"",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}