{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "2.00",
            "Ct": "0",
            "HS": "4",
            "Inns": "2",
            "Mat": "1",
            "NO": "0",
            "Runs": "4",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "0",
            "6s": "",
            "Ave": "5.41",
            "Ct": "153",
            "HS": "35*",
            "Inns": "612",
            "Mat": "506",
            "NO": "249",
            "Runs": "1965",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "180",
            "Econ": "4.23",
            "Inns": "2",
            "Mat": "1",
            "Runs": "127",
            "SR": "-",
            "Wkts": "0"
        },
        {
            "": "First-class",
            "10": "15",
            "4w": "",
            "5w": "99",
            "Ave": "20.52",
            "BBI": "9/42",
            "BBM": "",
            "Balls": "106366",
            "Econ": "2.06",
            "Inns": "",
            "Mat": "506",
            "Runs": "36578",
            "SR": "59.6",
            "Wkts": "1782"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/county-championship-division-1-2017/content/story/1122123.html",
        "http://www.espncricinfo.com/county-championship-division-1-2017/content/story/1121589.html",
        "http://www.espncricinfo.com/wcm/content/story/245985.html"
    ],
    "latest_photos": [],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nAugust 23, 1921, Tetbury, Gloucestershire "
        ],
        "Bowling style": [
            "Slow left-arm orthodox"
        ],
        "Died": [
            "September 5, 1996, Tetbury, Gloucestershire (aged 75 years 13 days) "
        ],
        "Full name": [
            "Cecil Cook"
        ],
        "Major teams": [
            "England,",
            "Gloucestershire"
        ],
        "Other": [
            "Umpire"
        ]
    },
    "profile_info": [
        null,
        "Grateful was indeed an apposite word. The slow left-arm bowler would probably have sent down 40 overs during the day. He had no car and couldn't rely on any bus heading in the direction of the Cotswold contours at that time of night. Sam Cook must have been county cricket's only regular hitch-hiker. `I wasn't always lucky - if I was still in the field at half past six, then I reckoned I'd had it,' he used to say.",
        "But friends didn't often let him down. And few players had more of those. He was authentic Gloucestershire, full of native good humour, a plumber by trade who could mend a Nevil Road cistern between innings. Nothing flustered him; he would stroll in to bat at a moment of late-order crisis as if he were wandering down to Tetbury's Priory Inn for a pint before closing time. The bronzed face revealed not the merest anxiety. His first words to an apprehensive partner were more likely to be about the size of his onions than the perilous state of the game.",
        "Sam (no-one ever called him by his proper name, Cecil, except Old Etonian skipper Tom Pugh, he would confide) was primarily a bowler, of course, and one of considerable, at times underestimated, talent. He took 1782 wickets for Gloucestershire in a career that stretched from 1946 to 1964. Much of his bowling was in tandem with Tom Goddard. His phlegm ensured that he possessed marvellous control and direction. He had both spin and flight, but above all accuracy. Tony Brown used to say: `He'd report back in April, immediately on a perfect length as if he had never been away.'",
        "The first time he saw Cook in the nets, at the start of the 1946 season, Wally Hammond turned to secretary Henson: ` Cook of Tetbury, did he tell me his name was? He'll take 100 wickets in his first year and I think he'll play for England as well.' Hammond was right on both counts. Sam actually claimed a wicket with his first ball - against Oxford - and finished with 133 wickets, and his cap.",
        "He was selected for a Test trial at Canterbury at the behest of Hammond. It coincided with his delayed honeymoon to Daisy. Cook had a poor match and there were one or two good-natured explanations offered by team-mates, as well as the attentive skipper. His sole England appearance came the following year, against South Africa at Trent Bridge. The wicket gave him no help at all -`and I tried too hard'. He did his best to forget figures of 0 for 127 in 30 overs.",
        " Cook took 100 wickets in a season nine times, with 149 at 14.16 in 1956. Playing against Yorkshire, in Charlie Barnett's benefit match in 1947, his 9 for 42 ranked with the great feats of slow bowling at Bristol. But the acclaim only embarrassed him. Essentially, he enjoyed his cricket in the way he used to play it for Tetbury, where his father was once the offspinner: `Take a few wickets, you know, get a few runs ... and then a few pints.'",
        "He liked a drink. At one of his early nets in Bristol, where most of the young pros had settled for a cuppa at lunchtime, Hammond sniffed in the proximity of the amiable newcomer and asked: `Do I smell Georges beer?' Once, in a benefit match at Badminton, Sam ran through the stumps after a generous lunch. That ranked in unpredictable drama with the 98 he once made for Tetbury 2nd XI, or the couple of unconventional hundreds he scored during his successful Services cricketing spell in Rhodesia.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}