{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "1",
            "6s": "0",
            "Ave": "15.40",
            "Ct": "5",
            "HS": "53",
            "Inns": "10",
            "Mat": "6",
            "NO": "0",
            "Runs": "154",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "19",
            "50": "62",
            "6s": "",
            "Ave": "23.42",
            "Ct": "279",
            "HS": "215",
            "Inns": "690",
            "Mat": "401",
            "NO": "35",
            "Runs": "15345",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "25.00",
            "BBI": "3/28",
            "BBM": "3/28",
            "Balls": "412",
            "Econ": "3.64",
            "Inns": "6",
            "Mat": "6",
            "Runs": "250",
            "SR": "41.2",
            "Wkts": "10"
        },
        {
            "": "First-class",
            "10": "21",
            "4w": "",
            "5w": "77",
            "Ave": "20.81",
            "BBI": "10/69",
            "BBM": "",
            "Balls": "41207",
            "Econ": "3.15",
            "Inns": "",
            "Mat": "401",
            "Runs": "21651",
            "SR": "39.6",
            "Wkts": "1040"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdencricketer/content/story/229630.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154827.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/145000/145000.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/145000/145000.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nApril 13, 1867, Ashfield, Sydney, New South Wales, Australia "
        ],
        "Bowling style": [
            "Right-arm fast-medium"
        ],
        "Died": [
            "April 30, 1931, Taunton, Somerset (aged 64 years 17 days) "
        ],
        "Full name": [
            "Samuel Moses James Woods"
        ],
        "Major teams": [
            "Australia,",
            "England,",
            "Cambridge University,",
            "Somerset"
        ]
    },
    "profile_info": [
        "\nSamuel \"Sammy\" Moses James Woods, one of the most famous and popular of athletes, a splendid cricketer and a great Rugby football forward, was born at Glenfield near Sydney on April 13, 1867, and died on April 30 at Taunton. A player of grand physique, cheery disposition, and unflinching courage, he was generally at his best against the strongest and never knew when he was beaten. Although essentially an all-rounder and a most efficient and inspiring captain, it is on his bowling that his fame will chiefly rest. He was fast and accurate and had at his command not only a deadly yorker but also a slow ball which was as formidable and deceptive as any he sent down. Unquestionably he reached a measure of excellence which entitled him to a place among the great fast bowlers of all time. \n",
        "Essentially a forcing batsman Woods drove tremendously hard especially to the on. He used his reach, great strength and sure eye to hit at the pitch of the ball without leaving his crease. Often he knocked the most accurate bowlers off their length and he could cut any short ball with a swing of his massive shoulders and arms, sending the ball at tremendous speed past cover-point. While Woods preferred the fast scoring game he could, in case of need, adopt a sound, correct method and then he excelled in off-side driving. As with age his effectiveness with the ball declined he used the bat to greater purpose. His highest scoring season was 1895 when he made 1,405 runs with an average of 34. This he surpassed four years later with a record of 40 an innings.",
        "He received his early education at Sydney Grammar School and Royston College, Sydney, and at the latter institution showed such ability as a bowler that in 1883 he took seventy wickets for five runs each and on one occasion obtained seven wickets in seven balls.",
        "He came to England in 1884 and went to Brighton College where he and G. L. Wilson stood out as two of the best Public School cricketers of the season. In the following summer for Brighton College Woods obtained seventy-eight wickets for seven and a half runs apiece, getting fourteen--all bowled--in the match with Lancing College, and, in addition to achieving so much as a bowler, showed no little ability as a hard-hitting batsman while, later on, he developed into a brilliant field at cover-point or extra mid-off and a sure catch. He began to play regularly for Somerset in 1887 but a year earlier had figured at Portsmouth in a match between the fifth Australian team and a side got together by G. N. Wyatt, a prominent amateur who appeared first for Gloucestershire, afterwards for Surrey and finally for Sussex. While reaching double figures in each innings and taking two wickets, Woods accomplished nothing of much note on that occasion, but on going up to Cambridge in 1888 he, in the course of very few weeks, made himself certain of his Blue. For four years he appeared for the University and, during that period, secured 190 wickets for less than 15 runs apiece, while in the four encounters with Oxford at Lord's, of which three were won and one drawn, he obtained thirty-six wickets for something under nine runs each. Cricket has presented no more exhilarating sight than the University match of those days with Woods bowling his hardest and Gregor MacGregor keeping wicket in that famous player's masterly fashion.",
        " Woods did little as a batsman against Oxford, but in his last year when Cambridge--set 90 to make to win--had lost eight wickets for 89, he went in and hit the first ball he received to the boundary. He was Cambridge captain in 1890 when the Light Blues proved victorious by seven wickets.",
        "Although earning great fame as a bowler at Cambridge and repeatedly chosen to assist Gentlemen against Players--he and F. S. Jackson bowled unchanged in the match of 1894 and were mainly instrumental in gaining in single innings victory over the professionals-- Sam Woods' career was essentially identified with Somerset, for whom he appeared from 1886 to 1907, acting as captain in 1894 and taking over the duties of Secretary until 1923. His biggest score was one of 215 which he hit against  Sussex at Hove in 1895, the total meanwhile being increased by 282 in two hours and a half. Three years later, on the same ground, he made 143 out of 173 in two hours and a quarter off the Sussex bowlers.",
        "Among his many bowling feats, in addition to his great performances for Gentlemen v. Players, was the taking of all ten wickets for 69 runs in an innings for Cambridge against C. I. Thornton's Eleven--fifteen wickets in the match for 88 runs--at Cambridge in 1890. Two years earlier in a contest against another side got together by C. I. Thornton he performed the  hat-trick, and in 1891 at the Oval against Surrey he obtained fourteen wickets for 11 runs each.",
        "He played for the Australians in this country several times in 1888 and participated in several tours abroad, going to America in 1891 and to South Africa in 1896-97 with teams led by Lord Hawke, to the West Indies with a side captained by Sir A. Priestley and to America again in 1899 when Ranjitsinhji was in control.",
        "In the course of his career he made nineteen 100's--eighteen of these for Somerset--scored in all 15,499 runs with an average of 23 and took 1,079 wickets for 20 runs apiece. Over six feet in height, he weighed in his cricket days thirteen stone and a half.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}