{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "0",
            "50": "0",
            "6s": "0",
            "Ave": "3.00",
            "Ct": "0",
            "HS": "3",
            "Inns": "1",
            "Mat": "1",
            "NO": "0",
            "Runs": "3",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "4s": "",
            "50": "10",
            "6s": "",
            "Ave": "13.63",
            "Ct": "97",
            "HS": "85",
            "Inns": "247",
            "Mat": "143",
            "NO": "28",
            "Runs": "2986",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "1",
            "Ave": "8.71",
            "BBI": "5/19",
            "BBM": "7/61",
            "Balls": "154",
            "Econ": "2.37",
            "Inns": "2",
            "Mat": "1",
            "Runs": "61",
            "SR": "22.0",
            "Wkts": "7"
        },
        {
            "": "First-class",
            "10": "1",
            "4w": "",
            "5w": "19",
            "Ave": "22.34",
            "BBI": "7/16",
            "BBM": "",
            "Balls": "17962",
            "Econ": "2.58",
            "Inns": "",
            "Mat": "143",
            "Runs": "7730",
            "SR": "51.9",
            "Wkts": "346"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/blogs/content/story/1085916.html",
        "http://www.espncricinfo.com/magazine/content/story/784571.html",
        "http://www.espncricinfo.com/magazine/content/story/436989.html",
        "http://www.espncricinfo.com/magazine/content/story/331479.html",
        "http://www.espncricinfo.com/magazine/content/story/259221.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=20230"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/022004/050285.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/022004/050285.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/022004/050285.icon.jpg"
    ],
    "personal_info": {
        "Also known as": [
            "'Round The Corner' Smith"
        ],
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJuly 21, 1863, City of London "
        ],
        "Bowling style": [
            "Right-arm fast"
        ],
        "Died": [
            "December 20, 1948, Beverly Hills, California, United States of America (aged 85 years 152 days) "
        ],
        "Education": [
            "Charterhouse; Cambridge University"
        ],
        "Full name": [
            "Charles Aubrey Smith"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Sussex,",
            "Transvaal"
        ]
    },
    "profile_info": [
        "\nThe chance to read one's own obituary is rare. Neville Cardus, on being told that the Buckinghamshire Examiner had described his death and published a moving tribute, paused before saying: \"I have no wish to challenge the authority of the provincial press. They must have some information.\" \n",
        "Sir Aubrey Smith, the greatest actor-cricketer in the game's history, read of his own demise 59 years before the event. In October 1889 the Graff-Reinet Advertiser announced that he had \"succumbed to that fell disease, inflammation of the lungs\". \"Much regret will be felt at his decease,\" the article continued. \"He made many friends by his kindly disposition.\" When Smith eventually died of pneumonia, in Beverly Hills, California, at the age of 85, he had left a far more imposing legacy. He was, after all, the only captain of England to star in a film with Elizabeth Taylor (Mervyn Le Roy's Little Women).",
        "The son of a London doctor, Smith's early cricket coaching came at the hands of Julius Caesar, once a star batsman for Surrey and an All England player but by then a dropsical wreck teaching boys at Charterhouse. Smith was nonetheless fortunate to come across him. Public school was an expense that his Micawberesque, spendthrift father could ill afford but Dr Smith, with money borrowed from his brother, was able to educate his son all the way to Cambridge University, where he won his Blue.",
        "Smith was a fast-medium bowler with a high action and a useful leg-cutter. But the most striking aspect of his bowling was a curious, curved approach to the wicket that earned him the unwieldy nickname `Round The Corner'. \"Sometimes he started from a deep mid-off position, at others from behind the umpire,\" said Wisden and WG Grace remarked: \"It is rather startling when he suddenly appears at the bowling crease.\"",
        "Smith was also a competent slip fielder and his arms had a telescopic quality when gathering in catches. But, despite an impressive first-class career for Sussex - he took 346 wickets at an average of 22.34 between 1882 and 1896 - an international career never really took off. At least it did not take off on the cricket pitch.",
        "This is surprising, considering that he captained England on their first tour of South Africa, in 1888-89, and he took 134 wickets at 7.61 each. He played only one Test, at Port Elizabeth (the match was awarded Test status some years later), and was easily the best bowler in the match.",
        "Leading a team that included five others making their Test debuts, two of whom were also making their first-class debuts, Smith took 5 for 19 in the first innings and 2 for 42 in the second, although he was no doubt aided by the game being played on matting. It was all over by 3.30pm on the second day.",
        "Smith stayed in South Africa for some time after that tour, going into stockbroking partnership with another member of the team, Monty Bowden, and captaining Transvaal. But in 1896, having returned to London, he made his debut on the West End stage as the arch villain Black Michael in the swashbuckling romance The Prisoner of Zenda.",
        "Who could have envisioned that 41 years later he would appear in a Hollywood version, opposite Raymond Massey, or would be persuading Ronald Colman and David Niven to turn out for his cricket team during shooting?",
        "Smith made the transition from stage to film in the 1920s. His diction was heavy and strident and he would have found the concept of method acting laughable. As Harold Wilson was a professional Yorkshireman, so Smith was a professional Englishman.",
        "He took the Jane Austen approach and stuck rigidly to what he knew, often playing monarchs or crusty martinets. He managed to portray the Duke of Wellington in three unrelated films. But his caricatured screen roles were not too far from the truth. He used to have the Union Jack raised daily at his home near Mulholland Drive and was easily offended by the sexual mores of others.",
        "In late 1932, as the Bodyline series raged in Australia, Smith founded the Hollywood Cricket Club. He supervised the building of a field and pavilion at Griffith Park, even insisting on the planting of five cartloads of English grass seed. Sadly nothing remains of his handiwork. Los Angeles City Council bulldozed the area and converted it to an equestrian centre for the 1984 Olympics.",
        "Scorecards for Smith's matches indicate the star quality of the occasions. Nigel Bruce, Basil Rathbone, Laurence Olivier and PG Wodehouse were among those who played for him; Smith could be by turns persuasive and forceful at roping in the local talent. Niven recalled that he was once press-ganged into net practice on an evening that he had resolved to spend \"chasing some skirt\".",
        "In 1937, during shooting of The Prisoner of Zenda, a boat carrying Gubby Allen's Ashes tourists docked for a few days and Smith was beside himself with joy, offering cinematic workshops to a bemused audience of Allen, Hedley Verity and CB Fry.",
        "Another guest in Hollywood was Lancashire's Archie MacLaren who arrived during the filming of The Four Feathers. MacLaren was hard up, as usual, and Smith paid his old crony some pin money as an extra. Many watchings of the film have revealed no sign of MacLaren's patrician features and the Lancashire captain may have been consigned to the cutting- room floor.",
        null
    ],
    "recent_matches": [
        {},
        {}
    ]
}