{
    "batting_averages": [
        {
            "": "Tests",
            "100": "1",
            "50": "3",
            "6s": "2",
            "Ave": "24.19",
            "Ct": "20",
            "HS": "122",
            "Inns": "33",
            "Mat": "25",
            "NO": "2",
            "Runs": "750",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "11",
            "50": "47",
            "6s": "",
            "Ave": "28.67",
            "Ct": "131",
            "HS": "180",
            "Inns": "376",
            "Mat": "265",
            "NO": "54",
            "Runs": "9233",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "1",
            "4w": "3",
            "5w": "5",
            "Ave": "29.37",
            "BBI": "7/80",
            "BBM": "10/78",
            "Balls": "4386",
            "Econ": "3.25",
            "Inns": "45",
            "Mat": "25",
            "Runs": "2379",
            "SR": "54.1",
            "Wkts": "81"
        },
        {
            "": "First-class",
            "10": "9",
            "4w": "",
            "5w": "48",
            "Ave": "22.23",
            "BBI": "10/40",
            "BBM": "",
            "Balls": "36180",
            "Econ": "2.90",
            "Inns": "",
            "Mat": "265",
            "Runs": "17518",
            "SR": "45.9",
            "Wkts": "788"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/697733.html",
        "http://www.espncricinfo.com/magazine/content/story/682705.html",
        "http://www.espncricinfo.com/magazine/content/story/375242.html",
        "http://www.espncricinfo.com/magazine/content/story/356092.html",
        "http://www.espncricinfo.com/magazine/content/story/358080.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=8515"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/210300/210357.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/210300/210357.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/210300/210357.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJuly 31, 1902, Bellevue Hill, Sydney, New South Wales, Australia "
        ],
        "Bowling style": [
            "Right-arm fast"
        ],
        "Died": [
            "November 29, 1989, St John's Wood, London (aged 87 years 121 days) "
        ],
        "Education": [
            "Eton College; Cambridge University"
        ],
        "Full name": [
            "George Oswald Browning Allen"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Middlesex"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        "Sir George Oswald Browning Allen - known to almost 70 years of cricketers across the world as `Gubby'- has died, at the ripe age of 87; indeed he was taking his regular game of golf as lately as last June. He was brought to England at the age six after having been born in Australia, where his family for long practiced law; indeed, his uncle, Reginald Charles Allen, played for Australia in a Test Match against England in 1886-87. As an active cricketer `Gubby' was a genuine and considerable allrounder; Remarkably for one of his relatively slight build, he was a genuinely fast bowler, whose sharpest weapon was the outswinger; a correct, of the tenacious batsman, and a sure-handed close field. He played for Eton- where he was coached by George Hirst and C. M. `Father' Wells- Cambridge University, Middlesex and England. His county career lasted from 1921 to 1950, but he was outstandingly active in the councils of the game until virtually the end.",
        " Sir George lived for much of his life in a house only a wall's thickness away from Lord's (he had his own private gate into the ground), whence he wielded immensely powerful influence in the affairs, especially, of MCC and Middlesex. He was a genuine amateur, prevented by his career in business and on the Stock Exchange from playing fulltime cricket. For that reason, capable allrounder that he was, he never scored 1000 runs nor took 100 wickets in a season. Indeed, in his entire career he played only 376 innings; notably, 33 of them were in his 25 Test for England; his batting average overall was 28.67, while he took 788 wickets (81 in Test) at 22.23. Somewhat surprisingly for one who lived to such a good age, from his Eton days he was dogged by injuries; in later life he needed six hip operations - three on each side.",
        "He was `blooded' in Test cricket against Australia in 1930 but, although he scored 57, his bowling was unsuccessful and he was dropped for the remainder of the series. He made his mark, though, in 1931, with a quite remarkable innings of 122 against New Zealand at Lord's, coming in at No. 9. He And Leslie Ames set a Test record, which still Stands, with their partnership of 246 for the eighth wicket. In the next match of the series he took 5 for 14; he did not need to bat in that Test, nor in the third.",
        "He was taken in Douglas Jardine's side for what has become known as the Bodyline series. Allen, however, disagreed with that version of leg-theory and his captain, meeting a character as determined as his own, did not press his only amateur fast bowler. However, Allen took 21 wickets in that Test series- more than any other English bowler except Harold Larwood. Back home again in 1933, business claimed him for all but one Test against West Indies. Then, in the following season, 1934, the after-effects of a hernia operation restricted him to two Test, in which he made useful but unremarkable contributions. At Old Trafford, in his attempts to avoid the pit dug by Bill O'Reilly's followthrough, Allen bowled a most remarkable first over of 13 deliveries, which included four no-balls three wides - and two unaccepted chances of catches.",
        " ",
        "He was captain against India in 1936 When England took the three-match rubber by two to one, and his opponent, the Maharaj Kumar of Vizianagram, was Knighted between the first two Tests.",
        "Against Australia, on tour in 1936-37 Allen was given the captaincy, for which he had obviously been groomed. He batted and bowled most capably in the first two Tests, Both of which England won. Then Bradman set his seal on the series with scores of 13, 270, 26, 212 and 169 and Australia took the rubber 3-2.",
        "Those who follow his career must frequently be baffled by Allen's disappearances from the Test scene, and he did not play for England after captaining them in the Australian series until after the war. He did not play at all in 1937 and turned out for Middlesex in a few matches in 1938. During the war, having trained with the City of London Yeomanry for two years previously, he joined a Royal Artillery Unit and attached for a period to the RAF. Then, characteristically and at his own request, he was taken on a bombing raid over Germany to experience that type of action from the other side.",
        " Hammond had by now more or less taken over the post of captain of England, but is was Gubby, ever a glutton for cricket, who took the England side to West Indies in 1947-48 West Indies took the four-match rubber 2-0. Allen, who had made desperate attempts to get cricket-fit again at the age of 45, pulled a leg muscle and could not bowl after his second over of the Third Test. West Indies, however, were markedly the stronger side and Allen a thoughtful but hard-pressed captain.",
        "In 1955 he became chairman of selectors, in which post he was conscientious and, at times, quite brilliant. From 1956 he was also chairman of the MCC cricket committee until 1963, when he became the club's president. Apart from the war years, he served on various summer at Lord's from 1932 to 1985 - in latter years he had the own comfortable chair in the committee-room, whereas lesser lights had to make do with straight-backed hard seats.",
        null,
        "He was in the forefront, with Sir Donald Bradman, of the campaign to stamp out throwing among bowlers. For 12 years, too, he served as treasurer of MCC, which is generally regarded as the most influential post in the club. In 1962 he was made a CBE, and he was Knighted in 1986.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}