{
    "batting_averages": [
        {
            "": "Tests",
            "100": "19",
            "50": "33",
            "6s": "7",
            "Ave": "56.67",
            "Ct": "57",
            "HS": "364",
            "Inns": "138",
            "Mat": "79",
            "NO": "15",
            "Runs": "6971",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "129",
            "50": "177",
            "6s": "",
            "Ave": "55.51",
            "Ct": "400",
            "HS": "364",
            "Inns": "814",
            "Mat": "513",
            "NO": "91",
            "Runs": "40140",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "77.33",
            "BBI": "1/2",
            "BBM": "1/2",
            "Balls": "260",
            "Econ": "5.35",
            "Inns": "14",
            "Mat": "79",
            "Runs": "232",
            "SR": "86.6",
            "Wkts": "3"
        },
        {
            "": "First-class",
            "10": "1",
            "4w": "",
            "5w": "4",
            "Ave": "29.51",
            "BBI": "6/76",
            "BBM": "",
            "Balls": "9774",
            "Econ": "3.13",
            "Inns": "",
            "Mat": "513",
            "Runs": "5106",
            "SR": "56.4",
            "Wkts": "173"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/1015323/the-roles-they-played",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/885439/little-epics",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/837473/26-all-out",
        "http://www.espncricinfo.com/magazine/content/story/691539.html",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/631181/-i-wanted-to-stop-batsmen-from-getting-on-to-the-front-foot",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=14334"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/082001/029497.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/082001/029497.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/082001/029497.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJune 23, 1916, Fulneck, Pudsey, Yorkshire "
        ],
        "Bowling style": [
            "Legbreak"
        ],
        "Died": [
            "September 6, 1990, Kingston Hospital, Kingston-upon-Thames, Surrey (aged 74 years 75 days) "
        ],
        "Full name": [
            "Leonard Hutton"
        ],
        "In a nutshell": [
            null
        ],
        "Major teams": [
            "England,",
            "Yorkshire"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        "He was born at Fulneck near Pudsey into a family in which there was a healthy respect for the old virtues of discipline and self-denial. It was also a keen cricketing family, and the boy seems to have nursed ambitions deep in his heart to become a great player. He devoured anything he could lay his hands on about the art of batting, and by the time he had come to the notice of  George Hirst he was already a complete player. Indeed, Hirst proclaimed that there was nothing to teach him;  Sutcliffe, more extravagant in his praise, predicted that he would play for  England. By  1934, still only 17, he was ready for first-class cricket, and in fourteen matches in the Championship he at once made his mark with five fifties and a maiden first-class century -- an innings of 196 against  Worcestershire at Worcester. Batting with supreme confidence he was last out in a total of 416. He also showed a high degree of skill in batting for four hours on a difficult pitch at Scarborough before being bowled by  Goddard for 67. Ill health a year later held him up, but in  1936 he made his 1,000 runs for the first time, often having to bat on rain-affected pitches in that vile summer. Impatient critics complained that he was too defensive. His answer was swift and to the point, and in  1937 he let loose a torrent of runs to show himself magnificently equipped with strokes. Against  Derbyshire at  Sheffield he made 271 not out, and when  Yorkshire entertained  Leicestershire at Hull he celebrated his 21st birthday with a fine 153, sharing in an opening partnership of 315 with Sutcliffe. His season's total of 2,888 (average 56.62) was second only to Hammond's. A broken finger in July 1938 put him out of cricket for around six weeks, but in  1939 he was in superlative form with 2,167 runs in the Championship and 2,883 in all matches, including twelve hundreds.",
        "In 1941  Hutton injured his left arm so badly in a gymnasium during commando training that three bone grafts were needed to repair the damage done by the compound fracture. He was in hospital for eight months before he was finally discharged, his left arm weakened and some two inches shorter than the other. However, he set about restoring the strength to the withered arm, and by  1943 he was making plenty of runs in the Bradford League. His top hand was once more in control, as he always insisted it must be, and when in the summer of  1945 he played in the Victory matches against the Australian Services, and one or two other first-class games, all were agreed that his technique was in good working order and promised well for the future. In the post-war seasons he made runs in full measure, exceeding the 2,000 mark comfortably from  1947 to  1953 and never allowing the strain of Test cricket to interfere with his commitment to  Yorkshire. In the summer of  1949 he excelled himself. Two years earlier  Compton and  Edrich had held the stage, and  Hutton had merely had a good season. Now it was to be the turn of the Yorkshireman. His total of 3,429 runs, including twelve hundreds, was the fourth-highest aggregate in the all-time list. Furthermore he passed 1,000 runs in two separate months, breaking the record for a single month with 1,294 in June.",
        "A batsman's worth must always by judged by his performances in Test matches.  Hutton was chosen to represent his country for the first time in 1937 against  New Zealand. He had a rough start to  Lord's, making 0 and 1, but he was quickly into his stride with 100 at  Old Trafford. A year later he was destined to make history and capture the public's imagination with his 364 at  the Oval.  Hammond wanted 1,000 on the board to be certain of victory and  Hutton, suiting his game perfectly to the needs of the occasion, obliged by staying at the crease for thirteen hours seventeen minutes until 770 had been scored. The following winter in  South Africa, without scoring heavily in the Tests, he delighted spectators wherever he played by the sheer quality of his batting. Back at home he was in irresistible form against the West Indians with 196 at  Lord's, the last 96 coming in 95 minutes, and he rang down the curtain on Test cricket for six years with 165 not out at  The Oval.",
        "MCC's tour of  Australia in 1946-47 was reluctantly undertaken, for the prospect of a humiliation as complete as that of  1920-21 was abhorrent to them. But  Hutton, although often not in the best of health, had a splendid tour, scoring 1,267 runs and averaging 70. In the Second Test, at  Sydney, he savaged the Australian fast bowlers in an innings too scintillating to last, making 37 out of 49 before he unluckily hit his wicket, and he finished on a high note with an unbeaten 122 in the final Test at  Sydney before being laid low with tonsillitis between the close of first day's play and the resumption three days later. Early in 1948 he flew out to the  West Indies to reinforce  Allen's beleaguered team, but to expect him to rescue the series was asking too much. That summer, however, he was the centre of controversy in the middle of the Australian visit, when the selectors lost their heads and dropped him after he had looked in some discomfort against  Lindwall and  Miller at  Lord's. Promptly restored for  Headingley, he had the last laugh by finishing the series with scores of 81, 57, 30 (out of 52) and 64. His partnership of 359 in 310 minutes with  Washbrook at Ellis Park, Johannesburg, was the highlight of  MCC's successful tour of  South Africa under  F. G. Mann in  1948-49 and at the time was the highest for the first wicket in Test cricket. When  West Indies comprehensively defeated  England in  1950,  Hutton alone seemed able to fathom the wiles of  Ramadhin and  Valentine, and his undefeated 202 at  The Oval, when he carried his bat, was a magnificent fighting innings. Now he was nearing the final phase of his career, and he seemed to be playing better than ever. With  Compton immobilised,  Washbrook past his best and  Edrich no longer the player he was,  Hutton had to carry  England's batting. He responded by averaging 88.83 in the  1950-51 Test series in  Australia, 50 more per innings than the next Englishman; he again carried his bat, for 156 at  Adelaide, and at  Melbourne he had the satisfaction of making the winning hit in  England's first post-war victory over  Australia. But at  The Oval in  1951, against  South Africa, he had the misfortune to become the first player given out  obstructing the field in Test cricket.",
        "In 1952, against  India,  Hutton became  England's first professional captain, although he had never captained his county. He at once showed his mastery of the job and kept his side splendidly on their toes. His handling of the young  Trueman was exemplary, keeping him sharp and full of energy by restricting him to short bursts. Three of the four Tests were won, rain depriving  England of victory at  The Oval. In  1953, when the Ashes were regained in a low-scoring but nevertheless absorbing series, his leadership throughout was firm and confident, and with no-one else averaging 40 he with 55 was much the best batsman on either side. His innings of 145 at  Lord's was as near perfect an exhibition of the art of batting as one could ever expect to see. The following winter found him leading  MCC abroad for the first time, and the West Indians on their own soil presented a formidable challenge. Nothing went right to start with, the first two Tests being lost through feeble batting, but in the end the series was squared 2-2, largely through the efforts of the captain, who followed his 169 at  Georgetown in the Third Test with 205 in the Fifth at  Kingston. He was at the crease for about sixteen hours for the two innings, and all the time in sweltering heat. It had been a phenomenal feat of concentration. Now one more task remained for him: the retention of the Ashes in  Australia. This was done in style in  1954-55, and after a grievous setback at  Brisbane in the First Test.  Hutton had two young batsmen at his command in May and  Cowdrey and a most potent weapon in  Tyson, for whose success he deserved much of the credit by encouraging him to shorten his run up to the wicket.  England won three Tests in a row and most likely were deprived of a run of four by rain at  Sydney.  Hutton had little energy left for long innings, but his 80 at  Adelaide was the cornerstone of the vital victory. He had to decline the offer of the captaincy for all five Tests against  South Africa in  1955, owing to continued ill health, and early in 1956 he announced his retirement. He had captained  England 23 times, winning eleven Tests, drawing eight and losing only four. Recognition of his achievements was swift. The previous year  MCC had made him an honorary member while he was still playing, and in June he received a knighthood for his great services to the game.",
        "In 513 first-class matches,  Sir Leonard Hutton compiled 40,140 runs for an average of 55.51. He reached 100 centuries in 619 innings, the lowest ratio by an Englishman, and of his eventual total of 129 hundreds, eleven exceeded 200. Twelve times in  England and five times on tour overseas he passed 1,000 runs in a season. A useful leg-spinner in his early days, he claimed 173 wickets, average 29.51, and made 400 catches, generally in positions near the wicket. In 79 Test matches he scored 6,971 runs for the impressive average of 56.67, hitting nineteen hundreds and twice carrying his bat; he alone had passed 400 runs in a series eight times. He was a selector in 1975 and 1976 and had accepted the presidency of  Yorkshire not many months before he died. In his day he had no peer, and in the words of Geoffrey Chaucer,  He was a verray parfit gentil knight.",
        "Many were the tributes paid to  Sir Leonard Hutton at the time of his death.",
        null,
        null,
        null,
        null,
        null,
        null
    ],
    "recent_matches": [
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}