{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "2",
            "6s": "1",
            "Ave": "29.58",
            "Ct": "11",
            "HS": "78*",
            "Inns": "19",
            "Mat": "14",
            "NO": "7",
            "Runs": "355",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "20",
            "50": "91",
            "6s": "",
            "Ave": "26.56",
            "Ct": "326",
            "HS": "205",
            "Inns": "756",
            "Mat": "483",
            "NO": "85",
            "Runs": "17827",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "1",
            "5w": "2",
            "Ave": "28.09",
            "BBI": "6/35",
            "BBM": "8/108",
            "Balls": "2565",
            "Econ": "2.69",
            "Inns": "24",
            "Mat": "14",
            "Runs": "1152",
            "SR": "62.5",
            "Wkts": "41"
        },
        {
            "": "First-class",
            "10": "23",
            "4w": "",
            "5w": "118",
            "Ave": "21.63",
            "BBI": "9/32",
            "BBM": "",
            "Balls": "83604",
            "Econ": "2.84",
            "Inns": "",
            "Mat": "483",
            "Runs": "39666",
            "SR": "45.6",
            "Wkts": "1833"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/245528.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154675.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/032005/058565.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/032005/058565.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nOctober 6, 1900, Stondon Massey, Essex "
        ],
        "Bowling style": [
            "Right-arm fast"
        ],
        "Died": [
            "January 26, 1961, Newark, Nottinghamshire (aged 60 years 112 days) "
        ],
        "Full name": [
            "Morris Stanley Nichols"
        ],
        "Major teams": [
            "England,",
            "Essex"
        ]
    },
    "profile_info": [
        "\nMorris Stanley Nichols, who died on January 26, aged 60, was, in an era of a good many all-rounders, one of the best. An Essex player from 1924 to 1939, he scored 17,789 runs, average 26.39, as a left-handed batsman strong in strokes in front of the wicket and with right-arm fast bowling took 1,834 wickets for 21.66 runs apiece. Of his 20 centuries the highest was 205 against Hampshire at Southend in 1936. He was first recommended to Essex solely as a batsman, but Percy Perrin, observing his height and strong physique, encouraged him as a pace bowler. How successful this proved is shown by the fact that in each of eleven seasons Stan Nichols dismissed over 100 batsmen, his best being that of 1938 when he took 171 wickets at a cost of 19.92 runs each. He could bowl for long spells without fatigue or loss of accuracy. \n",
        "He enjoyed perhaps his greatest triumph as an all-rounder in 1935 when at Huddersfield he played the leading part in the overthrow by an innings and 204 runs of Yorkshire, the ultimate Champions, whose one defeat in the competition this was. In the two innings he gained an analysis of 11 wickets for 54 runs and he hit 146. Three years later at Gloucester, he played an innings of 159 and gained full bowling figures of 15 wickets for 165 runs, his first-innings analysis being nine wickets for 37 runs in 15.2 overs. On three other occasions he took nine wickets in an innings--for 59 runs v. Hampshire at Chelmsford in 1927; for 32 runs v. Nottinghamshire at Trent Bridge in 1936 and for 116 runs v. Middlesex at Leyton in 1930. Twice he disposed of four batsmen in four deliveries--v. Sussex at Horsham in 1929 and v. Lancashire at Chelmsford in 1935--and he also achieved the  hat-trick against Yorkshire at Leeds in 1931.",
        "Eight times he performed the cricketers' double--five in succession from 1935 till the war ended his first-class career in 1939--a number exceeded by only four men, W. Rhodes, G. H. Hirst, V. W. C. Jupp and W. E. Astill. He played 14 times for England between 1929 and 1939, took part in M.C.C. tours of Australasia in 1929 and India in 1933, also visited Jamaica on two occasions and appeared in nine matches for Players v. Gentlemen. He played in Birmingham League cricket after the war.",
        "As modest as he was popular, Nichols was once asked if he had found any batsman particularly difficult. He replied: Old George Gunn, I think. He used to walk down the pitch to me. I always felt a fool trying to bowl him out.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}