{
    "batting_averages": [
        {
            "": "Tests",
            "100": "5",
            "50": "6",
            "6s": "0",
            "Ave": "48.79",
            "Ct": "10",
            "HS": "144*",
            "Inns": "33",
            "Mat": "20",
            "NO": "4",
            "Runs": "1415",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "31",
            "50": "76",
            "6s": "",
            "Ave": "33.83",
            "Ct": "195",
            "HS": "160",
            "Inns": "505",
            "Mat": "309",
            "NO": "35",
            "Runs": "15901",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "1",
            "5w": "1",
            "Ave": "33.29",
            "BBI": "5/52",
            "BBM": "5/58",
            "Balls": "1587",
            "Econ": "3.02",
            "Inns": "27",
            "Mat": "20",
            "Runs": "799",
            "SR": "66.1",
            "Wkts": "24"
        },
        {
            "": "First-class",
            "10": "6",
            "4w": "",
            "5w": "42",
            "Ave": "20.37",
            "BBI": "8/54",
            "BBM": "",
            "Balls": "37516",
            "Econ": "2.52",
            "Inns": "",
            "Mat": "309",
            "Runs": "15767",
            "SR": "48.4",
            "Wkts": "774"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/1123347.html",
        "http://www.espncricinfo.com/magazine/content/story/533784.html",
        "http://www.espncricinfo.com/magazine/content/story/453610.html",
        "http://www.espncricinfo.com/magazine/content/story/406615.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154867.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/042004/051992.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042004/051992.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/042004/051992.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nNovember 21, 1870, Allerton Hall, Chapel Allerton, Leeds, Yorkshire "
        ],
        "Bowling style": [
            "Right-arm fast-medium"
        ],
        "Died": [
            "March 9, 1947, Hyde Park, London (aged 76 years 108 days) "
        ],
        "Full name": [
            "Frank Stanley Jackson"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Yorkshire"
        ],
        "Nickname": [
            "Jacker"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        "Regarding his luck in winning the toss in those 1905 Tests and as captain of  M.C.C., for whom he scored 85 in a rain-ruined match at  Lord's, Jackson said that at Scarborough, when captain for the seventh time against the Australians: I found Darling stripped to the waist. He said, `Now we'll have a proper tossing, and he who gets on top wins the toss.' So I said to George Hirst, `Georgie, you come and toss this time.' Darling then said, `All right, we'll toss in the old-fashioned way!' Again winning the toss, Jackson scored 123 and 31 not out, rain preventing a definite result.",
        "Born at Chapel Allerton, near Leeds, Stanley Jackson showed remarkable batting ability when at a preparatory school before he went to Harrow, when he was in the eleven for three years, being captain in 1889. He did little on the first occasion, and his father, then the Rt. Hon. W. L. Jackson, a member of the Cabinet in Lord Salisbury's second Government, promised Stanley a sovereign for each wicket he took and a shilling for each run he made. Stanley scored 21 and 59 and took eleven wickets for 68 runs; Harrow won by 156 runs. His father's generosity over cricket ceased with that match. Stanley's only comment was that he was glad he had come off, as it would do father so much good.",
        "Next year, when captain, five wickets fell to him, and his vigorous 68, best score in the match, accounted largely for victory by nine wickets. Proceeding to Cambridge, Jackson gained his Blue as a Freshman, and in 1892 he headed both the batting and bowling averages, and in first-class matches came out third among the amateur bowlers with 80 wickets for less than 19 runs apiece.",
        null,
        "Describing his first Test innings of 91 in 1893 at Lord's, Sir Stanley smiled and then related that, in the second Test at The Oval, W. G. Grace, the  England captain, said, With all these batsmen I don't know where to put you. Anywhere will do. Then number seven. Thanks. That's my lucky number; I was the seventh child. And that match brought my first hundred for England. Mold came in last when I was 99. He nearly ran me out, so in desperation I jumped in and drove Giffen high to the seats, reaching 103. Then the bewildered Mold did run me out.",
        "(There were five daughters besides the elder son, children of the first Lord Allerton. Stanley Jackson married in 1902 Julia, daughter of Henry Broadley Harrison-Broadley, then M.P. for Howdenshire. Their son, Henry Stanley Lawies, married in 1927 Grace Diana, daughter of Dr. Arthur Phillip Beddard.)",
        "Jackson figured in all the 1896 Test matches, also in the next visit of Australia when the rubber was extended to five fixtures, being credited with 118 at The Oval in 1899. In the great games of 1902 Jackson was England's best batsman. He did little at Sheffield, but at Birmingham, when three wickets fell for 35, he scored 53 and with J. T. Tyldesley saved England from collapse. At Lord's Fry and Ranjitsinhji were dismissed without a run, but Jackson and A. C. MacLaren, contemporaries at Harrow, raised the total to 102 without being separated before rain washed out the match. In the memorable Manchester struggle, which Australia won by three runs, five England wickets went down for 44 in reply to a total of 299, but Jackson and Braund pulled the game round with a partnership of 141, Jackson himself going on to make 128. At dinner in the evening of that great day a lady sitting next to him said, I was so disappointed that Ranjitsinhji failed --- and this remark was made to the man who had played the innings of his life. He was fond of telling this little yarn against himself. At The Oval Jackson scored 49, sharing in a partnership of 109 with G. L. Jessop, whose wonderful innings of 104 paved the way to  England's one-wicket victory. Altogether Jackson scored 1,415 runs in Test matches against Australia --- all in this country --- with an average of nearly 49, and took 24 wickets at an average of 33.",
        "Jackson played first for Yorkshire in 1890, and his last appearance for the side was in 1907. During that period he scored 10,405 runs for the county, averaging nearly 34 an innings, and dismissed 506 batsman for 19 runs apiece. In 1898, the only season when he appeared regularly for his county, he scored 1,566 runs and took 104 wickets. His highest scores for Yorkshire were 160 against Gloucestershire, 158 against Surrey, and 155 against Middlesex. He appeared on many occasions for  Gentlemen against Players, and in those games made a thousand runs, average 31.50, and took fifty wickets. His aggregate for all first-class matches was 16,251 runs, average 33, and 834 wickets at 19 runs each.",
        "Among his bowling triumphs were eight Lancashire wickets at  Sheffield in 1902 for 13 runs, and the last four Australian wickets in five balls at Leeds in the same year, his analysis being five wickets for 12; he and George Hirst dismissed the Australians for 23. This happened directly after England in a drawn Test match had disposed of  Australia for 36; Rhodes, who took seven wickets for 17, did not bowl in the more remarkable collapse of the  Australians for the second lowest total ever recorded by an Australian side in England. When in 1896 Harry Trott's team fell for 18 before M.C.C. at Lord's, Jackson scored 51 on a treacherous pitch. In the Gentlemen and Players match at  Lord's in 1894 he and S. M. J. Woods bowled unchanged. Jackson took 12 wickets for 77 and, in addition, made 63 --- the highest score of the match, which the Gentlemen won by an innings and 37 runs before four o'clock on the second day.",
        "Going to India with Lord Hawke's team in the winter of 1892-93, Jackson took 69 wickets at 10.27 runs apiece and tied for first place in the batting averages with A. J. L. Hill, a Cambridge contemporary. When again captain of the Light Blues in 1893, Jackson gave Ranjitsinhji his Blue. At Lord's he instructed C. M. Wells to bowl wides in order to prevent Oxford from getting a desired follow-on, and Cambridge won by 266 runs. This set an example followed by Frank Mitchell three years later, when Oxford won by four wickets, and so primarily led to an alteration in the laws, making the follow-on an optional choice for the side holding the upper hand.",
        "President of the Marylebone Club in 1921, the highest honour that a cricketer can enjoy, Sir Stanley Jackson was chairman of Test Match Selection Committee in 1934, and in 1943 presided over the special committee appointed by  M.C.C. to consider Post-war Cricket.",
        "Well-built and standing nearly six feet high, Stanley Jackson was equipped with special physical advantages for cricket; to these were added fine judgment, perseverance, and, above all, exceptional courage which amounted to belief in his own abilities. Free and stylish in method, he drove splendidly on either side of the wicket and was perhaps the finest forcing on-side batsman of his time. While essentially a forward player on hard wickets, he had at his command on sticky wickets a strength and science of back play to which few men have attained. His great stroke sent a good-length ball through the covers; he cut square or late and turned the ball cleverly on the leg side with similar precision. Nothing was better than the way he jumped in and drove the ball over the bowler's head, as shown in the life-like picture at Lord's, and as I saw at Bradford, where he sent the ball high over the football stand.",
        "A right-handed rather fast-medium bowler with a nice easy action and plenty of spin, he kept a good length and often got on a sharp off-break. On a difficult wicket he was a bowler who might dispose of any side. While always a keen and smart field, especially at cover-point, he was not in his early days a sure catch, but steadily improved in this respect and made himself in every sense a great player.",
        "At Bradford on one occasion he was out to a brilliant catch in the long field, whereupon he tucked his bat under his arm and joined vigorously in the applause which greeted the fieldsman's splendid effort.",
        "On the same ground, where there is a stone wall in front of the pavilion, a ball bowled by Jackson was sent by a low skimming drive with such force that it rolled back from the wall into the middle of the field, coming to rest practically at the bowler's feet. Jackson, in appreciation of the remarkable occurrence, made the ball a dignified bow.",
        "In the South African War Jackson served with the Royal Lancaster Regiment of Militia, and in the first Great War, 1914-18, he was Lieutenant-Colonel of a West Yorkshire Regiment battalion which he raised and commanded. He entered Parliament in 1915 and remained Unionist member for Howdenshire Division of Yorkshire until 1926. One day in the House of Commons dining room Mr. Winston Churchill, who had been his fag at Harrow, said, Let me introduce you to Mr. Lloyd George. There came a quick exclamation, I have been looking all my life for the man who gave Winston Churchill a hiding at school.",
        "When he wanted to make his maiden speech the debate went unfavourably, and he received a note from the Speaker: I have dropped you in the batting order; it's sticky wicket. Then, at a better opportunity, he sent this hint: Get your pads on; you're next in.",
        "In 1922 he was appointed Financial Secretary to the War Office, and next year he succeeded Lord Younger as Chairman of the Unionist Party Organisation. In 1927 he went out to India as Governor of Bengal. There he proved equal to the most trying situation, behaving with splendid nerve and authority when he nearly fell a victim to attempted assassination by a Calcutta girl student who fired five shots at close range, narrowly missing Sir Stanley when presiding at a meeting. His London home was bombed in 1940, and in August 1946 he was run over by a taxi, receiving a severe injury to his right leg: a climax to unpleasant experiences which no doubt contributed to his last illness and hastened the end of this very distinguished Englishman.  H. P.",
        null,
        null,
        "Our greatest amateur was undoubtedly Stanley Jackson, who was `Jacker' to everyone from his Harrow days. He was a great batsman, great bowler, fine fielder -- a great cricketer to the core. Few who remember him as a batsman know that he was once No. 10 in the batting order for Yorkshire! This is how it happened. Though he had just taken seven for 42 against Middlesex, somebody had run him out for a song and he did not seem keen to play in the next match at Chesterfield.",
        "`Why,' I argued with him, `you've just got seven of 'em out at six apiece! You must come.' So he came all right. Next day as I was writing out the order I asked him where he'd like to go in, so he said, `Oh, don't know. Treat me as a bowler.' So I wrote him down No. 10.  Brown and Tunnicliffe then proceeded to make 554 for the first wicket. I was No. 3 that day in Jackson's place. As they walked out to bat I put on my pads. I took them off for the lunch interval; I put them on again and took them off again for the tea interval. Again I put them on, and sat another couple of hours. Such is cricket!",
        "I have never seen `Jacker's' equal at bowling for his field. I remember one occasion when we were `in the cart' at Bradford against Surrey how precisely he bowled for his field, and how he apologised to me for having bowled a ball not intended. Though his grand batting for England is probably best remembered, he was a bowler of the very highest class, with a graceful, flowing delivery of a kind but rarely seen nowadays.",
        "Since those happy days `Jacker' has passed through more serious times in Bengal. There, a couple of years ago, he and I were the guests of honour at the dinner to us of the Calcutta Cricket Club given at the Bengal Club. We both made speeches, and when he got up to speak first he said across the table to me, `I've got first innings today, old man. You bossed me often enough in the past, but I'm boss here!'",
        null,
        "I had known Sir Stanley Jackson since 1889, when Harrow met Rugby at Althorp Park. On that evening began a friendship which grew with the years, and which I prized greatly. `He was my friend, faithful and just to me,' and though we all have to face the Pale Horseman there is no need to be afraid of him, and I am certain Sir Stanley faced him with the same calm courage as he showed in the great matches of his day. He was a splendid allround cricketer -- one of the finest in the history of cricket -- and never was he finer than in a crisis; it was a stirring sight to see him come down the pavilion steps to set right any early failures there may have been; immaculate in his flannels and his beautifully cleaned pads and boots, with his neat trim figure every inch a cricketer. No English cricketer had a finer record in England against Australia. And then, when he gave up, he sat on the Woolsack of Cricket, as President of the  M.C.C., and at the time of his death he was a trustee of  Lord's, chairman of the Cricket Committee, and president of the Yorkshire C.C.C. To the end he took the greatest possible interest in M.C.C. Never a week passed, even during the winter, that he was not at Lord's, and in the summer he was the best known of all the men who delight in the charm and atmosphere of the famous ground. He was busy with every avenue and aspect of the game and his enthusiasm never flagged. That he had been seriously ill for some time was obvious, but only a few days before he died he telephoned asking me to come to see him. I found him in good spirits, saying that he felt so much better that he had good hopes of coming to Lord's for a committee meeting.",
        "As a batsman he was soundness itself, with all the strokes -- what I call a `complete' batsman. His style was easy and natural and he inspired confidence. Bowling medium pace, with a beautifully easy action, he kept a length. At cover point, his usual position, he was not a Hobbs or a Jessop, but active and quick, missing few chances. In a gallery of great players it is impossible to have a fixed order of merit, but he was in the first class of an honours school of cricket both as a batsman and an allrounder. When you have known and been very fond of a man for nearly sixty years it is not easy to write exactly what you feel about him, but this I will say, that his manner was always easy and pleasant, and in the cricket world, by young and old alike, he was welcomed, appreciated and respected. His absence leaves a big void.",
        "Wilfred Rhodes, now 70 years of age, wrote:--",
        "In paying a modest tribute to the late Sir Stanley Jackson it is difficult for me to find words that would express my appreciation of such a great cricketer with so fine a personality. From 1898 to the close of his first-class cricket career I was fortunate to play on the same side for Yorkshire and under his captaincy several times for  England, chiefly in Tests against Australia, and had a great admiration for his ability. He was one of England's greatest captains and played many splendid innings during this period. It was a pity he never toured Australia, as I think he would have been very successful with his style of play on their fast wickets.",
        "A model allround cricketer if ever there was one, he was immaculately dressed, flannels always neat and trim even at the end of a long innings, and whether batting, bowling or in the field, his movements were stylish and graceful. He was a great batsman and possessed the gift of a fine temperament, with plenty of confidence and pluck, and always appeared at his best on great occasions, especially when fighting with his back to the wall. Many times he pulled the game around for  England and helped to put them on the way to victory. His batting was stylish, orthodox and very copy-book, with strokes all round the wicket, and particularly strong to the off.",
        "As a bowler he used spin and variation of pace with a clever slow one. On one occasion, when bowling to G. L. Jessop at Cambridge, he sent up his slower ball, which was hit out of the field over the trees. Schofield Haigh, fielding mid-on, was laughing, and F.S., turning round, said to him, `What are you laughing at?' Haigh replied, `Your slow ball, sir.' F. S.: `It was a good one, wasn't it?'",
        "George Hirst, the famous Yorkshire cricketer, now in his 77th year, wrote at the time of Sir Stanley's death:--",
        "I am deeply grieved to learn of the death of my friend and colleague. He was one of the most graceful of all cricketers, whether he was batting, bowling or fielding, and he was a perfect gentleman in everything he did, both on and off the field.",
        "In him young cricketers had a perfect model. Many are the times I have seen him with a beautifully rolled umbrella in his hand demonstrating strokes to schoolboys. He loved to help the youngsters, and that was possibly why he was always so keenly interested in my work as coach to the county club. I have indeed lost a good friend.",
        "Mr. H. D. G. Leveson Gower said: As a Test Match player Sir Stanley never has been excelled in temperament or skill. I served with him on many M.C.C. committees, and his views on the game always commanded attention. I played against him for Oxford in the Varsity match of 1893, and consider the Cambridge eleven he captained one of the most powerful to represent that University. His name will always live in the annals of cricket, the game he adorned.",
        "Mr. Stanley Christopherson, President of M.C.C. for several years until 1946: I held the greatest admiration for Sir Stanley both as a cricketer and for his great work for the game; he was most painstaking and did splendid work on many committees and as a selector.",
        "Mr. T. L. Taylor, an old Cambridge Blue who was elected the new president of Yorkshire in the autumn, a contemporary player with Sir Stanley, described his death as a very serious loss to county and international cricket and the game in general, and said:  He was one of Yorkshire's greatest allrounders, and one of  England's most redoubtable Test captains.",
        "The King was represented by Lord Chorley at the London memorial service for Sir Stanley Jackson. Canon F. H. Gillingham, the former Essex cricketer, who conducted the service, said:--",
        "The first time I ever played with him I was impressed with his strength of character and control. He always seemed to have that extra reserve of strength to compete with any cricket crisis, however severe.",
        "He was the most honest man I ever met -- in fact he was too honest. I never heard him say an unkind word about anyone, and he always had excuses for anyone who spoke an unkind word to him.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}