{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "36",
            "50": "1",
            "6s": "0",
            "Ave": "11.16",
            "BF": "901",
            "Ct": "8",
            "HS": "56",
            "Inns": "47",
            "Mat": "36",
            "NO": "22",
            "Runs": "279",
            "SR": "30.96",
            "St": "0"
        },
        {
            "": "ODIs",
            "100": "0",
            "4s": "11",
            "50": "0",
            "6s": "3",
            "Ave": "8.00",
            "BF": "223",
            "Ct": "15",
            "HS": "35",
            "Inns": "30",
            "Mat": "69",
            "NO": "13",
            "Runs": "136",
            "SR": "60.98",
            "St": "0"
        },
        {
            "": "T20Is",
            "100": "0",
            "4s": "1",
            "50": "0",
            "6s": "0",
            "Ave": "-",
            "BF": "19",
            "Ct": "6",
            "HS": "8*",
            "Inns": "3",
            "Mat": "21",
            "NO": "3",
            "Runs": "14",
            "SR": "73.68",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "4s": "143",
            "50": "1",
            "6s": "5",
            "Ave": "8.99",
            "BF": "2872",
            "Ct": "47",
            "HS": "56",
            "Inns": "178",
            "Mat": "147",
            "NO": "59",
            "Runs": "1070",
            "SR": "37.25",
            "St": "0"
        },
        {
            "": "List A",
            "100": "0",
            "4s": "33",
            "50": "0",
            "6s": "8",
            "Ave": "10.82",
            "BF": "569",
            "Ct": "31",
            "HS": "42*",
            "Inns": "57",
            "Mat": "142",
            "NO": "23",
            "Runs": "368",
            "SR": "64.67",
            "St": "0"
        },
        {
            "": "T20s",
            "100": "0",
            "4s": "5",
            "50": "0",
            "6s": "0",
            "Ave": "11.00",
            "BF": "65",
            "Ct": "21",
            "HS": "8*",
            "Inns": "17",
            "Mat": "88",
            "NO": "12",
            "Runs": "55",
            "SR": "84.61",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "6",
            "5w": "5",
            "Ave": "30.40",
            "BBI": "6/79",
            "BBM": "9/187",
            "Balls": "6412",
            "Econ": "3.55",
            "Inns": "66",
            "Mat": "36",
            "Runs": "3800",
            "SR": "51.2",
            "Wkts": "125"
        },
        {
            "": "ODIs",
            "10": "0",
            "4w": "4",
            "5w": "2",
            "Ave": "29.37",
            "BBI": "5/33",
            "BBM": "5/33",
            "Balls": "3550",
            "Econ": "5.06",
            "Inns": "67",
            "Mat": "69",
            "Runs": "2996",
            "SR": "34.8",
            "Wkts": "102"
        },
        {
            "": "T20Is",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "21.59",
            "BBI": "3/16",
            "BBM": "3/16",
            "Balls": "480",
            "Econ": "7.28",
            "Inns": "21",
            "Mat": "21",
            "Runs": "583",
            "SR": "17.7",
            "Wkts": "27"
        },
        {
            "": "First-class",
            "10": "1",
            "4w": "29",
            "5w": "13",
            "Ave": "28.98",
            "BBI": "9/37",
            "BBM": "",
            "Balls": "26418",
            "Econ": "3.45",
            "Inns": "",
            "Mat": "147",
            "Runs": "15216",
            "SR": "50.3",
            "Wkts": "525"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "7",
            "5w": "3",
            "Ave": "28.81",
            "BBI": "5/33",
            "BBM": "5/33",
            "Balls": "6737",
            "Econ": "5.13",
            "Inns": "138",
            "Mat": "142",
            "Runs": "5762",
            "SR": "33.6",
            "Wkts": "200"
        },
        {
            "": "T20s",
            "10": "0",
            "4w": "2",
            "5w": "0",
            "Ave": "22.33",
            "BBI": "4/24",
            "BBM": "4/24",
            "Balls": "1826",
            "Econ": "7.63",
            "Inns": "86",
            "Mat": "88",
            "Runs": "2323",
            "SR": "17.5",
            "Wkts": "104"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/1153389.html",
        "http://www.espncricinfo.com/ci/content/story/1147666.html",
        "http://www.espncricinfo.com/ci/content/story/1145851.html",
        "http://www.espncricinfo.com/ci/content/story/1144724.html",
        "http://www.espncricinfo.com/australia-v-england-2017/content/story/1129763.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=210283"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/270800/270887.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/270800/270887.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/270800/270887.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nApril 4, 1989, Watford, Hertfordshire "
        ],
        "Bowling style": [
            "Right-arm fast-medium"
        ],
        "Current age": [
            "29 years 136 days"
        ],
        "Education": [
            "Parmiter's School, Watford"
        ],
        "Full name": [
            "Steven Thomas Finn"
        ],
        "Height": [
            "\n6 ft 7 in "
        ],
        "Major teams": [
            "England,",
            "England Lions,",
            "England Under-19s,",
            "Islamabad United,",
            "Middlesex,",
            "Middlesex 2nd XI,",
            "Otago"
        ],
        "Nickname": [
            "Finny"
        ],
        "Playing role": [
            "Bowler"
        ]
    },
    "profile_info": [
        "\nSteven Finn, standing at 6ft 7ins, has been  the latest beanpole fast bowler to carry England's hopes, but despite a respectable average around 30, it is a mantle he has not always carried happily. Pinging the ball down from the clouds he has the heady blend of pace and trampolining bounce to rattle the best players.  At his best, his potential looks immense, but he is a gentle character given to periods of technical self-doubt and his career has often been fraught with uncertainty. \n",
        "Finn's career went into reverse in 2013/14. Issues with his delivery stride - a habit of kneeing the stumps led to a Law change making it a no-ball - and control meant he has been in and out of the side. Endless tinkering with his action then left him visibly bereft of confidence. He was the only member of England's vanquished Ashes Test squad not to play in the 5-0 whitewash and cut a forlorn figure on the practice grounds as his action was stripped right back to basics. It all led to him being sent home from England's tour of Australia after being deemed \"not selectable\" - an honest and sympathetic assessment - by his one-day coach Ashley Giles.",
        "What followed was a long period of rehabilitation and many long hours in winter nets at Finchley CC. In 2014, his 48 first-class wickets showed progress, even if his pace and consistency were inconsistent, but the input of a host of coaches slowly brought dividends and led to his return in England's victorious Ashes series after a two-year absence in which he had been limited only to limited-overs appearances for his country. The unveiling of a new outswinger and the particular joy of a six-wicket haul at Edgbaston gave him the confidence to pronounce that the past was behind him.",
        "Finn made his county debut for Middlesex as a 16-year-old in 2005, the youngest to do so since Fred Titmus in 1949, and was earmarked as an England prospect from his early days, representing England at all age-group levels from Under-16s upwards. He enjoyed a solid 2009 season for Middlesex, taking 53 wickets at 30.64 in the Championship, and then did well for England Lions in the UAE. With Stuart Broad, Graham Onions and Ryan Sidebottom all picking up injuries early on England's tour to Bangladesh, Finn was parachuted in as cover. Barely 24 hours after arriving in the country he was playing in the warm-up game against Bangladesh A and impressed on his Test debut three days later, displaying good pace and bounce on a docile Chittagong surface.",
        "With the England management desperately searching for a consistent replacement for Steve Harmison, Finn marked his home debut, also against Bangladesh, in style. In the familiar surroundings of Lord's, he carried a rusty England attack with 4 for 100 in the first innings and went one better in the second, taking 5 for 87 to finish with nine in the game and the man-of-the-match medal in just his third Test.",
        "He kept his place against Pakistan and despite doubts as to whether he was ready for the challenge of a tour of Australia, Finn fronted up impressively in his early outings. He claimed a career-best 6 for 125 to help turn the tide in the first Test at the Gabba, before stepping into the breach left by an injury to Stuart Broad to help seal victory in the second Test at Adelaide. Though he faded at Perth and was omitted from the last two matches, he'd done enough to confirm his promise.",
        "A single Test appearance in 2011 followed, during which he became the youngest Englishman to 50 wickets, but Tim Bresnan and Chris Tremlett moved ahead of him in third-seamer pecking order. An impressive tour of India pushed him firmly into one-day contention, however, and he was a virtual ever-present in limited-overs cricket in 2012, as England briefly topped the ODI rankings but failed in their World Twenty20 defence.",
        "Finn won a Test recall against South Africa but a habit of hitting the stumps in his delivery stride became costly when Graeme Smith drew attention to it at Headingley. The umpires decided to call dead ball and Finn was denied Smith's wicket. A few months later, 'Finn's Law' was created, making any wicket taken after a bowler had knocked over the stumps a no ball. ",
        "Injury curtailed Finn's involvement in the historic Test series win in India but he was back in the XI in New Zealand, beginning his longest run in the side since his debut. A shortened run-up was experimented with before being abandoned but his rhythm had been affected and, having played just once in England's Champions Trophy campaign, he was dropped after the first Test of the 2013 Ashes. After his tumultuous winter in 2013/14, he rebuilt his confidence with the aid of Middlesex bowling coach Richard Johnson and was rewarded with an ODI recall against India in August 2014. For all the problems, further success in the 2015 Ashes series left England still convinced that Finn was a bowler of rare potential.",
        "A stress fracture of the foot ruled him out of a series against Pakistan in the UAE but his recovery on a Lions tour of the Emirates was swift and he was called into England's South Africa squad ahead of the first Test.",
        "If the collapse of his action in Australia in 2013/14 was a low point, he was successful enough to proclaim in England's 2015 Ashes victory that his problems were behind him, encouraged by a Test-best 6 for 79 at Edgbaston. He acquitted himself ably enough, too during England's series win in South Africa, only for his career to take another twist when he lost his limited-overs place just as he returned to Test cricket.",
        null
    ],
    "recent_matches": [
        {
            "Bat & Bowl": "2/36",
            "Ground": "Lord's",
            "Match Date": "16 Aug 2018",
            "Opposition": "v Essex",
            "Scorecard": "T20",
            "Team": "Middlesex"
        },
        {
            "Bat & Bowl": "1/24",
            "Ground": "Bristol",
            "Match Date": "9 Aug 2018",
            "Opposition": "v Gloucs",
            "Scorecard": "T20",
            "Team": "Middlesex"
        },
        {
            "Bat & Bowl": "3, 2/37",
            "Ground": "Richmond",
            "Match Date": "5 Aug 2018",
            "Opposition": "v Glamorgan",
            "Scorecard": "T20",
            "Team": "Middlesex"
        },
        {
            "Bat & Bowl": "0/41, 1*",
            "Ground": "Lord's",
            "Match Date": "2 Aug 2018",
            "Opposition": "v Sussex",
            "Scorecard": "T20",
            "Team": "Middlesex"
        },
        {
            "Bat & Bowl": "3/21",
            "Ground": "Lord's",
            "Match Date": "26 Jul 2018",
            "Opposition": "v Hampshire",
            "Scorecard": "T20",
            "Team": "Middlesex"
        },
        {
            "Bat & Bowl": "1/28, 2*",
            "Ground": "Southampton",
            "Match Date": "20 Jul 2018",
            "Opposition": "v Hampshire",
            "Scorecard": "T20",
            "Team": "Middlesex"
        },
        {
            "Bat & Bowl": "0/29",
            "Ground": "Lord's",
            "Match Date": "19 Jul 2018",
            "Opposition": "v Somerset",
            "Scorecard": "T20",
            "Team": "Middlesex"
        },
        {
            "Bat & Bowl": "1/91, 0, 1/32, 9",
            "Ground": "Leicester",
            "Match Date": "20 Jun 2018",
            "Opposition": "v Leics",
            "Scorecard": "FC",
            "Team": "Middlesex"
        },
        {
            "Bat & Bowl": "0/50, 11*",
            "Ground": "Lord's",
            "Match Date": "9 Jun 2018",
            "Opposition": "v Australians",
            "Scorecard": "LA",
            "Team": "Middlesex"
        },
        {
            "Bat & Bowl": "6, 2/53",
            "Ground": "Lord's",
            "Match Date": "3 Jun 2018",
            "Opposition": "v Surrey",
            "Scorecard": "LA",
            "Team": "Middlesex"
        }
    ]
}