{
    "batting_averages": [
        {
            "": "Tests",
            "100": "1",
            "4s": "370",
            "50": "12",
            "6s": "37",
            "Ave": "19.78",
            "BF": "4572",
            "Ct": "37",
            "HS": "169",
            "Inns": "173",
            "Mat": "120",
            "NO": "22",
            "Runs": "2988",
            "SR": "65.35",
            "St": "0"
        },
        {
            "": "ODIs",
            "100": "0",
            "4s": "35",
            "50": "0",
            "6s": "10",
            "Ave": "12.30",
            "BF": "709",
            "Ct": "27",
            "HS": "45*",
            "Inns": "68",
            "Mat": "121",
            "NO": "25",
            "Runs": "529",
            "SR": "74.61",
            "St": "0"
        },
        {
            "": "T20Is",
            "100": "0",
            "4s": "7",
            "50": "0",
            "6s": "3",
            "Ave": "7.37",
            "BF": "118",
            "Ct": "21",
            "HS": "18*",
            "Inns": "26",
            "Mat": "56",
            "NO": "10",
            "Runs": "118",
            "SR": "100.00",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "1",
            "4s": "",
            "50": "24",
            "6s": "",
            "Ave": "20.83",
            "BF": "7575",
            "Ct": "68",
            "HS": "169",
            "Inns": "270",
            "Mat": "196",
            "NO": "38",
            "Runs": "4834",
            "SR": "63.81",
            "St": "0"
        },
        {
            "": "List A",
            "100": "0",
            "4s": "42",
            "50": "0",
            "6s": "10",
            "Ave": "11.92",
            "BF": "817",
            "Ct": "32",
            "HS": "45*",
            "Inns": "80",
            "Mat": "151",
            "NO": "28",
            "Runs": "620",
            "SR": "75.88",
            "St": "0"
        },
        {
            "": "T20s",
            "100": "0",
            "4s": "10",
            "50": "0",
            "6s": "3",
            "Ave": "7.60",
            "BF": "149",
            "Ct": "26",
            "HS": "18*",
            "Inns": "32",
            "Mat": "85",
            "NO": "12",
            "Runs": "152",
            "SR": "102.01",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "2",
            "4w": "16",
            "5w": "16",
            "Ave": "28.80",
            "BBI": "8/15",
            "BBM": "11/121",
            "Balls": "24646",
            "Econ": "2.97",
            "Inns": "219",
            "Mat": "120",
            "Runs": "12214",
            "SR": "58.1",
            "Wkts": "424"
        },
        {
            "": "ODIs",
            "10": "0",
            "4w": "9",
            "5w": "1",
            "Ave": "30.13",
            "BBI": "5/23",
            "BBM": "5/23",
            "Balls": "6109",
            "Econ": "5.26",
            "Inns": "121",
            "Mat": "121",
            "Runs": "5364",
            "SR": "34.3",
            "Wkts": "178"
        },
        {
            "": "T20Is",
            "10": "0",
            "4w": "1",
            "5w": "0",
            "Ave": "22.93",
            "BBI": "4/24",
            "BBM": "4/24",
            "Balls": "1173",
            "Econ": "7.62",
            "Inns": "55",
            "Mat": "56",
            "Runs": "1491",
            "SR": "18.0",
            "Wkts": "65"
        },
        {
            "": "First-class",
            "10": "3",
            "4w": "28",
            "5w": "27",
            "Ave": "27.43",
            "BBI": "8/15",
            "BBM": "",
            "Balls": "37211",
            "Econ": "3.08",
            "Inns": "",
            "Mat": "196",
            "Runs": "19119",
            "SR": "53.3",
            "Wkts": "697"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "9",
            "5w": "1",
            "Ave": "30.51",
            "BBI": "5/23",
            "BBM": "5/23",
            "Balls": "7496",
            "Econ": "5.27",
            "Inns": "",
            "Mat": "151",
            "Runs": "6591",
            "SR": "34.7",
            "Wkts": "216"
        },
        {
            "": "T20s",
            "10": "0",
            "4w": "1",
            "5w": "0",
            "Ave": "21.44",
            "BBI": "4/24",
            "BBM": "4/24",
            "Balls": "1788",
            "Econ": "7.19",
            "Inns": "83",
            "Mat": "85",
            "Runs": "2144",
            "SR": "17.8",
            "Wkts": "100"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/1155650.html",
        "http://www.espncricinfo.com/ci/content/story/1155176.html",
        "http://www.espncricinfo.com/ci/content/story/1155072.html",
        "http://www.espncricinfo.com/ci/content/story/1154525.html",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/1154076/what-is-the-best-length-to-bowl-in-tests",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=10617"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/279200/279262.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/279200/279262.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/279200/279262.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nJune 24, 1986, Nottingham "
        ],
        "Bowling style": [
            "Right-arm fast-medium"
        ],
        "Current age": [
            "32 years 55 days"
        ],
        "Education": [
            "Oakham School"
        ],
        "Full name": [
            "Stuart Christopher John Broad"
        ],
        "Height": [
            "\n6 ft 5 in "
        ],
        "Major teams": [
            "England,",
            "Hobart Hurricanes,",
            "Kings XI Punjab,",
            "Leicestershire,",
            "Nottinghamshire"
        ],
        "Nickname": [
            "Broady"
        ],
        "Playing role": [
            "Bowler"
        ],
        "Relation": [
            null,
            "\n"
        ]
    },
    "profile_info": [
        "\nWhatever innocent impression might initially be given by his blond hair and baby-faced good looks, there have been few feistier cricketers in England's Test history than Stuart Broad. His new-ball partnership with James Anderson has sustained England's Test attack for years, his own aggression and ability to flog bounce from all but the most benign surface dovetailing nicely with Anderson's technical excellence. While Anderson gained plaudits for becoming the first England bowler to reach 400 Test wickets, it attracted less attention that Stuart Broad was close to overhauling Ian Botham as he headed for the same landmark. \n",
        "Broad has been blessed with one remarkable career performance. However long he plays, surely nothing will come close to the first session of the Ashes Test of 2015, on his home ground of Trent Bridge, when he took eight for 15 as Australia were bowled out before lunch, in only 18.3 overs, for 60. This was Australia's ultimate humiliation - a beating as raw and ridiculed as the 5-0 larruping that it avenged from 18 months earlier. Broad's incredulous hands-to-mouth expression as Ben Stokes plucked a catch at fifth slip became the picture of the summer.",
        "Broad has always been a bowler capable of a hot streak. On the occasion of his 100th Test in November 2016, he had taken five wickets in a single spell seven times. On such occasions, he runs in hard and his menace visibly grows. His combative fast bowling and volatile temperament (comparisons have been made with Draco Malfoy, a Harry Potter baddie) has been one of his great strengths as well as periodically bringing criticism about his behaviour, but the respect in which he is held was amplified when England recognised his desire to succeed and ability to think on his feet by appointing him as Twenty20 captain. He led the side on 27 occasions between 2011-15 before England, with an eye to the preservation of a vital player, utilised him increasingly as a Test specialist.",
        "Despite being carted for six sixes in an over by Yuvraj Singh at the inaugural World Twenty20 in 2007, his stock continued to rise on tour with England in Sri Lanka when his 11 cheap wickets helped them to a 3-2 one-day series victory. He was then called up for the subsequent Test series in December, making his debut on a slab of Colombo concrete and toiling for 36 sweaty overs. The subsequent tour of New Zealand proved to be his real chance, however. With Matthew Hoggard and Steve Harmison both lacking form, he was selected for the Wellington Test. The decision taken by his coach Peter Moores and captain Michael Vaughan was soon vindicated.  ",
        "Broad was already shaping up as the Next Big Thing of English cricket when he pushed his career into overdrive in a sensational spell of bowling in the fifth and decisive Ashes Test at The Oval in 2009. With the series in the balance, Broad claimed figures of 5 for 37 in 12 overs, including 4 for 8 in 21 balls, and after that there was no coming back for Australia.",
        "He was struck by injury for the first time in the 2010-11 winter, ruled out of the last three Ashes Tests before breaking down again during the World Cup. However, his significance in England's future was confirmed when he was named Twenty20 captain in May 2011. A slump in form almost cost him his Test place for the visit of India but, having survived the cut, he responded with a man-of-the-series display, including the first Test match hat-trick to be recorded at Trent Bridge, in a spell of 5 for 5: a career-defining period.",
        "Broad's form with the ball was one of the few positives as England suffered a 3-0 whitewash against Pakistan in February 2012 and he began the domestic Test season in splendid form, against the West Indies at Lord's, taking 7 for 72 in the first innings, which made him only the eighth player to earn the distinction of being on two honours boards at the home of cricket. His four in the second innings made him the first England bowler to take 10 wickets or more in a match there since Ian Botham in 1978.",
        "His subsequent form was less impressive, however. Concerns that he was dropping in pace were alleviated by eight wickets against South Africa at Headingley, but he lost his place on the tour of India, after struggling with a heel injury and failing to take a wicket in either of the first two Tests. After being fitted with specially designed boots, he showed signs of improvement in New Zealand at the start of 2013.",
        "That recovery was confirmed in the home series, as he ripped out 7 for 44 - his best Test figures - against New Zealand at Lord's, and he then almost single-handedly won the Durham Test against Australia with another 11-wicket haul (six in one inspired spell), as England secured their third Ashes series in a row. There was a six-for in the first innings at Brisbane, as England began the return tour in 2013/14 well enough - only to end up being whitewashed for the third time in Ashes history. Broad's growing maturity was never more evident. He went to Australia as a marked man, after his butter-wouldn't-melt failure to walk for an obvious nick at Trent Bridge the previous summer, his nick against Ashton Agar looking all the worse because the ball cannoned off the gloves of wicketkeeper Brad Haddin to first slip. Broad had to withstand a self-righteous debate about \"walking,\" a practice which had largely died out for half a century, and he was roundly booed by Australian crowds throughout the winter, but he softened their hostility by good-naturedly soaking up all they threw at him, as well as producing some of England's best spells, and emerging as their leading wicket-taker, on a forgettable tour.",
        "He was too hostile for India again at Old Trafford in 2014, returned his Ashes 8 for 15 the following year, then treated South Africa to a concerted assault in Johannesburg in 2015/16. His latest five-wickets-in-a-spell burst was the first of the kind overseas and brought a decisive end to South Africa's proud stint as the world No.1 Test side.",
        "His batting has flattered to deceive. In 2008, no less a technical purist than Geoffrey Boycott likened his tall elegant batting style to Sir Garfield Sobers, but predictions that he would develop into a fully-fledged allrounder have not come to pass. Nevertheless, he has a remarkable Test hundred against his name, his stand-and-deliver assault on the Pakistan attack at Lord's in 2010, from 102 for 7, bringing him 169 - the highest score by an England Test No. 9. The Test was later sullied by revelations that Pakistan bowled deliberate no balls in the Test, bringing lengthy bans for three of their players.",
        "In his early cricketing career, Broad played as an opening batsman, following the example of his father, Chris, until he suddenly shot up. Within 18 months he had transformed himself into a beanpole medium-fast bowler, gaining international recognition with the England Under-19 side and establishing himself in the Leicestershire first XI in 2005, beginning a meteoric rise that included an England A debut in only his 11th first-class match in March 2006 and a call-up to the senior one-day side five months later. County cricket figured little for such an England regular but when he played (and often when he wasn't) his commitment to Nottinghamshire was impressive, suggesting a player who had not lost touch with his roots. He moved from Leicestershire to Nottinghamshire, his father's county, in 2008. He bowled with pace and swing to return career-best figures of 8 for 52 against Warwickshire at Edgbaston in July 2010, as well as helping them to lift the 2013 YB40 trophy at Lord's - the county's first one-day silverware in 22 years.",
        null
    ],
    "recent_matches": [
        {
            "Bat & Bowl": "1/37, 4/44",
            "Ground": "Lord's",
            "Match Date": "9 Aug 2018",
            "Opposition": "v India",
            "Scorecard": "Test # 2315",
            "Team": "England"
        },
        {
            "Bat & Bowl": "1, 0/40, 11, 2/43",
            "Ground": "Birmingham",
            "Match Date": "1 Aug 2018",
            "Opposition": "v India",
            "Scorecard": "Test # 2314",
            "Team": "England"
        },
        {
            "Bat & Bowl": "3, 2/80, 1",
            "Ground": "Nottingham",
            "Match Date": "22 Jul 2018",
            "Opposition": "v Surrey",
            "Scorecard": "FC",
            "Team": "Notts"
        },
        {
            "Bat & Bowl": "23, 2/52, 0/32",
            "Ground": "Nottingham",
            "Match Date": "25 Jun 2018",
            "Opposition": "v Worcs",
            "Scorecard": "FC",
            "Team": "Notts"
        },
        {
            "Bat & Bowl": "3/38, 2, 3/28",
            "Ground": "Leeds",
            "Match Date": "1 Jun 2018",
            "Opposition": "v Pakistan",
            "Scorecard": "Test # 2305",
            "Team": "England"
        },
        {
            "Bat & Bowl": "0, 1/61, 0, 0/13",
            "Ground": "Lord's",
            "Match Date": "24 May 2018",
            "Opposition": "v Pakistan",
            "Scorecard": "Test # 2304",
            "Team": "England"
        },
        {
            "Bat & Bowl": "20, 4/41, 4",
            "Ground": "Nottingham",
            "Match Date": "11 May 2018",
            "Opposition": "v Lancashire",
            "Scorecard": "FC",
            "Team": "Notts"
        },
        {
            "Bat & Bowl": "33, 3/45, 1, 3/57",
            "Ground": "Nottingham",
            "Match Date": "4 May 2018",
            "Opposition": "v Hampshire",
            "Scorecard": "FC",
            "Team": "Notts"
        },
        {
            "Bat & Bowl": "3/28, 38, 1/17",
            "Ground": "Worcester",
            "Match Date": "27 Apr 2018",
            "Opposition": "v Worcs",
            "Scorecard": "FC",
            "Team": "Notts"
        },
        {
            "Bat & Bowl": "5, 6/54, 12, 2/72",
            "Ground": "Christchurch",
            "Match Date": "30 Mar 2018",
            "Opposition": "v New Zealand",
            "Scorecard": "Test # 2301",
            "Team": "England"
        }
    ]
}