{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "8.06",
            "Ct": "12",
            "HS": "38*",
            "Inns": "39",
            "Mat": "27",
            "NO": "9",
            "Runs": "242",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "2",
            "6s": "",
            "Ave": "12.78",
            "Ct": "72",
            "HS": "93",
            "Inns": "173",
            "Mat": "133",
            "NO": "50",
            "Runs": "1573",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "7",
            "4w": "2",
            "5w": "24",
            "Ave": "16.43",
            "BBI": "9/103",
            "BBM": "17/159",
            "Balls": "7873",
            "Econ": "2.36",
            "Inns": "50",
            "Mat": "27",
            "Runs": "3106",
            "SR": "41.6",
            "Wkts": "189"
        },
        {
            "": "First-class",
            "10": "18",
            "4w": "",
            "5w": "68",
            "Ave": "17.09",
            "BBI": "9/103",
            "BBM": "",
            "Balls": "31527",
            "Econ": "2.33",
            "Inns": "",
            "Mat": "133",
            "Runs": "12289",
            "SR": "43.8",
            "Wkts": "719"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/blogs/content/story/1071762.html",
        "http://www.espncricinfo.com/ci/content/story/1055689.html",
        "http://www.espncricinfo.com/blogs/content/story/977995.html",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/761943/which-is-the-finest-bowling-pair",
        "http://www.espncricinfo.com/magazine/content/story/697977.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=8996"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/21600/21623.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/21600/21623.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/21600/21623.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nApril 19, 1873, Smethwick, Staffordshire "
        ],
        "Bowling style": [
            "Right-arm fast-medium, Right-arm medium"
        ],
        "Died": [
            "December 26, 1967, Chadsmoor, Staffordshire (aged 94 years 251 days) "
        ],
        "Full name": [
            "Sydney Francis Barnes"
        ],
        "Major teams": [
            "England,",
            "Lancashire,",
            "Wales,",
            "Warwickshire"
        ],
        "Playing role": [
            "Bowler"
        ]
    },
    "profile_info": [
        null,
        "Most cricketers and students of the game belonging to the period in which S.F. Barnes played were agreed that he was the bowler of the century. Australians as well as English voted him unanimously the greatest. Clem Hill, the famous  Australian left-handed batsman, who in successive Test innings scored 99, 98, 97, v. A.C. MacLaren's England team of 1901-02, told me that on a perfect wicket Barnes could swing the new ball in and out \"very late\", could spin from the ground, pitch on the leg stump and miss the off. At  Melbourne, in December 1911, Barnes in five overs overwhelmed Kelleway, Bardsley, Hill and Armstrong for a single.",
        "Hill was clean bowled by him. \"The ball pitched outside my leg-stump, safe to the push off my pads, I thought. Before I could `pick up' my bat, my off-stump was knocked silly.\"",
        "Barnes was creative, one of the first bowlers really to use the seam of a new ball and combine swing so subtly with spin that few batsmen could distinguish one from the other.",
        "He made a name before a new ball was available to an attack every so many runs or overs. He entered first-class cricket at a time when one ball had to suffice for the whole duration of the batting side's innings.",
        "He was professional in the Lancashire League when A.C. MacLaren, hearing of his skill, invited him to the nets at Old Trafford. \"He thumped me on the left thigh. He hit my gloves from a length. He actually said, `Sorry, sir!' and I said, `Don't be sorry, Barnes. You're coming to Australia with me.'\"",
        "MacLaren on the strength of a net practice with Barnes chose him for his  England team in Australia of 1901-02. In the first Test of that rubber, Barnes took five for 65 in 35.1 overs, and one for 74 in 16 overs. In the second Test he took six for 42 and seven for 121 and he bowled 80 six-ball overs in this game.",
        "He broke down, leg strain, in the third Test and could bowl no more for MacLaren, who winning the first Test, lost the next four of the rubber.",
        null,
        "Throughout his career he remained mysteriously aloof, appearing in the full sky of first-class cricket like a meteor -- declaring the death of the most princely of batsmen! He preferred the reward and comparative indolence of Saturday league matches to the daily toil of the county tourney.",
        "Here is one of the reasons of his absence from the England XI between 1902 and 1907. He didn't go to Australia as one of P.F. Warner's team of 1903-04 and took no part of the 1905 England v.  Australia rubber. The future historian of cricket may well gape and wonder why, in the crucial Test of 1902, Barnes didn't play for England at Manchester, where the rubber went to Australia by three runs only.",
        "Barnes had bowled for England at Sheffield in the third and previous Test, taking six for 49 and one for 50. It is as likely as conjecture about cricket ever can be likely that had  Barnes taken part in the famous Manchester Test of 1902 England wouldn't have lost the rubber by a hair's breadth.",
        "He was in those days not an easy man to handle on the field of play. There was a Mephistophelian aspect about him. He didn't play cricket out of any green field starry-eyed idealism. He rightly considered that his talents were worth estimating in cash values. In his old age he mellowed, yet remained humorously cynical.",
        "Sir Donald Bradman argued that W.J. O'Reilly must have been a greater bowler than Barnes because he commanded every ball developed in Barnes's day -- plus the googly. I told Barnes of Bradman's remark. \"It's quite true,\" he said, \"I never bowled the `googly.'\" Then with a glint in his eye, he added, \"I never needed it.\"",
        "Against Australia he took 106 wickets, average 21.58. Only Trumble and Peel have improved on these figures in Tests between England and  Australia (I won't count Turner's 101 wickets at 16.53 because he bowled in conditions not known to  Barnes and  Trumble).",
        "Barnes had no opportunities to pick up easy victims. He played only against Australia and South Africa and, in all Test matches, his haul was 189 at 16.43 each. ",
        "On matting in South Africa when South Africa's batsmanship, at its greatest, was represented by H.W. Taylor, A.D. Nourse, L.J. Tancred, J.W. Zulch, in 1913-14, he was unplayable, with 49 wickets in four Tests at 10.93 each. It was said he refused to play in the fifth match because he contended the South Africans had not carried out their promise of special reward if he took part in the tour.",
        "In the second Test at Johannesburg, Barnes took 17 wickets for 159, a record which stood until 1956 when  Laker laid low Australia at Old Trafford with his unique figures of 19 for 90.",
        "Yet against Barnes's fantastically swinging, bouncing, late-turning attack on that 1913-14 tour, Herbie Taylor scored 508 runs, average 50.80, perhaps the most skilful of all Test performances by a batsman.",
        "Barnes was a man of character. At Sydney on the 1911-12 tour, J.W.H.T. Douglas opened the England attack using the new ball with Frank Foster. Barnes was furious. He sulked as he sent down 35 overs for three wickets and 107 runs (in the match he took only four for 179). England lost by 146 runs.",
        "At Melbourne, Australia batted first and Barnes this time had the new ball. We all know with what results. Australia suffered defeat -- and also in the ensuing three games. The destruction wreaked by Barnes, and on all his great days, was mostly done by the ball which, bowled from a splendid height, seemed to swing in to the leg stump then spin away from the pitch, threatening the off-stump. Barnes assured me that he actually turned the ball by finger twist.",
        "The wonder of his career is that he took 77 of his 106 Australian Test wickets on the wickets of Australia when they were flawless and the scourge of all ordinarily good bowlers. He clean bowled Victor Trumper for 0 at Sydney in the 1907-08 rubber; then Fielder and J.N. Crawford in the following Test dismissed Trumper for a  pair, so Trumper was out for 0 in three successive Test innings.",
        "Barnes remained a deadly bowler long after he went out of first-class cricket. So shrewdly did he conserve his energy that in 1928 when he was in his mid-fifties, the West Indies team of that year faced him in a club match and unanimously agreed he was the best they had encountered in the season.",
        "For Staffordshire, in his fifty-sixth year, he took 76 wickets at 8.21 each. Round about this period a young player, later to become famous in international company, was one of the Lancashire Second XI playing against Staffordshire.",
        "His captain won the toss and two Lancashire lads went forth to open the innings against Barnes. As this colt was number six in the batting order he put on his blazer and was about to leave the pavilion to watch Barnes from behind. But his captain told him to go back to the dressing room and get on his pads. \"But,\" said the colt, \"I'm not in until number six and I'd like to look at Barnes.\" His captain insisted. The young colt returned to the dressing room. And there, he said \"there were four of us all padded up waiting. And we were all out in the middle and back again in half an hour.\"",
        "Barnes had a splendid upright action, right arm straight over. He ran on easy strides, not a penn'orth of energy wasted. He fingered a cricket ball sensitively, like a violinist his fiddle. He always attacked. \"Why do these bowlers today send down so many balls the batsman needn't play?\" he asked while watching a Test match many years ago. \"I didn't. I never gave'em any rest.\"",
        "His hatchet face and his suggestion of physical and mental leanness and keenness were part of Barnes's cricket and outlook on the game. He was relentless, a chill wind of antagonism blew from him on the sunniest day. As I say, he mellowed in full age and retirement.",
        "He came to  Lord's and other grounds for Test matches, even in his ninety-fifth year, leading blind Wilfred Rhodes about. And to the end of his life he worked for his living, drawing up legal and other documents for Staffordshire County Council in the most beautiful copperplate writing he learned as a boy.",
        "As we think of the unsmiling destroyer of all the batsmen that came his way, let us also remember Barnes immortalised in that lovely verse of Alan Ross: ",
        null,
        null,
        null,
        null,
        null,
        "Barnes took 14 wickets for 13 runs, less than one run apiece, playing for Staffordshire against Cheshire in 1909.",
        "Against Northumberland he took 16 for 93 in one day. Even an All-Indian team could barely muster two runs a wicket against him in 1911 when he took 14 for 29.",
        null,
        null,
        "The tribute by Sir Neville Cardus is based mainly on the one he wrote for the 1963 Centenary Edition of Wisden.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}