{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "1",
            "6s": "0",
            "Ave": "14.00",
            "Ct": "4",
            "HS": "50*",
            "Inns": "16",
            "Mat": "12",
            "NO": "5",
            "Runs": "154",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "4",
            "6s": "",
            "Ave": "9.50",
            "Ct": "238",
            "HS": "66",
            "Inns": "716",
            "Mat": "592",
            "NO": "194",
            "Runs": "4961",
            "St": "1"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "3",
            "4w": "3",
            "5w": "5",
            "Ave": "25.86",
            "BBI": "7/71",
            "BBM": "12/171",
            "Balls": "3732",
            "Econ": "2.74",
            "Inns": "22",
            "Mat": "12",
            "Runs": "1707",
            "SR": "56.5",
            "Wkts": "66"
        },
        {
            "": "First-class",
            "10": "140",
            "4w": "",
            "5w": "386",
            "Ave": "18.42",
            "BBI": "10/53",
            "BBM": "",
            "Balls": "154658",
            "Econ": "2.69",
            "Inns": "",
            "Mat": "592",
            "Runs": "69577",
            "SR": "40.9",
            "Wkts": "3776"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/305408.html",
        "http://www.espncricinfo.com/magazine/content/story/303624.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154725.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/032004/051023.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/032004/051023.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/032004/051023.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMay 17, 1888, Ladywell, Lewisham, London "
        ],
        "Bowling style": [
            "Legbreak googly"
        ],
        "Died": [
            "January 28, 1965, Bearsted, Kent (aged 76 years 256 days) "
        ],
        "Full name": [
            "Alfred Percy Freeman"
        ],
        "Height": [
            "\n5 ft 2 in "
        ],
        "Major teams": [
            "England,",
            "Kent"
        ]
    },
    "profile_info": [
        "\nAlfred Percy Freeman,  known to the cricket world as \"Tich\" and one of the greatest slow bowlers the game has known, died at his home at Bearsted, Kent, on January 28 at the age of 76. Though small in stature - he stood only five feet two inches - his achievements were colossal. No county bowler ever achieved quite so consistently hypnotic an effect on opposing batsmen over a comparable period of years, and few were able to lure their opponents to destruction so inexorably under all kinds of conditions, not merely those helpful to the bowler. He was described as a wizard and magician, and expectation was rarely more keenly aroused than when his slight, gnome-like figure began its short run to the crease at the start of a spell. He was never ruffled and never happier than when bowling. His stamina was such that he would not infrequently bowl almost through the innings, whatever its length. \n",
        "Freeman was born at Lewisham on May 17, 1888, a son of George Freeman, groundsman to the Streatham Cricket Club, and a younger brother of J. R. Freeman, who appeared for Essex for many years. After playing himself for Essex Club and Ground, he was taken into the Tonbridge Nursery in 1912 and showed the first signs of his skill the following year, when he took 125 wickets in all matches for Kent's second XI. He made his first-class debut in 1914, but it was not until after the First World War-when he was already 31 years of age-that he began to be the dominant force for Kent and one of the best slow bowlers of his day. Technically, he was supreme. Whether bowling the legbreak or googly or top-spinner, he always flighted and spun the ball with remarkable control of length and direction. Often his deliveries appeared innocuous, but a careful variation of flight or speed brought hundreds of batsmen, who had been deceived into false security, to their grief. He was aided during his years with Kent by two very fine wicketkeepers, J. C. Hubble and L. E. G. Ames, whose stumpings off Freeman were one of the most regular features in county cricket of the 1920s and '30s.",
        "It is essentially as a county bowler that Freeman will be remembered, for though he played 12 times for England he rarely produced his best when not playing for Kent. Seventeen times he took 100 wickets in a season (a record exceeded only by Wilfred Rhodes) and in each of eight consecutive seasons -1928 to 1935 - he took over 200 wickets. His total aggregate in this period was 2,090. He is the only bowler in history to capture 300 wickets in one season, dismissing the phenomenal number of 304 batsmen (at 18.05 each) in the dry summer of 1928. Five years later his season's tally was 298. His records are legion-the result of amazing consistency and mastery of his craft. No other bowler has three times taken all ten wickets in a first-class innings, and no other bowler has twice taken 17 wickets in a championship match: in the course of one of these latter achievements against Sussex at Hove in 1922-he had the remarkable analysis of 9 for 11 in the first innings, actually taking all 9 wickets in 47 balls for 7 runs. The succession of prodigious bowling feats that characterised his career placed him behind only Wilfred Rhodes as the greatest wicket-taker in the first-class game: Freeman's final aggregate in a career which stretched from 1914 to 1936 was 3,776 at an average of 18.42.",
        "He toured Australia and New Zealand under A. C. MacLaren in 1922-23 and was a member of the M.C.C. sides to Australia in 1924-25 (when he played in two Tests) and 1928-29. He also played in four Tests when touring South Africa in 1927-28, and in England played in Tests against both West Indies and South Africa. He took 66 wickets for England at 25.86 each. He also played five times for the Players at Lord's. As a batsman he had few pretensions, but on his Test debut in 1924-25 he scored 50 not out against Australia at Sydney. He was a right-hander who could sometimes hit hard, and though he was a regular number 10 or 11, he made over 4,000 runs for Kent, including an innings of 66 in 70 minutes at Old Trafford in 1925. He was also an excellent cover-point.",
        null,
        null,
        "His most triumphant summer was that of 1928, when his victims totalled 304 for 18.15 runs each, a feat without parallel in first-class cricket, and five years later he took 298. His wickets exceeded 200 in five other seasons: 276 in 1931, 275 in 1930, 253 in 1932, 212 in 1935 and 205 in 1934. Three times - a feat unequalled by any other bowler - this short but stockily-built man, known in the cricket world as \"Tich\", took all 10 wickets in an innings, against Lancashire for 131 runs at Maidstone in 1929, and that despite an innings of 126 by F. Watson; against Essex for 53 runs at Southend in 1930 and against Lancashire again, this time at Old Trafford, for 79 runs in 1931. Additionally, at Hove in 1922, he disposed of nine Sussex batsmen in the first innings for 11 runs, bringing about the dismissal of the side for 47, of which E. H. Bowley obtained 24. This was one of two matches in which Freeman was responsible for 17 wickets, his second-innings analysis being eight for 56; the other was against Warwickshire at Folkestone ten years later. Three times he achieved the hat-trick, for Kent against Middlesex at Canterbury in 1920 and against Kent at Blackheath in 1934 and for M.C.C. against South Australia at Adelaide in 1922-23.",
        "\"Tich\" seldom reached in Test cricket the phenomenal success he attained in the county sphere. He toured Australia and New Zealand with A. C MacLaren's M.C.C. team in 1922-23 and made his first appearance for England in Australia in 1924-25. Though he did reasonably well in other matches, he took only eight wickets in two Tests and conceded 519 runs. Nor did he achieve anything of note when visiting South Africa in 1927-28, his total wickets in four Tests amounting to 14 at an average cost of 28.50. In home Tests he fared better. Against the West Indies in 1928 he headed the averages with 22 wickets at 13.72 runs apiece, including 10 for 93 at Old Trafford. For Kent against the West Indies team at Canterbury he took nine wickets in the second innings for 104 runs. He also topped the England bowling figures against South Africa the following season, dismissing 12 men for 171 runs at Old Trafford and seven for 115 in the first innings at Leeds.",
        "When Kent, who gave him two benefits, dispensed with his services at 1936, Freeman played for a time as professional for Walsall in the Birmingham and District League. In 1949 he became one of the 26 cricket personalities to be elected to honorary life membership of M.C.C.",
        "Two celebrated leg-break bowlers paid these tributes:",
        null,
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}