{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "8.69",
            "Ct": "17",
            "HS": "22",
            "Inns": "14",
            "Mat": "11",
            "NO": "1",
            "Runs": "113",
            "St": "3"
        },
        {
            "": "First-class",
            "100": "20",
            "50": "63",
            "6s": "",
            "Ave": "22.39",
            "Ct": "722",
            "HS": "177",
            "Inns": "814",
            "Mat": "496",
            "NO": "55",
            "Runs": "16997",
            "St": "156"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "11",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "51.00",
            "BBI": "1/0",
            "BBM": "",
            "Balls": "167",
            "Econ": "3.66",
            "Inns": "",
            "Mat": "496",
            "Runs": "102",
            "SR": "83.5",
            "Wkts": "2"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/cricketer/content/story/334973.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155441.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/8400/8404.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nFebruary 6, 1886, Highgate, Birmingham, Warwickshire "
        ],
        "Died": [
            "August 31, 1979, Northfield, Birmingham, Warwickshire (aged 93 years 206 days) "
        ],
        "Fielding position": [
            "Wicketkeeper"
        ],
        "Full name": [
            "Ernest James Smith"
        ],
        "Major teams": [
            "England,",
            "Warwickshire"
        ],
        "Other": [
            "Umpire"
        ]
    },
    "profile_info": [
        null,
        "THE death of 'Tiger\" Smith ends an association with Warwickshire that began up a tree 83 years ago. Born on February 6, 1886, Ernest James Smith was just 10 years old when he watched Kent v Warwickshire from a tree outside his beloved Edgbaston ground. From that day he was hooked on Warwickshire cricket. It was a relationship which mellowed over the years and right up to the recent Test match at Edgbaston he was a familiar, well-loved figure at the ground.",
        "During that Test it was heart-warming to see men like Bob Willis, Geoff Boycott and Mike Brearley ask him for advice that was readily given and sensibly atriculated with his trusty stick tapping the ground for extra emphasis. It was difficult to imagine, while listening to him analysing Gower\"s technique or Taylor\"s skills behind the stumps, that this man had played many times with W. G. Grace, had kept wicket behind men like Victor Trumper, Clem Hill, Gilbert Jessop and C. B. Fry, had batted against the likes of Wilfred Rhodes, Colin Blythe and J. J. Kotze.",
        "He had a colossal memory for incidents in bygone matches yet he could be gracious in his praise of the great modern players. 'This here Viv Richards is a great player,\" he told me during the Somerset match this season. 'I came here today to criticise him but when his first five scoring shots go for boundaries, what can you say?\"",
        "He was proud to uphold the traditional values of the game ('It\"s a sideways-on game,\" he\"d say while wincing at the defects of the current England batsmen, 'doesn\"t anybody tell them that these days?\").",
        "On the second day of the Warwickshire v Lancashire match at Edgbaston, (August 13) E. J. ('Tiger\") Smith set up a new record of longevity for a professional cricketer. Smith made his first-class debut for Warwickshire, against the South Africans at Edgbaston, on June 16, 1904 and was thus alive 75 years 59 days after his debut, exceeding the record for a professional held by Wilfred Rhodes. He had extended the period to 75 years 77 days at the time of his death.",
        "A very small number of amateurs exceed Smith. F. A. Mackinnon died in 1947, 76 years 284 days after his first-class debut for Cambridge University, while others to reach 76 years were H. M. Lawrence (Kent), died 1975, and J. Gilman (MCC), died 1976.",
        "However, the English record appears to be held by H. Jenner, who died in 1904, 77 years 57 days after his appearance for Cambridge in the 1827 University match. Even Jenner has to give best to the Australian-born John Wheatley, however. Wheatley made his first-class debut for Canterbury against Otago in February 1883, and died aged 102 in 1962, 79 years 78 days afterwards.",
        "But nobody could ever accuse 'Tiger\" of living in the past. In his last few days he struggled painfully but cheerfully ('I\"ve told 'em I want hops on my coffin not lilies,\" he\"d joke)- but he\"d still constructively analyse the batting of Gooch ('You come back and tell me I\"m a bloody fool if you like- but you take a look at his front foot\")- or the wicketkeeping of Bob Taylor ('They\"d be mad not to take him to Australia- he\"s got the best pair of hands in the game\").",
        "And no man alive was better qualified to comment on the art of wicketkeeping: on the 1911-12 tour of Australia he stood up to Barnes and Foster in four Tests on those lightning fast wickets. By common consent he kept immaculately, with the highlight a superb leg-side stumping of Clem Hill off Frank Foster at Adelaide ('Bob Crockett, the umpire at square leg, said  Good God, Clem, you\"re out and I said Aye, and by a long way! I did it again in the second innings but the other umpire was asleep!\").",
        "He could bat too- nearly 17,000 runs and 20 centuries in a career lasting from 1904 to 1930- and in his last season he was still fit enough to score a hundred before lunch against Essex-'and I even had time to drink a glass of Guinness before the players came off for lunch!\"",
        "At the time of his death he was the oldest living Test cricketer - but his real love was Warwickshire. As the county\"s coach in the immediate post-war years his disciplinarian yet kindly methods yielded an outstanding crop of players - and even in his last days, he talked with warm affection of his 'boys\"- players like David Brown, Dennis Amiss, John Jameson, Jack Bannister, Tom Cartwright and Neal Abberley. And the respectful attention the players continually showed him spoke volumes.",
        "It\"s not an overstatement to say that 'Tiger\" Smith was a legend in the game. It\"s difficult to think of any Englishman with a more distinguished career in three major facets of the game - 11 Tests as a player, nine seasons as a first-class umpire (including eight Tests) and coach to the champion county in 1951.",
        "He was present at some of cricket\"s great moments - at Leyton in 1932 he signalled the boundary that posted the new world record first-wicket stand by Holmes and Sutcliffe. He kept to Syd Barnes as he mesmerised 49 South African victims in just four Tests in 1913-14. He watched every ball of the epic opening partnership of 323 by Hobbs and Rhodes at Melbourne in 1911-12.",
        "'Tiger\" stood in the Lord\"s Test of 1938 when Wally Hammond scored his majestic 240 against Bradman\"s Australians and he played in that amazing match against Hampshire when, in 1922, they were bowled out for 15 but still managed to beat Warwickshire by 155 runs.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}