{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "67",
            "50": "3",
            "6s": "1",
            "Ave": "26.13",
            "BF": "1458",
            "Ct": "8",
            "HS": "91",
            "Inns": "26",
            "Mat": "23",
            "NO": "4",
            "Runs": "575",
            "SR": "39.43",
            "St": "0"
        },
        {
            "": "ODIs",
            "100": "0",
            "4s": "88",
            "50": "1",
            "6s": "6",
            "Ave": "19.79",
            "BF": "965",
            "Ct": "20",
            "HS": "80",
            "Inns": "64",
            "Mat": "85",
            "NO": "20",
            "Runs": "871",
            "SR": "90.25",
            "St": "0"
        },
        {
            "": "T20Is",
            "100": "0",
            "4s": "16",
            "50": "0",
            "6s": "6",
            "Ave": "16.61",
            "BF": "170",
            "Ct": "10",
            "HS": "47*",
            "Inns": "22",
            "Mat": "34",
            "NO": "9",
            "Runs": "216",
            "SR": "127.05",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "6",
            "4s": "",
            "50": "32",
            "6s": "",
            "Ave": "29.25",
            "BF": "13278",
            "Ct": "96",
            "HS": "169*",
            "Inns": "256",
            "Mat": "189",
            "NO": "40",
            "Runs": "6318",
            "SR": "47.58",
            "St": "0"
        },
        {
            "": "List A",
            "100": "0",
            "4s": "",
            "50": "9",
            "6s": "",
            "Ave": "21.40",
            "BF": "3424",
            "Ct": "72",
            "HS": "95*",
            "Inns": "199",
            "Mat": "273",
            "NO": "54",
            "Runs": "3104",
            "SR": "90.65",
            "St": "0"
        },
        {
            "": "T20s",
            "100": "0",
            "4s": "115",
            "50": "1",
            "6s": "55",
            "Ave": "21.08",
            "BF": "1154",
            "Ct": "58",
            "HS": "51",
            "Inns": "120",
            "Mat": "164",
            "NO": "48",
            "Runs": "1518",
            "SR": "131.54",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "4",
            "5w": "1",
            "Ave": "32.73",
            "BBI": "5/48",
            "BBM": "8/141",
            "Balls": "4674",
            "Econ": "3.02",
            "Inns": "41",
            "Mat": "23",
            "Runs": "2357",
            "SR": "64.9",
            "Wkts": "72"
        },
        {
            "": "ODIs",
            "10": "0",
            "4w": "3",
            "5w": "1",
            "Ave": "34.98",
            "BBI": "5/48",
            "BBM": "5/48",
            "Balls": "4221",
            "Econ": "5.42",
            "Inns": "84",
            "Mat": "85",
            "Runs": "3813",
            "SR": "38.7",
            "Wkts": "109"
        },
        {
            "": "T20Is",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "36.95",
            "BBI": "3/10",
            "BBM": "3/10",
            "Balls": "663",
            "Econ": "8.02",
            "Inns": "34",
            "Mat": "34",
            "Runs": "887",
            "SR": "27.6",
            "Wkts": "24"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "24",
            "5w": "8",
            "Ave": "30.87",
            "BBI": "5/36",
            "BBM": "",
            "Balls": "31609",
            "Econ": "3.11",
            "Inns": "",
            "Mat": "189",
            "Runs": "16426",
            "SR": "59.4",
            "Wkts": "532"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "7",
            "5w": "1",
            "Ave": "34.09",
            "BBI": "5/48",
            "BBM": "5/48",
            "Balls": "12074",
            "Econ": "5.23",
            "Inns": "",
            "Mat": "273",
            "Runs": "10535",
            "SR": "39.0",
            "Wkts": "309"
        },
        {
            "": "T20s",
            "10": "0",
            "4w": "0",
            "5w": "1",
            "Ave": "26.96",
            "BBI": "6/19",
            "BBM": "6/19",
            "Balls": "3160",
            "Econ": "8.08",
            "Inns": "160",
            "Mat": "164",
            "Runs": "4260",
            "SR": "20.0",
            "Wkts": "158"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/ci/content/story/1152401.html",
        "http://www.espncricinfo.com/ci/content/story/1152209.html",
        "http://www.espncricinfo.com/county-championship-division-1-2017/content/story/1121374.html",
        "http://www.espncricinfo.com/county-cricket-2017/content/story/1116020.html",
        "http://www.espncricinfo.com/england-v-south-africa-2017/content/story/1113300.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=9310"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/278300/278376.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/278300/278376.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/278300/278376.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nFebruary 28, 1985, Pontefract, Yorkshire "
        ],
        "Bowling style": [
            "Right-arm medium-fast"
        ],
        "Current age": [
            "33 years 171 days"
        ],
        "Education": [
            "Castleford High School, Pontefract New College"
        ],
        "Full name": [
            "Timothy Thomas Bresnan"
        ],
        "Height": [
            "\n6 ft 0 in "
        ],
        "Major teams": [
            "England,",
            "England Lions,",
            "England Under-19s,",
            "Marylebone Cricket Club,",
            "Perth Scorchers,",
            "Yorkshire"
        ],
        "Nickname": [
            "Brezy Lad, Brez"
        ],
        "Playing role": [
            "Allrounder"
        ]
    },
    "profile_info": [
        "\nAt the height of his powers, Tim Bresnan became known as England's lucky charm, but it was in his beloved Yorkshire where he most deeply treasured. Strong-willed, independent and with an understated sense of humour, he perfectly captured the stereotype of the self-made Yorkshire sportsman. \"A doer more than a thinker\" he once said about himself, but he was sharp-witted on and off the field, had an impressive hold on reality and a healthy suspicion of fads and fancies \n",
        "A powerfully built allrounder, Bresnan had been tipped for higher honours since he became the youngest player in 20 years to represent Yorkshire when he debuted in 2001. It was nearly a decade later that he really announced his arrival in the big-time, however, with a phenomenal performance in the fourth Test against Australia in Melbourne in December 2010. Called into the side as a replacement for Steven Finn, and with a remit to keep the runs down, he starred with a performance of skill, pace and unrelenting accuracy. First, he played a key role in bowling Australia out for 98 in the first innings, then he sealed England's successful defence of the Ashes with 4 for 50 in the second innings.",
        "Such was his understated value to the side that England won the first 13 Tests he played in - a record bettered only by Adam Glichrist. At that point, having taken eight wickets against West Indies at Trent Bridge, Bresnan averaged 40 with the bat and 25 with the ball but the lingering effects of an elbow injury that required surgery in late 2011 were about to take their toll. He claimed only five wickets in his next five Tests - and two in four against South Africa and India - before undergoing another operation at the start of 2013. He returned to the ODI team for their run to the Champions Trophy final and then picked up four wickets in England's crushing Ashes win at Lord's but his utility had been diminished and he became a victim of England's subsequent Ashes whitewash in Australia, his career limited after that to limited-overs formats.",
        "Bresnan began his international career in the England Under-19 set-up and was part of the team in 2002 and 2003 - playing in two World Cups - the same years that he won the NBC Denis Compton Award for most promising Yorkshire player. All the potential took a few years to develop, but 2005 was an important year for him as he was given more responsibility in a transitional Yorkshire team. He was surprisingly overlooked for the England Academy, but started 2006 with a string of impressive performances with bat and ball, leading to a call-up to England's new-look one-day squad to face Sri Lanka. However, he fell victim to the flashing blades of Jayasuriya and co., then suffered injury in the second half of the season as he lost his place for the series against Pakistan.",
        "A better all-round summer in 2008 helped him catch the selectors' eyes again, however, and he was called up late in the season for the one-day squad. But after a winter without any honours it appeared he would have to bide his time again before he was surprisingly named in the Test squad to face West Indies. He duly played in both matches, but such was England's dominance it wasn't until the final day of the series that he finally made his mark. He claimed his maiden Test wicket in the second innings and eventual figures of 3 for 45, as West Indies slumped to an innings defeat.",
        "While he hovered around the fringes of the Test side thereafter injuries during England's tour to Bangladesh in 2010 opened the door and he impressed, showing good discipline and stamina in trying conditions. He then played an important role in delivering England the 2010 World Twenty20, showing skill and an unfailing ability to hit his straps early to give England control with the new ball, before returning at the end of the innings with steely death-bowling. ",
        "Injuries than began to hamper him. A second operation on a troublesome right elbow caused him to miss the 2013 tour to New Zealand. He returned to England's colours adamant that his pace, which he admitted had been reduced because of the injury, had been restored, but it was hard to accept the claim as he struggled like many of his colleagues during England's 5-0 whitewash in Australia in 2013/14. He did not represent England in Tests the following summer. His zip had gone, however, later evidenced by a third elbow operation after the 2016 season. But he committed himself instead to back-to-back Yorkshire Championship wins were his down-to-earth approach, on and off the field, remained highly prized. ",
        "An unbeaten hundred against Somerset was his first since 2007 and an unbroken seventh-wicket stand of 366 with Jonny Bairstow against Durham at Chester-le-Street - both batsmen making career-best scores - emphasised Yorkshire's might. It was a record stand against Durham, the third-highest seventh-wicket stand in the history of first-class cricket and it is the fifth-highest for Yorkshire, the other four all being opening partnerships. But it was his redoubtable efforts in 2016 that won Yorkshire hearts as much as ever before: Yorkshire conceded the chance of a hat-trick of Championship titles on the final evening of the season, at Lord's, against the side that took their crown, Middlesex, but Bresnan's defiant, unbeaten 142 ensured they did not concede it without a fight in an innings that would enter Yorkshire folklore. ",
        "His career-best figures in any format came on an extraordinary, wet night at Headingley when he returned 6 for 19 before a sold-out Roses T20 crowd. Four wickets came in his last over, three to Bresnan plus a run-out that he made off his own bowling, enough to tempt him into a knee slide across the outfield in the pouring rain. \"Knee sliding at 32,\" he said afterwards, in disbelief.",
        null
    ],
    "recent_matches": [
        {
            "Bat & Bowl": "5*",
            "Ground": "Leeds",
            "Match Date": "17 Aug 2018",
            "Opposition": "v Notts",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "0/42",
            "Ground": "Northampton",
            "Match Date": "16 Aug 2018",
            "Opposition": "v Northants",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "9*, 0/31",
            "Ground": "Leeds",
            "Match Date": "9 Aug 2018",
            "Opposition": "v Lancashire",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "0/30, 5",
            "Ground": "Leeds",
            "Match Date": "30 Jul 2018",
            "Opposition": "v Derbyshire",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "16, 0/39",
            "Ground": "Chesterfield",
            "Match Date": "28 Jul 2018",
            "Opposition": "v Derbyshire",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "10, 0/38",
            "Ground": "Leeds",
            "Match Date": "27 Jul 2018",
            "Opposition": "v Bears",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "0, 2/23, 18, 1/43",
            "Ground": "Manchester",
            "Match Date": "22 Jul 2018",
            "Opposition": "v Lancashire",
            "Scorecard": "FC",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "0/24, 17",
            "Ground": "Manchester",
            "Match Date": "20 Jul 2018",
            "Opposition": "v Lancashire",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "6, 3/38",
            "Ground": "Worcester",
            "Match Date": "15 Jul 2018",
            "Opposition": "v Worcs",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        },
        {
            "Bat & Bowl": "28*, 2/19",
            "Ground": "Chester-le-Street",
            "Match Date": "13 Jul 2018",
            "Opposition": "v Durham",
            "Scorecard": "T20",
            "Team": "Yorkshire"
        }
    ]
}