{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "20.25",
            "Ct": "2",
            "HS": "31",
            "Inns": "4",
            "Mat": "2",
            "NO": "0",
            "Runs": "81",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "15",
            "50": "26",
            "6s": "",
            "Ave": "40.35",
            "Ct": "50",
            "HS": "206",
            "Inns": "153",
            "Mat": "92",
            "NO": "11",
            "Runs": "5730",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "2",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "76.33",
            "BBI": "1/20",
            "BBM": "",
            "Balls": "293",
            "Econ": "4.68",
            "Inns": "",
            "Mat": "92",
            "Runs": "229",
            "SR": "97.6",
            "Wkts": "3"
        }
    ],
    "latest_articles": [],
    "latest_photos": [],
    "personal_info": {
        "Also known as": [
            "The Reverend Thomas Killick"
        ],
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMay 9, 1907, Fulham, London "
        ],
        "Died": [
            "May 18, 1953, Northampton (aged 46 years 9 days) "
        ],
        "Full name": [
            "Edgar Thomas Killick"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Middlesex"
        ]
    },
    "profile_info": [
        null,
        "H. L. Collins, the Australian captain, objected to the Schools fielding fifteen players and Killick had the unenviable duty of deciding which four had to leave the field. Happily, Collins relented and the four boys returned. Killick made 31 on a difficult pitch.",
        "Everyone predicted that he would be an automatic choice as a Freshman for the 1927 Cambridge XI, but for some reason he failed to do himself justice and did not obtain his Blue that year. For a time during the early part of the next season it looked as if the distinction might again elude him, but an innings of 82 for Middlesex against Essex ensured him a further trial. He seized the opportunity, taking 100 off the Surrey bowlers at The Oval and 161 from the Sussex attack at Hove. He made another hundred for Cambridge v. M.C.C. at Lord's and in the' Varsity Match hit 74 and 20.",
        "One of his finest innings was the 206 he scored for Middlesex against Warwickshire in 1931, his opening stand with G. T. S. Stevens producing 277 runs. Curiously, this was the only time he played for the county that season. Moreover, play was possible only on the first day because of rain. He twice played for England against South Africa in 1929, going in first with H. Sutcliffe, but his appearances in first-class cricket subsequently became more infrequent because of his work. Nevertheless, he continued to play as often as possible in club matches. E. Hendren once described Killick as the prettiest forward player since Lionel Palairet. Certainly, there was grace in his stroke-play and few batsmen executed the off-drive and square-cut with such ease of movement. As a fieldsman he delighted onlookers by his anticipation, swift running and clean picking up of the ball in the deep.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}