{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "6.50",
            "Ct": "3",
            "HS": "8",
            "Inns": "5",
            "Mat": "8",
            "NO": "3",
            "Runs": "13",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "4",
            "6s": "",
            "Ave": "9.37",
            "Ct": "312",
            "HS": "71",
            "Inns": "775",
            "Mat": "593",
            "NO": "217",
            "Runs": "5234",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "1",
            "Ave": "26.72",
            "BBI": "6/29",
            "BBM": "6/77",
            "Balls": "1563",
            "Econ": "2.25",
            "Inns": "13",
            "Mat": "8",
            "Runs": "588",
            "SR": "71.0",
            "Wkts": "22"
        },
        {
            "": "First-class",
            "10": "86",
            "4w": "",
            "5w": "251",
            "Ave": "19.84",
            "BBI": "10/113",
            "BBM": "",
            "Balls": "142211",
            "Econ": "2.49",
            "Inns": "",
            "Mat": "593",
            "Runs": "59116",
            "SR": "47.7",
            "Wkts": "2979"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155459.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154651.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/80400/80405.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/80400/80405.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/80400/80405.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nOctober 1, 1900, Gloucester "
        ],
        "Bowling style": [
            "Right-arm offbreak"
        ],
        "Died": [
            "May 22, 1966, Gloucester (aged 65 years 233 days) "
        ],
        "Full name": [
            "Thomas William John Goddard"
        ],
        "Major teams": [
            "England,",
            "Gloucestershire"
        ]
    },
    "profile_info": [
        "\nTom Goddard, who died at his home in Gloucester on May 22, aged 65, was one of the greatest off-break bowlers the game has known. A big man, standing six feet three, with massive hands, he spun the ball to a remarkable degree and on a helpful pitch was almost unplayable. He bowled mostly from round the wicket and had such a command of length and flight that even on easy surfaces he kept batsmen apprehensive. His height enabled him to make the ball lift more than most spinners and the Gloucestershire combination of Goddard and the slow left-hander, Charlie Parker, was probably the most feared in Championship cricket. \n",
        "The early days of Goddard's career gave no hint of the success he was later to achieve. Born on October 1, 1900, he first played for Gloucestershire in 1922 as a fast bowler. Despite his strong physique he made little progress and in six years took only 153 wickets at a cost of 34 runs each.",
        "At the end of the 1927 season he left the county and joined the M.C.C. ground staff at Lord's. There he decided to experiment with off-breaks and his long, strong fingers were ideally suited to this type of bowling. Beverley Lyon, the Gloucestershire captain, saw him in the nets at Lord's and, immediately struck by Goddard's new-found ability, persuaded Gloucestershire to re-engage him. The effect was immediate and dramatic. In 1929 Goddard took 184 wickets at 16 runs apiece and he never looked back.",
        "When he finally retired in 1952, at the age of 51, Goddard had taken 2,979 wickets, average 19.84 and in a period when off-break bowlers were not fashionable in Test cricket, he played eight times for England. He finished with six hat-tricks, the same number as his colleague, Parker, and only one less than the all-time record of seven, by D. V. P. Wright of Kent.",
        "One of the hat-tricks came in a Test match, against South Africa at Johannesburg on Boxing Day, 1938. His victims were A. D. Nourse (caught and bowled), N. Gordon (stumped) and W. W. Wade (bowled). This is still the only hat-trick achieved in Test cricket in Johannesburg. That match was drawn, but it also included two other remarkable performances by Englishmen, a century in each innings from E. Paynter, and 93 and 106 on his Test debut by P. A. Gibb.",
        " Goddard appeared three times for England on that tour. His other Test appearances were once against Australia in 1930, twice against New Zealand in 1937 and twice against West Indies in 1939, all in England. His success was limited to 22 wickets, costing 26.72 runs each, but he enjoyed one fine performance, bowling England to victory by 130 runs against New Zealand at Old Trafford in 1937 with six for 29 in the last innings. He was among the thirteen England selected for Old Trafford against Australia in 1938 when rain prevented a ball being bowled.",
        "On 16 occasions Goddard took 100 or more wickets in a season, four times reaching 200. His most successful year was 1937 when he claimed 248 victims. Two years later he achieved the wonderful feat of taking 17 wickets in a day, against Kent at Bristol, nine for 38 and eight for 68. Only two other bowlers have equalled this, H. Verity of Yorkshire and C. Blythe of Kent.",
        "In his big year, 1937, Goddard took all ten Worcestershire wickets in an innings for 113 at Cheltenham. He also obtained six for 68 in the first innings of that match. On seven occasions he finished with nine wickets in one innings.",
        "One of the matches which gave Goddard most pleasure came at Bristol where Gloucestershire tied with the formidable Australian side of 1930. He played an important part in that thrilling match by taking three wickets in five balls at one stage and ended it by taking the final wicket, that of P. M. Hornibrook.",
        "During the 1939 War, Goddard obtained a commission in the R.A.F. He was back at his best when first-class cricket resumed, but because of ill-health he announced his retirement in 1951. To help the county out of difficulties he returned in 1952 and despite his age he took 45 wickets in 13 Championship matches.",
        "When he eventually gave up Goddard established a successful furniture shop in Gloucester in which he was active until about a year before his death.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}