{
    "batting_averages": [
        {
            "": "Tests",
            "100": "3",
            "50": "12",
            "6s": "0",
            "Ave": "34.46",
            "Ct": "19",
            "HS": "137",
            "Inns": "60",
            "Mat": "35",
            "NO": "2",
            "Runs": "1999",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "104",
            "50": "218",
            "6s": "",
            "Ave": "41.79",
            "Ct": "493",
            "HS": "315*",
            "Inns": "1138",
            "Mat": "712",
            "NO": "96",
            "Runs": "43551",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "1",
            "5w": "0",
            "Ave": "36.71",
            "BBI": "4/22",
            "BBM": "5/85",
            "Balls": "893",
            "Econ": "3.45",
            "Inns": "22",
            "Mat": "35",
            "Runs": "514",
            "SR": "63.7",
            "Wkts": "14"
        },
        {
            "": "First-class",
            "10": "2",
            "4w": "",
            "5w": "18",
            "Ave": "22.95",
            "BBI": "8/89",
            "BBM": "",
            "Balls": "20992",
            "Econ": "3.15",
            "Inns": "",
            "Mat": "712",
            "Runs": "11042",
            "SR": "43.6",
            "Wkts": "481"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdencricketer/content/story/347943.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155672.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154811.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/032004/051139.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/032004/051139.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/032004/051139.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMarch 29, 1871, Cambridge "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "July 19, 1939, Cambridge (aged 68 years 112 days) "
        ],
        "Full name": [
            "Thomas Walter Hayward"
        ],
        "Major teams": [
            "England,",
            "Surrey"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        "Born at Cambridge on March 29, 1871, he belonged to a family which lived for many generations at Mitcham; both his father and grandfather appeared in the Surrey XI. Like his famous uncle he played in beautiful style. Using a straight bat he possessed all the qualities essential for success at the wicket -- unlimited patience, admirable judgment, watchfulness and strong defence. While he scored all round the wicket, his chief strokes were the cut and the off-drive. It may be questioned whether anyone ever surpassed him in making the off-drive, the stroke being executed delightfully and so admirably timed that the ball was rarely lifted. Of good height and build Hayward had remarkable powers of endurance. He first appeared for Surrey in a county match in 1893 and in 1898 played his greatest innings -- 315 not out against Lancashire at The Oval.",
        "Equal in merit was his 130 for England when badly needed in the fourth match against Australia at Old Trafford in 1899. At The Oval that season Hayward and F. S. Jackson, the best batsmen in the earlier Tests, were chosen by A. C. MacLaren to open the England innings and they made 185, the amateur's share being 118. England put together 576, so beating the 551 by Australia on the Surrey ground in 1884. Hayward altogether played in 29 Tests against Australia, which he visited three times, and he also played in six matches against South Africa. An automatic choice for the Players, Hayward, in 29 matches against the Gentlemen at Lord's and The Oval, scored 2,374 runs with an average over 47.",
        "For 20 years in succession, 1895-1914, he scored over 1,000 runs each season in first-class cricket. In 1904 he made 3,170, and in 1906, 3,518, which still stands as the record aggregate in first-class cricket. Hayward, 273, and Abel, 193, made a world record for the fourth wicket, 448 against Yorkshire at The Oval in 1899. Before the War -- 1905 to 1914 -- Hayward and Hobbs, also born at Cambridge, became the most notable opening pair in the game. They put up 100 or more for the first wicket on 40 occasions. In 1907 they accomplished a performance without parallel in first-class cricket by making 100 for Surrey's first wicket four times in one week: 106 and 125 against Cambridge University at The Oval; 147 and 105 against Middlesex at Lord's.",
        "Hayward was the first batsman after W. G. Grace to complete 100 centuries, and altogether he reached three figures on 104 occasions, 58 times at The Oval and 88 for Surrey. In three matches he scored a hundred in each innings, excelling in 1906 by doing this twice in six days - 144 not out and 100 at Trent Bridge off the Nottinghamshire bowlers, 143 and 125 at Leicester. He carried his bat through the first innings for 225 at Nottingham, the next best score being 32. That season Hayward made 13 centuries, equalling the record set up by C. B. Fry in 1901. Eight times he carried his bat through an innings; achieved the double event in 1897 with 1,368 runs and 114 wickets, and another distinction he enjoyed was scoring 1,000 runs before the end of May in 1900.",
        "When at the height of his fame as a batsman, Tom Hayward was also worth his place in the Surrey XI as a bowler. In 1897 Tom Richardson took 238 wickets at 14.55 runs each in County Championship matches, Hayward coming next with 91 with an average of 19.28. Hayward, bowling medium paced off-breaks, contrasted with Richardson, whose expresses often whipped back from off to leg stump. Leicestershire experienced the strength of this combination in 1897 on the Aylestone Road Ground where they were twice dismissed for exactly the same total - 35. Hayward took seven wickets for 43 and Richardson came out with the astonishing figures of 12 wickets for 20 runs. They bowled unchanged in each Leicestershire innings and the match was all over in a day. Between the two collapses, Surrey made 164, Hayward being top scorer with 26. In 1899 Hayward twice performed the hat-trick - against Gloucestershire at The Oval and Derbyshire at Chesterfield.",
        "Putting on weight, he became rather slow in the field, though playing to the end of season 1914 but, 43 years of age when the War broke out, he did not attempt to return to active participation in the game when cricket was resumed in 1919.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}