{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "5.00",
            "Ct": "1",
            "HS": "9",
            "Inns": "6",
            "Mat": "5",
            "NO": "2",
            "Runs": "20",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "1",
            "6s": "",
            "Ave": "7.97",
            "Ct": "133",
            "HS": "57",
            "Inns": "412",
            "Mat": "328",
            "NO": "107",
            "Runs": "2431",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "62.25",
            "BBI": "2/49",
            "BBM": "3/60",
            "Balls": "894",
            "Econ": "3.34",
            "Inns": "8",
            "Mat": "5",
            "Runs": "498",
            "SR": "111.7",
            "Wkts": "8"
        },
        {
            "": "First-class",
            "10": "30",
            "4w": "",
            "5w": "118",
            "Ave": "20.59",
            "BBI": "10/64",
            "BBM": "",
            "Balls": "62741",
            "Econ": "2.92",
            "Inns": "",
            "Mat": "328",
            "Runs": "30543",
            "SR": "42.3",
            "Wkts": "1483"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/bodyline/content/story/316843.html",
        "http://www.espncricinfo.com/bodyline/content/story/316838.html",
        "http://www.espncricinfo.com/ci/content/story/316652.html",
        "http://www.espncricinfo.com/bodyline/content/story/316500.html",
        "http://www.espncricinfo.com/bodyline/content/story/316173.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=17050"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/66600/66687.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/66600/66687.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/66600/66687.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nSeptember 4, 1902, Creswell, Derbyshire "
        ],
        "Bowling style": [
            "Legbreak googly"
        ],
        "Died": [
            "January 27, 1996, Hickleton, Doncaster, Yorkshire (aged 93 years 145 days) "
        ],
        "Full name": [
            "Thomas Bignall Mitchell"
        ],
        "Major teams": [
            "England,",
            "Derbyshire"
        ]
    },
    "profile_info": [
        "\nTommy Mitchell, who died on January 27 at the age of 93, played for Derbyshire from 1928 to 1939, helping them to win the County Championship in 1936, and for England five times.  \n",
        "Mitchell was a leg-spin bowler of exceptional ability and he played 10 full seasons for Derbyshire, taking 100 wickets or more in every season, including a Derbyshire record 168 in 1935 - and this on home pitches more suited to seam bowlers. He played 303 times for the county, taking 1,417 wickets at a cost of 20.2. For England he never quite produced his best, but at Brisbane he had the satisfaction of bowling the unbowlable Woodfull. It is ironic, incidentally, that Derbyshire with a predilection for fast bowlers should pro-duce the only slow bowler in an England team, committed to the intimidatory body-line.\nHe spun the ball prodigiously with the help of a lively, twirling action, making full use of body, arm and exceptionally strong wrists and fingers. It is said that he learned his art on the snooker table and was certainly capable of consistently finger-spinning the white from the centre spot, round the stacked reds and into the bottom left-hand pocket.",
        "He was initially a poor fielder but the acquisition of thick-lensed, dark-rimmed spectacles, which gave him a studious, clerkly air, turned him into a brilliant cover point and batsman, who delighted to advance down the pitch and strike fast bowlers for six. It was reported by Neville Cardus that \"the ball had only to see those spectacles and it began spinning madly\".",
        "Mitchell was discovered by the then Derbyshire captain and coal owner, Guy Jackson, when he took, during the General Strike of 1926, a bridge-building county team to play the local colliery. He was universally popular amongst his fellow professionals, possessing a tremendous zest for life, a generosity of spirit and a wry sense of humour - the prerequisite of all leg-spinners who are seemingly constantly the victims of an unkind fate. He also had all the miners' fierce pride, independence and unswerving loyalty to those whom he respected for their ability and as men.",
        "Even in his latter years and a different age, he referred respectfully and affectionately to Mr Jackson and Mr Jardine (his county and England captains), describing them as `real gentlemen' with no concessions to modern familiarities; but for those captains for whom he had no respect he, on his own admission, bowled but refused to spin the ball!",
        "Perhaps it was this pride (or stubbornness) which led him to refuse terms offered by Derbyshire after the war, so forfeiting the benefit due in 1940. So he returned to the pit and league cricket with Hickleton Main. As one of his contemporaries commented recently, `...the sad thing was he couldn't take himself seriously and didn't know how good he was'.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}