{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "3",
            "6s": "1",
            "Ave": "13.74",
            "Ct": "59",
            "HS": "89",
            "Inns": "63",
            "Mat": "49",
            "NO": "9",
            "Runs": "742",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "27",
            "6s": "",
            "Ave": "15.88",
            "Ct": "831",
            "HS": "89",
            "Inns": "812",
            "Mat": "654",
            "NO": "161",
            "Runs": "10342",
            "St": "0"
        },
        {
            "": "List A",
            "100": "0",
            "50": "0",
            "6s": "",
            "Ave": "1.00",
            "Ct": "3",
            "HS": "3",
            "Inns": "5",
            "Mat": "8",
            "NO": "0",
            "Runs": "5",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "3",
            "4w": "11",
            "5w": "9",
            "Ave": "25.58",
            "BBI": "7/35",
            "BBM": "11/48",
            "Balls": "13147",
            "Econ": "2.03",
            "Inns": "88",
            "Mat": "49",
            "Runs": "4451",
            "SR": "75.5",
            "Wkts": "174"
        },
        {
            "": "First-class",
            "10": "50",
            "4w": "",
            "5w": "196",
            "Ave": "19.23",
            "BBI": "10/54",
            "BBM": "",
            "Balls": "150168",
            "Econ": "2.18",
            "Inns": "",
            "Mat": "654",
            "Runs": "54709",
            "SR": "52.8",
            "Wkts": "2844"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "27.00",
            "BBI": "3/20",
            "BBM": "3/20",
            "Balls": "428",
            "Econ": "3.78",
            "Inns": "",
            "Mat": "8",
            "Runs": "270",
            "SR": "42.8",
            "Wkts": "10"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/1121108.html",
        "http://www.espncricinfo.com/magazine/content/story/897043.html",
        "http://www.espncricinfo.com/blogs/content/story/782525.html",
        "http://www.espncricinfo.com/india-v-england-2012/content/story/593771.html",
        "http://www.espncricinfo.com/india-v-england-2012/content/story/593242.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=16331"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/93800/93895.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/93800/93895.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/93800/93895.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJuly 5, 1929, Limpsfield, Surrey "
        ],
        "Bowling style": [
            "Slow left-arm orthodox"
        ],
        "Died": [
            "March 30, 1995, Perth, Western Australia, Australia (aged 65 years 268 days) "
        ],
        "Full name": [
            "Graham Anthony Richard Lock"
        ],
        "Major teams": [
            "England,",
            "Leicestershire,",
            "Surrey,",
            "Western Australia"
        ],
        "Other": [
            "Coach"
        ]
    },
    "profile_info": [
        null,
        null,
        null,
        "It was a different story at Old Trafford in 1956, when Laker took 19 Australian wickets while Lock had to be content with the left-over, and economical match figures of one for 106 from 69 overs. He had enjoyed his own ten-wicket return three weeks earlier. After taking six for 29 in Kent's first innings at Blackheath, he demolished their second innings with figures of 29.1-18-54-10. In 1957 he had a match return of 11 for 48 from 37.4 overs in the Oval Test against West Indies, and in the wet summer of 1958 he was utterly ruthless against the weak New Zealanders, taking 34 wickets at just 7.47 apiece.",
        "On overseas tours, he was not quite the same threat, except on the soft pitches of New Zealand in 1958-59. There he took 13 Test wickets at less than nine apiece, but also saw himself on film, and was genuinely shocked by the imperfection of his action. Had I known I was throwing I wouldn't have bowled that way, he said later. So he remodelled his action once more, but he still took his 100 wickets every year until 1962, his penultimate year at The Oval. He was no longer such a fearsome proposition in England but emerged as a better bowler overseas. He was the leading wicket-taker on MCC's tour of India and Pakistan in 1961-62 and, when he was omitted from the side for Australia in 1962-63, he went instead to play for Western Australia, where he took 32 wickets in the Sheffield Shield and immediately became a fixture. In 1966-67, he was the first post-war bowler to take 50 or more Shield wickets in a season. He assumed the captaincy in 1967-68 and led Western Australia to only their second Shield. Meanwhile, he had been recruited by Leicestershire for mid-week games in 1965, and captained them in the next two seasons with such infectious enthusiasm that they rose from 14th in 1965 to second in 1967, then their highest position in the Championship.",
        "There was an unexpected twist to this phase of his career when he was called to the Caribbean to replace the injured Titmus in 1967-68 and played in the last two Tests. In the final one, at Georgetown, his belligerent 89 in England's first innings surpassed his previous highest first-class score, and put England on course for the draw that gave them the series. He was, Trevor Bailey wrote, the ideal person to walk out to the crease when the match seemed lost.",
        null,
        null
    ],
    "recent_matches": [
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}