{
    "batting_averages": [
        {
            "": "Tests",
            "100": "2",
            "50": "5",
            "6s": "1",
            "Ave": "32.29",
            "Ct": "39",
            "HS": "170",
            "Inns": "36",
            "Mat": "22",
            "NO": "2",
            "Runs": "1098",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "124",
            "50": "251",
            "6s": "",
            "Ave": "39.45",
            "Ct": "876",
            "HS": "344",
            "Inns": "1478",
            "Mat": "870",
            "NO": "104",
            "Runs": "54211",
            "St": "5"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "26.22",
            "BBI": "2/12",
            "BBM": "3/68",
            "Balls": "666",
            "Econ": "2.12",
            "Inns": "13",
            "Mat": "22",
            "Runs": "236",
            "SR": "74.0",
            "Wkts": "9"
        },
        {
            "": "First-class",
            "10": "64",
            "4w": "",
            "5w": "240",
            "Ave": "18.14",
            "BBI": "10/49",
            "BBM": "",
            "Balls": "124831",
            "Econ": "2.45",
            "Inns": "",
            "Mat": "870",
            "Runs": "50980",
            "SR": "44.4",
            "Wkts": "2809"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/1091607.html",
        "http://www.espncricinfo.com/blogs/content/story/1081396.html",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/981655/cricket-s-greatest-bastard",
        "http://www.espncricinfo.com/magazine/content/story/926133.html",
        "http://www.espncricinfo.com/magazine/content/story/887027.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=13424"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/208700/208777.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/208700/208777.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/208700/208777.icon.jpg"
    ],
    "personal_info": {
        "Also known as": [
            "The Doctor, WG, Doc"
        ],
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJuly 18, 1848, Downend, Bristol "
        ],
        "Died": [
            "October 23, 1915, Mottingham, Kent (aged 67 years 97 days) "
        ],
        "Full name": [
            "William Gilbert Grace"
        ],
        "In a nutshell": [
            null
        ],
        "Major teams": [
            "England,",
            "Gentlemen,",
            "Gloucestershire,",
            "London County,",
            "Marylebone Cricket Club,",
            "South of England"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        "The statistics of his career are alone enough to explain why - more than 54,000 first-class runs (there are at least two different versions of the precise figure, so let's leave it at that) spread across 44 seasons, including 839 in just eight days of 1876, when he hit a couple of triple-centuries, and only one other batsman managed to top a thousand runs in the entire season; a thousand in May in 1895, when he was nearly 47; and 2800-odd wickets costing less than 18 runs apiece. I suppose we might wonder why his bowling average wasn't even more impressive, given the ropey pitches on which Dr Grace played. No modern cricketer would deign to turn out on them, which makes his batting all the more wondrous, and comparisons with Bradman or anyone since quite pointless.",
        "But there was not that much to Grace apart from these skills and his devotion to his family. A hand of whist appears to have marked the limit of his capacity for cerebration, and if one wished to be rude to suburbia one might identify Grace as suburban man incarnate, fluctuating mentally as well as physically between the fringes of Bristol and the London Counties, ultimately coming to rest in Eltham. His one inherited asset was that he came from a clan which was dotty about a great game and dutiful (but in some cases no more) about the general practice of medicine, with no doubt in its collective mind which came first at all times and in all places. His brother EM Grace, who was a coroner, once had a corpse put on ice until he could attend to it at close of play, and WG himself must have had one of the most prolonged medical trainings in history because he so frequently interrupted it in order to exercise his major talent at the crease. He began to study as a bachelor of 19, and was a father of three in his thirties before taking his final qualification at Westminster Hospital. His most conspicuous act as a doctor is thought to have occurred when an unfortunate fieldsman impaled himself on the boundary fence at Old Trafford.",
        "It was simply because the cricketing Grace totally dominated his own era that an exasperated CLR James could not understand why standard history books of the period never mentioned him. This man, for heaven's sake, opened for England at the age of 50 - and at the age of 18 he had scored 224 not out for England against Surrey, in a match which he left halfway through in order to win a quarter-mile hurdles championship at the Crystal Palace! No wonder he was the best-known Englishman apart from Mr Gladstone, so much so that Evelyn Waugh's friend, Monsignor Ronnie Knox, waggishly suggested that Gladstone and Grace were really one and the same celebrity.",
        "Athletic is not a word that obviously comes to mind when contemplating Grace in his prime, though a slim young man did precede the pot-bellied genius, who in middle age was far too heavy for any horse to bear. I have often wondered how stylishly he played his strokes ever since I saw some film in which he appeared to be brandishing his bat as though he was about to poke the fire with it. Something tells me that he never hit the ball as gracefully as Victor Trumper did in the famous photo of his straight drive; Grace, I suspect, was much more about power than aesthetics.",
        "That, at any rate, would fit what we know of his character in general. Apart from tenderness to his relatives and a generous soft spot for children, he was not, I think, a particularly attractive man, though he could sometimes (and it is usually recorded as remarkable) encourage a young player on his own side with - as the saying went in his day - bluff good humour. After the Australians had experienced him for the first time, a commentator Down Under observed that, \"For so big a man, he is surprisingly tenacious on very small points.\" He was notorious for employing, in order to pursue victory or personal achievement, a variety of wiles and tricks that may be thought of as, well, hardly cricket. He was also, throughout his career, quite breathtakingly grasping when his eye caught the glint of hard cash.",
        "It was the social historian Eric Midwinter who, some years ago, pointed out that on Grace's first tour of Australia in 1873-74 (when he was a medical student simultaneously enjoying his honeymoon) he extracted a fee of £1500 from the organisers, which would be well over £100,000 at present values. On his second tour in 1891-92, one-fifth of the entire cost of transporting 13 English cricketers across the world, supporting them in Australia and paying them for what they did there, went into Grace's pocket. He regularly collected testimonials - one, worth £1458, was organised by MCC so that he might buy a medical practice - and overall probably took something like £1 million in today's currency out of the game; and, remember, there was no sponsorship nor endorsements in those days to inflate a star's income. This was in a period when the prosperous middle classes were earning no more than £1000 a year, a highly skilled artisan £200, and a labourer half as much if he was lucky. A good professional county cricketer in the second half of the 19th century saw his wages rise from £100 to £250. No wonder it cost twice as much to get into some English grounds if Grace was playing than if he was not.",
        "The astonishing thing about the mercenary Grace, of course, is that he was classified and has ever since been glorified as an amateur. Nothing more exposed the humbug that used to smother the entire topic of Gents v Players than an examination of Grace's financial rewards from the game; and nothing more reveals the intellectual dishonesty at the heart of the humbug than something Grace once said when trying to argue the Gloucestershire committee into playing more amateurs than professionals. He declared his fear for the future of cricket if it became wholly professional. \"Betting and all kindred evils will follow in its wake, and instead of the game being followed up for love, it will simply be a matter of £ s d.\" Prophetic words, perhaps; but it ill became WG Grace to mouth them.",
        "It will be gathered from the above that he has never been a hero of mine, not since the day in adolescence when I discovered that he was sometimes a shameless cheat in a game that, I was being asked to believe, was wholly honourable. I shall nevertheless drink to his memory on July 18 because his tremendous gifts, especially his phenomenal batting, were largely responsible for the elevation of cricket from just another 19th-century game, which had become popular partly because it lent itself to gambling.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}