{
    "batting_averages": [
        {
            "": "Tests",
            "100": "22",
            "50": "24",
            "6s": "27",
            "Ave": "58.45",
            "Ct": "110",
            "HS": "336*",
            "Inns": "140",
            "Mat": "85",
            "NO": "16",
            "Runs": "7249",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "167",
            "50": "185",
            "6s": "",
            "Ave": "56.10",
            "Ct": "820",
            "HS": "336*",
            "Inns": "1005",
            "Mat": "634",
            "NO": "104",
            "Runs": "50551",
            "St": "3"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "1",
            "5w": "2",
            "Ave": "37.80",
            "BBI": "5/36",
            "BBM": "7/87",
            "Balls": "7969",
            "Econ": "2.36",
            "Inns": "110",
            "Mat": "85",
            "Runs": "3138",
            "SR": "96.0",
            "Wkts": "83"
        },
        {
            "": "First-class",
            "10": "3",
            "4w": "",
            "5w": "22",
            "Ave": "30.58",
            "BBI": "9/23",
            "BBM": "",
            "Balls": "51579",
            "Econ": "2.60",
            "Inns": "",
            "Mat": "634",
            "Runs": "22389",
            "SR": "70.4",
            "Wkts": "732"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/1143430.html",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/970695/the-tendulkar-of-batting-positions",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/927323/third-man",
        "http://www.espncricinfo.com/magazine/content/story/869305.html",
        "http://www.espncricinfo.com/magazine/content/story/686947.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=14022"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/270900/270973.icon.png",
        "http://p.imgci.com/db/PICTURES/CMS/270900/270973.icon.png",
        "http://p.imgci.com/db/PICTURES/CMS/270900/270973.icon.png"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJune 19, 1903, Buckland, Dover, Kent "
        ],
        "Bowling style": [
            "Right-arm medium-fast"
        ],
        "Died": [
            "July 1, 1965, Kloof, Natal, South Africa (aged 62 years 12 days) "
        ],
        "Education": [
            "Cirencester Grammar School"
        ],
        "Full name": [
            "Walter Reginald Hammond"
        ],
        "In a nutshell": [
            null
        ],
        "Major teams": [
            "England,",
            "Gloucestershire,",
            "South Africa Air Force"
        ]
    },
    "profile_info": [
        "\nThe judgment of cricket history is that the greatest batsmen the game has known are - in order of appearance, only - WG Grace, Jack Hobbs, Walter Hammond and Don Bradman. Others may come close indeed to those four but do not quite take place with them. It is, of course, coincidence that two of them played for Gloucestershire; but without doubt Hammond, although he was not a native of that county, succeeded by right and without question to the eminence there previously occupied solely by Dr Grace. \n",
        "Wally Hammond was a most exciting cricketer, perhaps the more so for the hint of an almost Olympian aloofness. He was also - and the two do not always go together - a naturally-gifted athlete who could excel at any game he cared to play; today he would be brought up as a rising football star. He had that physical stamp; he moved easily, with an ease which yet promised that, at need, he could launch himself into a tiger leap. Even as late as 1951, when he made his last first-class appearance and after he had put on a considerable amount of weight, his movement was poised, assured, and graceful.",
        "The instant he walked out of a pavilion, white-spotted blue handkerchief showing from his right pocket, bat tucked underarm, cap at a hint of an angle, he was identifiable as a thoroughbred. Strongly-built, square-shouldered, deep-chested, with impressively powerful forearms, it seemed as if his bat weighed nothing in those purposeful hands.",
        "His figures are convincing evidence of his quality. Between 1920 and 1951 he scored 50,493 runs, with 167 centuries and an average of 56.10; in Tests 7249 runs (22 centuries) at 58.45, as a bowler, 732 wickets (average 30.58); and he held 820 catches. Like Jack Hobbs, he might have achieved even more impressive figures if he had been able to play throughout his career. For instance, he first appeared for Gloucestershire (where he had been to school at Cirencester for five years) in 1920; but Lord Harris, piqued that he would not play for Kent, the county of his birth, quibbled about his qualification. So, effectively, he did not enter county cricket until 1923; he missed the entire season of 1926 through an illness contracted in the West Indies (he came back to start the next season by scoring 1000 in May); of course, he lost the 1940 to 1945 seasons when he was on a high plateau of achievement; and played only two first class matches after he returned from  Australia in March 1947.",
        "A natural player, he was virtually never coached until he had become a county player, when George Dennett used sometimes to advise him. Instinctively basically correct, he was sound in defence, but never defensively-minded. Like most outstanding batsmen, he was primarily a front-foot player who, with the years, operated more off the back. His great power lay in his driving, which was pure textbook in style, clean, apparently effortless but, through the combination of innate timing and immense strength, often achieving immense velocity.",
        "As a young man he was a dashing strokemaker; willing to tilt at all the bowlers of the world. He remained superbly stylish, his cover-driving, from front foot or back, utterly memorable. In those early days he cut, glanced, hooked and lofted the ball quite fearlessly. With his early maturity, he became a thinking batsmen. When he went to Australia under Percy Chapman in  1928-29, although he was only 25 he had worked out exactly how he would make his runs. Eschewing the hook altogether and, largely, the cut, he decided to score - off all but the obviously punishable ball - within the V between extra cover and midwicket. He succeeded with a new record aggregate for a rubber of 905 runs at 113.12 in the five Tests; which has still only once been exceeded (by Sir Donald Bradman, of course).",
        "Even in his cricketing middle age, his footwork flowed like that of a young man. He would be down the pitch - two, three or four yards - with unhurried ease and, as he reached the length he wanted, the bat moved with languid certainty through the ball, which flew, with that savage force which was the measure of his hitting, to the place he wished.",
        "Of the four great batsmen he was physically the finest and most powerfully equipped. He was a superb fast-medium bowler who often, as Sir Donald Bradman once remarked, \"was too busy scoring runs to worry about bowling.\" When he was roused - as he once was by Essex bowling bouncers at the  Gloucestershire batsmen - his pace could be devastating. \"I never saw a man bowl faster for Gloucestershire than Wally did that day,\" said Tom Goddard, \"and he not only battered them, he bowled them out as well.\"",
        "At slip he had no superior. He stood all but motionless, moved late but with uncanny speed, never needing to stretch or strain but plucking the ball from the air like an apple from a tree.",
        "Statistics cannot tell all: but revealingly they show of Wally Hammond that he made 167 centuries and reached fifty without making a hundred 184 times, in Tests 22 hundreds, only 24 fifties without reaching three figures; in each case almost even money on 100 if he got halfway.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}