{
    "batting_averages": [
        {
            "": "Tests",
            "100": "1",
            "50": "4",
            "6s": "0",
            "Ave": "26.60",
            "Ct": "12",
            "HS": "108",
            "Inns": "27",
            "Mat": "19",
            "NO": "4",
            "Runs": "612",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "11",
            "50": "73",
            "6s": "",
            "Ave": "26.39",
            "Ct": "217",
            "HS": "140",
            "Inns": "565",
            "Mat": "379",
            "NO": "39",
            "Runs": "13884",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "2",
            "5w": "1",
            "Ave": "27.46",
            "BBI": "6/32",
            "BBM": "7/68",
            "Balls": "3318",
            "Econ": "3.17",
            "Inns": "34",
            "Mat": "19",
            "Runs": "1758",
            "SR": "51.8",
            "Wkts": "64"
        },
        {
            "": "First-class",
            "10": "4",
            "4w": "",
            "5w": "54",
            "Ave": "23.30",
            "BBI": "8/69",
            "BBM": "",
            "Balls": "43215",
            "Econ": "3.13",
            "Inns": "",
            "Mat": "379",
            "Runs": "22580",
            "SR": "44.5",
            "Wkts": "969"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/bodyline/content/story/316173.html",
        "http://www.espncricinfo.com/wcm/content/story/111721.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155449.html",
        "http://www.espncricinfo.com/cricketer/content/story/298007.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154695.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/80100/80192.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/80100/80192.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/80100/80192.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nJune 3, 1906, Stafford "
        ],
        "Bowling style": [
            "Legbreak"
        ],
        "Died": [
            "December 12, 1968, St John's Wood, London (aged 62 years 192 days) "
        ],
        "Full name": [
            "Robert Walter Vivian Robins"
        ],
        "Major teams": [
            "England,",
            "Cambridge University,",
            "Middlesex"
        ],
        "Relation": [
            null,
            "\n",
            null,
            "\n",
            null,
            "\n"
        ]
    },
    "profile_info": [
        null,
        "From an early age, Robbie was taught the rudiments of the game by his father, a Staffordshire player, and as a boy he assisted East Molesey C.C. He attributed his success to an indefatigable, patient male parent, but whatever the reason, he always displayed an aggressively enterprising attitude to the game, whether in batting, bowling, fielding, particularly at cover point, or in captaincy, which made him immensely popular with spectators and frequently swayed the course of a match.",
        "He got his Blue as a Freshman at Cambridge in 1926 purely as a batsman, scoring 37 and 21 not out. In the next season's University match he hit 55 and 41, sending down only one over; but in 1928 he not only put together innings of 53 and 101 not out, but took eight wickets for 151 runs, almost bringing success over Oxford. That gained him a place in the Gentlemen's team against the Players for the first of numerous occasions. Impatient of dull cricket, Robins wasted few scoring opportunities as a batsman, employing his nimble footwork and flexible wrists to the full, especially in cutting and driving. His example transformed a hitherto drab Middlesex side when he took over the captaincy from 1935 to 1938. He also led the county in 1946, 1947--when they carried off the Championship--and 1950.",
        "In his first full season for them, 1929, he achieved his only double, scoring 1,134 runs, including one century, and taking 162 wickets, but more than once he came near repeating that feat. He took part in 19 Test matches for England, being captain in the home series with New Zealand in 1937, and in these he made 612 runs, average 26.60, and took 64 wickets for 27.46 runs each. His highest innings in a Test was 108, when runs were sorely needed, against South Africa at Old Trafford in 1935, and his best bowling analysis six wickets for 32 runs against the West Indies at Lord's in 1933. His one major tour abroad was to Australia in 1936-37, when he was vice-captain under G. O. Allen. Unfortunately he broke a finger of the right hand at fielding practice in the first week of the tour with the result that he could not spin the ball and achieved small bowling success. At the age of 45, he captained the M.C.C. team which visited Canada in 1951, meeting with considerable all-round success.",
        "As a bowler of leg-bowlers and googlies, Robins could not always command a good length; but though he sometimes came in for punishment he was always capable of producing a telling delivery. Twice he did the  hat-trick for Middlesex: against Leicestershire in 1929 and against Somerset in 1937, both at Lord's. At Trent Bridge in 1930, he bowled Sir Donald Bradman with a googly to which that famous batsman did not offer a stroke and virtually won the game for England. One recalls, too, an occasion at Lord's when Robins, arriving late through business claims, put himself on to bowl directly he took the field. Nottinghamshire at that time were making runs comfortably, with F. W. Stocks, the left-hander, well set. The last ball of an over from Robins pitched so near the end of the popping crease on the batsman's off-side that he completely ignored it. To his astonishment, the ball turned almost at right-angles and hit the stumps! No wonder that Robbie doubled up with laughter.",
        "As a Test team selector, Robins served from 1946 to 1949 and again in 1954 and was chairman of the Committee from 1962 to 1964. He began this latter period by issuing an ultimatum to first-class cricketers: Play aggressively at all times; otherwise you will not be chosen for England. It cannot be said that this produced precisely the results desired, but at least it relieved Test cricket of some of the stagnation which threatened its popularity at the time. Robins also ably filled the position of manager of the M.C.C. team in the West Indies in 1959-60.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}