{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "7.00",
            "Ct": "0",
            "HS": "11*",
            "Inns": "5",
            "Mat": "4",
            "NO": "2",
            "Runs": "21",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "0",
            "50": "0",
            "6s": "",
            "Ave": "5.89",
            "Ct": "52",
            "HS": "38",
            "Inns": "185",
            "Mat": "134",
            "NO": "31",
            "Runs": "908",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "2",
            "5w": "1",
            "Ave": "21.11",
            "BBI": "5/110",
            "BBM": "8/126",
            "Balls": "705",
            "Econ": "3.05",
            "Inns": "7",
            "Mat": "4",
            "Runs": "359",
            "SR": "41.4",
            "Wkts": "17"
        },
        {
            "": "First-class",
            "10": "27",
            "4w": "",
            "5w": "93",
            "Ave": "19.31",
            "BBI": "9/47",
            "BBM": "",
            "Balls": "29536",
            "Econ": "3.31",
            "Inns": "",
            "Mat": "134",
            "Runs": "16305",
            "SR": "34.9",
            "Wkts": "844"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/152871.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155668.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154760.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/96800/96825.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nMarch 11, 1876, Bolton, Lancashire "
        ],
        "Bowling style": [
            "Right-arm fast"
        ],
        "Died": [
            "January 30, 1937, Marylebone, London (aged 60 years 325 days) "
        ],
        "Full name": [
            "Walter Brearley"
        ],
        "Major teams": [
            "England,",
            "Lancashire,",
            "London County"
        ]
    },
    "profile_info": [
        null,
        "Born on March 11, 1876, he was highly successful with the Bolton and Manchester clubs before appearing in county cricket when 26 years of age. Altogether for Lancashire he took 690 wickets at a cost of 18 runs apiece, and in first-class cricket his record was 844 at 19.31. He met with special success in the great local struggles with Yorkshire and in the fourteen matches played between these counties from 1903 to 1911 he dismissed 125 batsmen at 16 runs each.",
        "During his most effective year in 1908, 163 wickets fell to him, but he was never in better form than in 1905 when he played for England against Australia at Old Trafford and the Oval. He found special pleasure in making extra efforts to dismiss some batsmen, and, that season, when playing for England, the Gentlemen and Lancashire, he disposed of Victor Trumper no fewer than six times. Walter Brearley also played for England against Australia at Leeds in 1909 and once against South Africa during the Triangular Tournament in 1912.",
        "At Lord's in 1905 for Gentlemen against Players on a slow pitch that seemed unsuited to him, he prevailed to such an extent by the exercise of sheer energy that in the first innings he took seven wickets for 104 runs, and followed this by bowling 24 overs for 51 runs and two wickets. Another notable achievement that year was his seventeen wickets for 137 runs against Somerset at Old Trafford--nine for 47 and eight for 90. He finished the first innings by bowling Cranfield and Bucknall with successive deliveries and when Somerset faced arrears of 77 his first two balls accounted for H. Martyn and Hardy--so in this match he was credited with four wickets in four balls. As on other occasions Brearley, by his great pace combined with excellent length, demoralised the batsmen.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}