{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "0",
            "6s": "0",
            "Ave": "14.25",
            "Ct": "0",
            "HS": "25",
            "Inns": "4",
            "Mat": "2",
            "NO": "0",
            "Runs": "57",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "54",
            "50": "119",
            "6s": "",
            "Ave": "39.53",
            "Ct": "76",
            "HS": "312*",
            "Inns": "657",
            "Mat": "397",
            "NO": "43",
            "Runs": "24276",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "2",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "51.50",
            "BBI": "2/16",
            "BBM": "",
            "Balls": "164",
            "Econ": "3.76",
            "Inns": "",
            "Mat": "397",
            "Runs": "103",
            "SR": "82.0",
            "Wkts": "2"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155439.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/154645.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/63300/63382.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nApril 30, 1905, Shirebrook, Derbyshire "
        ],
        "Died": [
            "October 10, 1980, Forest Town, Nottinghamshire (aged 75 years 163 days) "
        ],
        "Full name": [
            "William Walter Keeton"
        ],
        "Major teams": [
            "England,",
            "Nottinghamshire"
        ]
    },
    "profile_info": [
        null,
        "Walter Keeton was, like so many other attractive and talented opening\nbatsmen, born into an era when competition was stiff, and consequently he played\nonly twice for England. At Leeds in 1934,\nafter being twelfth man at Manchester, he\nopened with Cyril Walters in the enforced\nabsence of Sutcliffe and made 25 and 12,\nfalling to the deadly O'Reilly and\nGrimmett. He had to wait five years for his\nother Test appearance, and then, at The\nOval, he played on to the first ball sent\ndown by Tyrell Johnson, the West Indies\nfast left-arm bowler playing in his only\nTest. In the second innings Constantine\nbowled him for 20.",
        "William Walter Keeton, who died in October at the age of 75, made just short of\n25,000 runs in first-class cricket at a fraction under 40. Born at Shirebrook on April 30, 1905, he made his debut for Nottinghamshire in 1926. The death of 'Dodge' Whysall and the impending retirement of the remarkable George Gunn at last created an opportunity for him, and from 1931 until 1951 he was a valued member of the side, scoring 54 centuries (at least one against every other county), the highest being 312 not out against Middlesex at The Oval (Eton and Harrow were playing at Lord's). His innings lasted seven and a quarter hours and owed much to dropped chances: he was missed five times between 110 and 196. Besides this he made six double-centuries, the last two in 1949, when 44.",
        "Just below the peak of the order of merit of county opening partnerships -\nthe Brown-Tunnicliffe, Hobbs-Sandham, Sutcliffe-Holmes level - are found the likes of Keeton and Charlie Harris, who posted 45 century first-wicket stands, their highest 277 against Middlesex at Trent Bridge in 1933. Keeton and Harris, the one studious, highly-strung, superstitious and elegant, the other a comedian, erratic of mood and attitude, are enshrined in Nottingham sporting folklore.",
        "Keeton, who also played soccer for Sunderland and Nottingham Forest, had\nrather more than an average share of bad luck. In 1932 he might have batted his way into the MCC side to Australia, but an injury in the first Test Trial and the complete wash-out of the second prevented his making an impression. A year later he struck a rich patch in the month of August, scoring 1102 runs, with six centuries. Any chance he might have had of Test honours in 1935 were scotched when he was knocked down by a lorry in January and had to spend four months in convalescence. It was a bad year for him. In the famous match at Bramall Lane in which Paul Gibb made a spectacular debut for Yorkshire, Keeton collided with an umpire and was knocked cold for several minutes. He did, though, go on to make a century. In the 1938-39 winter appendicitis came as another obstacle, but\nthat summer came his record-breaking triple-century at The Oval.",
        "After several seasons with Bingley in the Bradford League during the war, and a\nclub record benefit of £3249 in 1947, he had another very successful season, 1949, when he made most runs for Notts, 1944 at 55.54 - this after a nasty blow in the chest when facing Lindwall the previous year when the county faced the Australians. After a bout of laryngitis in 1950, the Keeton-Harris partnership came together again for the Northants match, and, with 87 years between them, they put on 122 in the first innings and 151 unfinished in the second.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}