{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "50": "1",
            "6s": "0",
            "Ave": "18.14",
            "Ct": "2",
            "HS": "56",
            "Inns": "14",
            "Mat": "8",
            "NO": "0",
            "Runs": "254",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "9",
            "50": "56",
            "6s": "",
            "Ave": "20.07",
            "Ct": "222",
            "HS": "173",
            "Inns": "696",
            "Mat": "442",
            "NO": "54",
            "Runs": "12891",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "0",
            "4w": "0",
            "5w": "1",
            "Ave": "21.14",
            "BBI": "5/46",
            "BBM": "5/65",
            "Balls": "858",
            "Econ": "2.06",
            "Inns": "13",
            "Mat": "8",
            "Runs": "296",
            "SR": "61.2",
            "Wkts": "14"
        },
        {
            "": "First-class",
            "10": "15",
            "4w": "",
            "5w": "73",
            "Ave": "15.89",
            "BBI": "8/22",
            "BBM": "",
            "Balls": "56375",
            "Econ": "2.01",
            "Inns": "",
            "Mat": "442",
            "Runs": "18887",
            "SR": "47.4",
            "Wkts": "1188"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/engvaus/content/story/215631.html",
        "http://www.espncricinfo.com/magazine/content/story/210469.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155628.html"
    ],
    "latest_photos": [],
    "personal_info": {
        "Also known as": [
            "Wilfred Flower"
        ],
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nDecember 7, 1856, Calverton, Nottinghamshire "
        ],
        "Bowling style": [
            "Right-arm offbreak"
        ],
        "Died": [
            "November 1, 1926, Carlton, Nottingham (aged 69 years 329 days) "
        ],
        "Full name": [
            "Wilfred Flowers"
        ],
        "Major teams": [
            "England,",
            "Nottinghamshire"
        ]
    },
    "profile_info": [
        "\nWilfred Flower was the last survivor of the Notts XI that in 1878 played the opening match with the first Australian team to visit this country. A steady slow bowler with an offbreak, which rendered him extremely difficult on a soft wicket, a fine resolute batsman, and a capital field, Flowers was one of the best all-round cricketers of his time. Born at Calverton on December 7, 1856, but soon associated with Sutton-in-Ashfield--the great nursery of Notts cricket for many years--he was first engaged by the Workshop club when only 17. Three seasons later he was given a place in the Notts Colts match, and he at once made his mark by taking the wickets of five members of the County Eleven at a cost of only 8 runs. This performance naturally led to his appearance in the game between the M.C.C. and the Colts of England--at that period and for a long while afterwards the recognized test for the most promising of young professional cricketers. Again Flowers seized his chance for, if in the first innings he disposed of only one batsman, that player was none other than W. G. Grace, and in the second innings, when he obtained four wickets, he again enjoyed the distinction of dismissing the great man.  \n",
        "In the same season-- 1877-- Flowers found his way into the Notts eleven, and the association then started lasted for a period of 20 years. A year later he joined the staff at Lord's, and one of his first matches for the M.C.C. was that memorable struggle on May 27, 1878, when the Australians--previously beaten in a single innings at Nottingham--startled the cricket world by defeating the powerful side got together to represent the premier club, by nine wickets. M.C.C. made 33 and 19, and the Australians 41 and 12 for one wicket, the game being over in the one day. Flowers was not called upon to bowl, Alfred Shaw and Fred Morley being unchanged, and in the first innings Spofforth disposed of him without scoring, but in the second Flowers made 11 of the 19 runs for which the whole Marylebone team were dismissed. Flowers in the course of his long career had several notable successes against the various Australian teams. In 1884 he made 90 for the North of England, at Trent Bridge, and two years afterwards, on the same ground, he shared in a wonderful partnership with Richard Barlow, ofLancashire. Barlow scored 113 and Flowers 93, the pair adding no fewer than 172 for the ninth wicket. A third notable display of his against Australian bowling was at the expense of the side captained by Blackham, in 1893. The game took place at Lord's, and Blackham, sending the M.C.C. in to bat, the Club put together a total of 424, to which Flowers contributed 130 and Frank Marchant 103. Flowers's best year was probably 1883, when he scored 1,114 runs, with an average of 24 - no mean record in those days - and in addition took 113 wickets for less than 15 runs each. In 1893 he made over 1,000 runs, and in 1896 - his last season with Notts - he put together in his last match for the county an innings of 107 against Sussex at Trent Bridge. Altogether he appeared for different Players' elevens on eighteen occasions. ",
        "He went out to Australia in the winter of 1884-85 with a team led by Arthur Shrewsbury, and again in 1886-87 under the same captain. Once he played for England in this country - at Lord's against Australia in 1893. ",
        "In the matter of benefits, Flowers has a strangely unhappy experience. Notts, in 1895, gave him the match with Lancashire, at Trent Bridge, but so completely did the home batsmen fail against Arthur Mold, that, with fifteen wickets falling to that bowler, the contest was over early on the second day. An even greater blow occurred in 1899, when the M.C.C. arranged with Middlesex for the Whitsuntide match with Somerset to be given to Flowers as a reward for his long and excellent service to the club. To the general dismay, rain fell so continuously on the Bank Holiday that not a ball could be bowled, and next day on a drying wicket little more than three hours' play sufficed to finish off the game. In view of these misfortunes Notts in 1904 awarded Flowers part of the proceeds of a match at Trent Bridge, but still Flower's experience of benefits bordered on the tragic. ",
        null
    ],
    "recent_matches": [
        {},
        {}
    ]
}