{
    "batting_averages": [
        {
            "": "Tests",
            "100": "0",
            "4s": "9",
            "50": "1",
            "6s": "0",
            "Ave": "13.50",
            "BF": "237",
            "Ct": "3",
            "HS": "52",
            "Inns": "6",
            "Mat": "3",
            "NO": "0",
            "Runs": "81",
            "SR": "34.17",
            "St": "0"
        },
        {
            "": "ODIs",
            "100": "0",
            "4s": "5",
            "50": "0",
            "6s": "1",
            "Ave": "21.50",
            "BF": "85",
            "Ct": "0",
            "HS": "34",
            "Inns": "2",
            "Mat": "2",
            "NO": "0",
            "Runs": "43",
            "SR": "50.58",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "25",
            "4s": "",
            "50": "75",
            "6s": "",
            "Ave": "38.96",
            "BF": "",
            "Ct": "174",
            "HS": "248*",
            "Inns": "398",
            "Mat": "237",
            "NO": "40",
            "Runs": "13950",
            "SR": "",
            "St": "0"
        },
        {
            "": "List A",
            "100": "3",
            "4s": "",
            "50": "31",
            "6s": "",
            "Ave": "30.32",
            "BF": "",
            "Ct": "36",
            "HS": "122*",
            "Inns": "173",
            "Mat": "183",
            "NO": "20",
            "Runs": "4639",
            "SR": "",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "3",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "ODIs",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "2",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "",
            "5w": "0",
            "Ave": "32.76",
            "BBI": "3/17",
            "BBM": "",
            "Balls": "1519",
            "Econ": "2.71",
            "Inns": "",
            "Mat": "237",
            "Runs": "688",
            "SR": "72.3",
            "Wkts": "21"
        },
        {
            "": "List A",
            "10": "0",
            "4w": "0",
            "5w": "1",
            "Ave": "30.04",
            "BBI": "5/32",
            "BBM": "5/32",
            "Balls": "1766",
            "Econ": "4.59",
            "Inns": "",
            "Mat": "183",
            "Runs": "1352",
            "SR": "39.2",
            "Wkts": "45"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/wisdenalmanack/content/story/155343.html"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/022005/058017.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/022005/058017.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/022005/058017.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nDecember 12, 1954, Troumaca, St Vincent "
        ],
        "Bowling style": [
            "Right-arm medium"
        ],
        "Died": [
            "January 15, 1989, Banjul, The Gambia (aged 34 years 34 days) "
        ],
        "Education": [
            "Wellesbourne Secondary, High Wycombe"
        ],
        "Full name": [
            "Wilfred Norris Slack"
        ],
        "Height": [
            "\n5 ft 10 in "
        ],
        "Major teams": [
            "England,",
            "Middlesex,",
            "Windward Islands"
        ],
        "Nickname": [
            "Wilf, Slacky"
        ]
    },
    "profile_info": [
        "\nWilf Slack, the Middlesex and England left-handed opener, collapsed and died while batting in Banjul, capital of The Gambia, on January 15, 1989, at the age of 34. He had suffered four blackouts on the field or in the nets in the two previous years, but exhaustive tests had failed to identify the cause. Born in St. Vincent, Slack came to England at the age of eleven and learned his cricket at High Wycombe. He played for various local teams and in 1976, when 21, he was Buckinghamshire's leading run-scorer with 748 in his début season. The Middlesex coach, Don Bennett, marked him as first-class county material, and he was signed by them the next year. However, he did not establish himself until 1981, partly because he was asked to bat down the order. Promoted to open against Kent at Lord's when Brearley was recalled to lead England at Headingley, Slack hammered a maiden century in an unbroken second-innings, first-wicket stand of 367. His unbeaten 181 contained three sixes and twenty fours, and with Graham Barlow (174 not out) he bettered the county record of 312 by W. E. Russell and M. J. Harris. He followed with a carrier-best 248, again not out, in the second-innings of the next match, against Worcestershire, and went on to finish the season with settled place, his county cap and 1,303 Championship runs at 48.25. \n",
        "Quiet, even reserved, Slack prospered with the aid of a good understanding with Barlow, and in the seasons that followed he was often Middlesex's leading scorer. In 1985 his aggregate of 1,900 runs at 54.28 was bettered only by three others in the country, and that winter he went to Sri Lanka with the England B side, scoring heavily and consistently. Late in the tour he was called to the West Indies after Mike Gatting had his nose broken in the first one-day international of England's Caribbean tour. The dauntingly abrupt change in conditions and quality of opposition saw Slack make just 2 and 0 (run out) in his Test début at Port-of Spain. Dropped from the next two Tests, he made a brave 52 in an opening stand of 127 with Gooch in the Fifth, but an astonishing century by Richards - the fastest in Test history in terms of balls faced: 56 - rushed England to defeat by 240 runs and to a 5-0 defeat in the series. That experience, the loss of his partner when Barlow retired, and domestic problems affected Slack's form, and in his only other Test, at Headingley against the 1986 Indians, he again looked a good county player out of his depth. However, he battled on to record his 1,000 runs with a late-season revival, and rather surprisingly won a place in the England team for Australia in 1986-87. He ran into some good early bowling and did not play in any Tests or internationals. He gave Middlesex good service in 1988, hitting centuries in both innings against Glamorgan at Lord's and completing 1,000 runs in a season for the eighth time.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {},
        {},
        {},
        {},
        {}
    ]
}