{
    "batting_averages": [
        {
            "": "Tests",
            "100": "2",
            "50": "11",
            "6s": "1",
            "Ave": "30.19",
            "Ct": "60",
            "HS": "179",
            "Inns": "98",
            "Mat": "58",
            "NO": "21",
            "Runs": "2325",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "58",
            "50": "197",
            "6s": "",
            "Ave": "30.81",
            "Ct": "765",
            "HS": "267*",
            "Inns": "1534",
            "Mat": "1110",
            "NO": "237",
            "Runs": "39969",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "1",
            "4w": "6",
            "5w": "6",
            "Ave": "26.96",
            "BBI": "8/68",
            "BBM": "15/124",
            "Balls": "8225",
            "Econ": "2.49",
            "Inns": "90",
            "Mat": "58",
            "Runs": "3425",
            "SR": "64.7",
            "Wkts": "127"
        },
        {
            "": "First-class",
            "10": "68",
            "4w": "",
            "5w": "287",
            "Ave": "16.72",
            "BBI": "9/24",
            "BBM": "",
            "Balls": "185742",
            "Econ": "2.27",
            "Inns": "",
            "Mat": "1110",
            "Runs": "70322",
            "SR": "44.1",
            "Wkts": "4204"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/1084559.html",
        "http://www.espncricinfo.comhttp://www.thecricketmonthly.com/story/921327/test-cricket-s-most-useless-batting-position",
        "http://www.espncricinfo.com/magazine/content/story/890395.html",
        "http://www.espncricinfo.com/magazine/content/story/408886.html",
        "http://www.espncricinfo.com/magazine/content/story/304620.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=19376"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/DB/032004/050671.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/032004/050671.icon.jpg",
        "http://p.imgci.com/db/PICTURES/DB/032004/050671.icon.jpg"
    ],
    "personal_info": {
        "Batting style": [
            "Right-hand bat"
        ],
        "Born": [
            "\nOctober 29, 1877, North Moor, Kirkheaton, Yorkshire "
        ],
        "Bowling style": [
            "Slow left-arm orthodox"
        ],
        "Died": [
            "July 8, 1973, Branksome Park, Dorset (aged 95 years 252 days) "
        ],
        "Full name": [
            "Wilfred Rhodes"
        ],
        "Major teams": [
            "England,",
            "Europeans (India),",
            "Maharaja of Patiala's XI,",
            "Yorkshire"
        ]
    },
    "profile_info": [
        null,
        "His career is already legendary; it does indeed read like a fairy tale. He was not 21 years old when he first bowled for Yorkshire in a match against MCC at  Lord's. In the first innings he accounted for Trott and Chatteron; in the second, Trott,  Chatteron, CP Foley, and the Hon JR Tufton -- six wickets for 63, a modest beginning, true. But at the season's end he had established himself as the greatest slow left-hand bowler in England with 154 wickets, average 14.60.",
        "During the period in which Rhodes and Hobbs opened every England innings by prescriptive right, Rhodes put aside his bowling. In the Australian rubber of 1911-12 he contributed only 18 overs. But then the war came, reducing the Yorkshire attack. In  1919 Yorkshire needed again the spin and flight of Rhodes, so he picked up his bowling arts exactly where years before he had laid them down, picked them up as though he had not lost touch for a moment. He headed the bowling averages of 1919, 164 wickets, average 14.42 in 1048 overs. He was nearly 42 by the calendar. In 1902 he had gone in last for England at The Kennington Oval when 15 runs were wanted to beat Australia; George Hirst, with whom he always opened Yorkshire's attack, was holding the wicket at the other end. England won by one wicket.",
        "Twenty-four years afterwards, Rhodes in his forty-ninth year was recalled to the England XI and was one of the main causes of Australia's defeat and  England's emergence from years in the wilderness. On this, his last appearance for England, Rhodes took the wickets of Woodfull, Ponsford, Richardson (twice), Collins, and Bardsley for 79 runs. He had probably lost by then much of his old quick vitally fingered spin: but as he explained to me: \"If batsmen thinks as I'm spinnin' them, then I am\" -- a remark metaphysical, maybe, but to the point. At Sydney, in December 1903, on the shirt-fronted polished Bulli soil pitches of that distant halcyon day for batsmen, Australia scored 485, and the might of Australia's champions commanded the crease -- Trumper, Hill, Duff, Armstrong, Gregory. Rhodes bowled 48 overs for 94 runs, five wickets. It was on this occasion that Trumper, the most brilliant of all batsmen, alive or dead, made his famous remark to Rhodes -- \"for God's sake, Wilfred, give me a minute's rest.\"",
        "Rhodes could not turn the ball on the Australian grounds of half a century ago. He prevailed by length, variations of flight, but chiefly by unceasing accuracy of pitch, always demanding close attention from the batsman, the curving arc through the air, the ball dropping on the same spot over by over, yet not on quite the same spot, each over in collusion with the rest, every ball a decoy, some balls apparently guileless, some artfully masked -- and one of them, sooner or later, the master ball. He was economical in action, a few short strides, then a beautifully balanced sideways swing of the body, the arm loose and making a lovely arch. He could go on for hours; the rhythm of his action was in its easy rotation, hypnotic, lulling his victims to the tranced state in which he could work his will, make them perform strokes contrary to their reason and intention. Batsmen of Rhodes's heyday frequently succumbed to his bait for a catch in the deepfield.  David Denton had safe hands at long-on; and the score-sheets of the period repeated day by day the rubric -- c Denton b Rhodes. In rainy weather, c Tunnicliffe b Rhodes was familiar proof that  Wilfred was at work on a  sticky pitch, for Tunnicliffe was the best slip fielder of the century, a long giant with a reach into infinity.",
        "Rhodes really was a slow bowler, not quick and low flight to the pitch, after Lock's manner. At the end of his career he proudly maintained that \"Ah were never hooked and Ah were never cut,\" a pardonable exaggeration considering the proportion of truth in it. Rhodes seldom pitched short. \"Best ball on a `sticky' pitch is a spinnin' half-volley,\" such was his doctrine. And he bowled to his field with the precision of high mathematics. Ernest Tyldesley once told me that he often had no alternative but to play at least three balls an over, on a batsman's wicket, straight to mid-off, an inch off the spot where Rhodes had planted mid-off.",
        null,
        "While he was actively engaged in the game he was not a man given to affability. He was known as a natterer on the field; and to natter in the North of England means to talk naggingly, most to oneself, with the intention of being overheard. At Old Trafford in the 1930s Lancashire reached a total of 500 against Yorkshire. The Lancashire captain, Leonard Green, was about to take the bowling of Rhodes when the score was 499. Green was sure in his mind that a total of 500 would never again, or not for decades, be achieved by Lancashire against Yorkshire. He therefore determined that come what may, he would himself score the five hundredth run. So he blocked a ball from Rhodes, then ran like the wind. The ball was picked up by Emmott Robinson at silly-point, and hurled to the bowler's end, where it struck Rhodes on the wrist even as Green got home by the skin of his teeth. And in all the scurry and excitement Wilfred was heard to mutter, while he retrieved Robinson's violent throw, \"There's somebody runnin' up and down this wicket. Ah don't know who it is, but there's somebody runnin' up and down this wicket.\"",
        "He was a great player, one of the greatest of cricket's history, not only for his allround performances denoted by the statisticians: nearly 40,000 runs scored in 37 seasons and 4,184 wickets taken. He was great because his cricket was redolent and representative of Yorkshire county. In his old age he lost his eyesight and found his tongue. He accepted his affliction philosophically, and consoled himself by a flow of genial chatter never before heard from him. He attended cricket as long as health would permit. With an acquired sense he was able to follow the play. \"He's middlin' the ball right.\" But it was his delight in his last years to recall the old days. I asked him what he thought of Ranjitsinhji. \"He were a good bat were `Ranji.' But I always fancied myself getting him leg before doin' that leg glance of his.\" I tried again.  What did you think of Trumper? \"'E were a good bat were Victor.\" There was no advance on a good bat in Wilfred's vocabulary of praise. Once, though, he let himself go. I asked him his opinion of Sidney Barnes as a bowler. \"The best of 'em today is half as good as Barnie.\" He intended this as a compliment to the champions of today.",
        null,
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}