{
    "batting_averages": [
        {
            "": "Tests",
            "100": "2",
            "50": "3",
            "6s": "2",
            "Ave": "25.85",
            "Ct": "8",
            "HS": "116",
            "Inns": "37",
            "Mat": "23",
            "NO": "3",
            "Runs": "879",
            "St": "0"
        },
        {
            "": "First-class",
            "100": "55",
            "50": "132",
            "6s": "",
            "Ave": "39.86",
            "Ct": "295",
            "HS": "257",
            "Inns": "753",
            "Mat": "468",
            "NO": "109",
            "Runs": "25670",
            "St": "0"
        }
    ],
    "bowling_averages": [
        {
            "": "Tests",
            "10": "-",
            "4w": "-",
            "5w": "-",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "-",
            "Econ": "-",
            "Inns": "-",
            "Mat": "23",
            "Runs": "-",
            "SR": "-",
            "Wkts": "-"
        },
        {
            "": "First-class",
            "10": "0",
            "4w": "0",
            "5w": "0",
            "Ave": "-",
            "BBI": "-",
            "BBM": "-",
            "Balls": "194",
            "Econ": "3.92",
            "Inns": "",
            "Mat": "468",
            "Runs": "127",
            "SR": "-",
            "Wkts": "0"
        }
    ],
    "latest_articles": [
        "http://www.espncricinfo.com/magazine/content/story/698651.html",
        "http://www.espncricinfo.com/engvaus/content/story/212819.html",
        "http://www.espncricinfo.com/wisdenalmanack/content/story/156025.html",
        "http://www.espncricinfo.com/ci/content/story/142169.html",
        "http://www.espncricinfo.com/magazine/content/story/134669.html",
        "http://www.espncricinfo.com/ci/content/story/news.html?object=22340"
    ],
    "latest_photos": [
        "http://p.imgci.com/db/PICTURES/CMS/192900/192943.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/192900/192943.icon.jpg",
        "http://p.imgci.com/db/PICTURES/CMS/192900/192943.icon.jpg"
    ],
    "personal_info": {
        "Also known as": [
            "Bill, Billy"
        ],
        "Batting style": [
            "Left-hand bat"
        ],
        "Born": [
            "\nMarch 7, 1920, Bolton-on-Dearne, Yorkshire "
        ],
        "Died": [
            "April 24, 2004, Johannesburg, South Africa (aged 84 years 48 days) "
        ],
        "Full name": [
            "Willie Watson"
        ],
        "Major teams": [
            "England,",
            "Leicestershire,",
            "Yorkshire"
        ],
        "Other": [
            "Coach"
        ]
    },
    "profile_info": [
        "\nLast summer Willie and Barbara Watson and my wife and I were entertained by the president of MCC during the Lord's Test. Sir Tim Rice presented both of us with his brother Jonathan's book, One Hundred Lord's Tests, a happy reminder of the stand we had shared in against the Australians 50 years before. It was a delightful reunion, but sadly it was the last time we would meet as Willie died in Johannesburg, South Africa, on April 24, aged 84. However, many happy memories linger on. After all, we had toured the Caribbean and Australia together, I bowled against him for Essex, batted with him for England and trained with him on the Scarborough football ground before breakfast during the cricket festival, which was painful after several heavy nights. \n",
        "Willie was a superb natural athlete and ball player who glided over football and cricket fields with both grace and pace. He was one of that very small select band who represented England at both cricket and football. This is something that will never happen again as football and indeed rugby have invaded the summer.",
        "I believe Willie would have made more appearances at both cricket and football, if he had not spent five years in his late teens and early 20s in the army, instead of being coached by Yorkshire and Huddersfield Town Football Club. Our finest batsmen after the hostilities, Hutton, Compton and Edrich, had all established themselves at Test level in the late 1930s.",
        "Willie was originally an inside-forward but became a wing-half when he signed for Sunderland in 1946. He played for England on four occasions in 1949 when he was better known for his football than his cricket and was also included in the English squad for the World Cup in Brazil in 1950. He did not play in a match, however, probably because his manager wanted a defensive rather than an attacking wing-half. What impressed Willie out there was the artistry and the footwork displayed by all of the South American footballers, not just their forwards.",
        "Although Willie made his first appearance for Yorkshire in 1939, it was not until the War ended and he was released from the army that he established himself as a dependable, attractive middle-order stroke player and an outstanding athletic fielder in an era when the fielding was poor compared with present standards. Although the Yorkshire batting was always strong, it seemed to include good players that promised much but never quite made it, like Gerald Smithson who was picked for the 1947-48 West Indian tour. Although Willie soon became a permanent member in his county side he was never a regular fixture for England, probably due to a batting average of 25.85 in 23 Tests.",
        "Originally he was known for his football more than his cricket, but this ended at Lord's against the Australians when I joined him on the last day with the score at 73 for 4. We remained together for almost four hours, while Willie was at the crease for 346 minutes. He completed his century, the match was eventually drawn and he became a legend. Our partnership did illustrate that in certain circumstances a draw can be very exciting as spectators came through the turnstiles after lunch on the fifth day of a game that appeared lost. Sadly Willie was not chosen for the final Test when we regained the Ashes and he was picked for England again spasmodically. Willie joined Leicestershire in 1958, for whom he scored heavily and led with much charm until he retired in 1964.",
        "In the 1950s Willie became player-manager of Halifax and later returned as manager in 1964 after a two-year stint as an England Test selector, and he also had a spell in charge of Bradford. In 1968 he found the perfect job for him as coach and administrator of the Wanderers in Johannesburg. It really was an ideal appointment and, not surprisingly with his knowledge and background, he settled very contentedly.",
        null,
        null,
        "Born in Bolton-on-Dearne in Yorkshire in 1920, Watson was a fine allround sportsman. Apart from cricket, in which he made his debut for Yorkshire in 1939, he was also a fine footballer. He played for Huddersfield, Sunderland and Halifax, and won four England caps. He was part of the first England squad that took part in the World Cup, in Brazil in 1950, although he didn't actually play a match. The following year he made his England Test debut, against South Africa at Trent Bridge, scoring 57 in his first match and 79 in his second. But Watson was jostling for a position with the likes of Hutton, Compton, Edrich, May, Graveney and Cowdrey, in a golden era of English batting, and found it difficult to nail down a regular place in the side. Even after that hundred on debut against Australia at Lord's in 1953, when his four-hour stand of 163 with Bailey saved the game, Watson wasn't secure: he was dropped before the end of the series, and missed the deciding final Test at The Oval, which England won to recapture the Ashes after 19 years.",
        "Football commitments at an end, Watson toured West Indies in 1953-54, and added a second Test century in Jamaica. He flitted in and out of the Test side until the end of the decade, playing his last Tests in Australasia in 1958-59, when one of his team-mates was another double cricket/football international, Arthur Milton. Watson finished with 879 runs from his 23 Tests, at an average of 25.85. By then Watson was playing his county cricket for Leicestershire, whom he'd joined as assistant secretary and captain in 1958. He played on to 1964, finishing with 25,670 runs in all (39.86), including 55 centuries. His highest score was 257, for MCC against British Guiana at Georgetown in 1953-54, when he shared a stand of 402 with Tom Graveney, who made 231. In England Watson's best was 217 not out, for Leicestershire against Somerset at Taunton in 1961, when he shared an unbroken third-wicket stand of 316 with Alan Wharton, which remained a county record until 2003. And he carried his bat for his new county against his old one in 1959, scoring 79 not out in Leicestershire's total of 132 against Yorkshire at Grace Road. That season - which ironically followed what turned out to be his last Test appearance - proved to be his most prolific one, as he passed 2000 runs for the first time and finished with 2212 at 55.30.",
        null
    ],
    "recent_matches": [
        {},
        {},
        {}
    ]
}